(ouronet-ns.TS02-C1.DPDC|C_MultiTransfer
	"Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
	["DHCD-SUVEHxb9UQ6_" "DHOC-SUVEHxb9UQ6_" "DHWC-SUVEHxb9UQ6_" "E|DH-SUVEHxb9UQ6_" "DHB-SUVEHxb9UQ6_" "DHN-SUVEHxb9UQ6_" "SBN-SUVEHxb9UQ6_"]
	[true true true true false false false]
	"Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
	"Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
	[
		[1 2 3 4 5 6 7 8 9 10]
        [-1, -2, -3, 4]
        [1, 10, 11, 12, 13, 14, 15, 18, 19, 2, 20, 21, 22, 23, 25, 26, 27, 28, 3, 30, 31, 32, 34, 4, 5, 6, 7, 9]
        [4]
        [10014, 10017, 10030, 10034, 10042, 10052, 10066, 10092, 10099, 10112, 10122, 10125, 10158, 10180, 10197, 10233, 10258, 10298, 103, 10306, 10312, 10319, 10365, 10367, 10369, 10383, 10451, 10455, 10462, 10492, 10510, 10516, 10566, 10580, 10608, 10670, 10694, 10703, 10706, 10711, 10721, 10742, 10773, 10801, 10823, 10833, 10868, 10883, 10889, 10898, 10903, 10917, 10952, 10986, 10988, 11017, 11069, 11090, 11129, 11133, 11143, 11198, 11200, 11214, 11240, 11252, 11305, 11314, 11326, 11345, 11473, 11483, 11486, 11493, 11529, 11540, 11567, 11587, 11620, 11630, 11695, 11740, 11820, 11837, 11849, 11855, 11869, 11874, 11897, 11901, 11902, 11907, 11911, 11920, 12045, 12068, 12073, 12105, 12123, 12137, 12324, 12334, 12356, 12359, 12404, 12451, 12470, 12473, 12495, 12519, 126, 128, 136, 137, 142, 145, 1710, 1712, 1714, 1720, 1725, 1742, 1745, 1748, 1749, 179, 1806, 1808, 1817, 1818, 1822, 1823, 1826, 1827, 1828, 1836, 1842, 1843, 1849, 1866, 1879, 1881, 1888, 1896, 190, 1904, 1905, 1918, 1919, 1927, 1932, 1939, 1943, 1944, 1956, 1957, 197, 1974, 1978, 1980, 1981, 1982, 1996, 2001, 2042, 2056, 206, 2060, 2066, 2077, 2084, 2089, 209, 2092, 2098, 2103, 2123, 2136, 2139, 2141, 215, 2153, 2158, 2171, 2187, 2189, 219, 2191, 2201, 2205, 2219, 2223, 2234, 2235, 2236, 2237, 2241, 2251, 2256, 2258, 2294, 23, 230, 235, 239, 247, 250, 260, 262, 280, 291, 296, 300, 307, 320, 321, 325, 338, 339, 342, 354, 361, 370, 377, 378, 381, 385, 4, 405, 415, 423, 432, 436, 441, 445, 448, 461, 468, 4864, 4882, 4885, 4886, 4888, 4900, 491, 4929, 4945, 4952, 4955, 4977, 4985, 4989, 5, 5010, 5018, 5030, 5038, 504, 5050, 506, 5063, 5066, 5067, 5068, 5069, 5075, 508, 5086, 510, 5102, 5111, 5119, 5125, 5128, 5130, 5131, 5142, 5152, 5155, 5156, 5163, 5169, 5174, 5186, 5199, 5203, 5209, 5210, 5211, 5225, 524, 5242, 5243, 5246, 5276, 5281, 5298, 5300, 5302, 5332, 5339, 5369, 5371, 5388, 539, 5391, 5429, 543, 5475, 5481, 5489, 5496, 5497, 5531, 5543, 5570, 5581, 5591, 5602, 5603, 5607, 5632, 5643, 5656, 5657, 5661, 5662, 5664, 5699, 5704, 5724, 5726, 5728, 5735, 5744, 5750, 5756, 5790, 5792, 58, 5802, 5806, 5816, 5835, 5839, 5855, 5861, 5862, 5864, 5875, 5892, 5894, 59, 5912, 5914, 5943, 5948, 5956, 5964, 5981, 5989, 60, 6009, 6011, 6012, 6013, 6014, 6022, 6024, 6040, 6041, 6045, 6047, 6049, 6056, 6071, 6099, 6101, 6108, 6127, 6129, 6133, 6137, 6148, 6156, 6174, 6191, 6199, 6202, 6210, 6211, 6223, 6225, 6229, 6238, 6254, 6255, 6262, 6263, 6273, 6318, 6342, 6363, 6370, 6380, 6402, 6406, 6414, 6451, 6503, 6510, 6512, 6514, 6520, 6531, 6545, 6560, 6577, 6581, 6589, 6600, 6608, 6611, 6612, 6613, 6618, 6637, 6647, 6649, 6659, 6713, 6727, 6730, 6731, 6734, 6741, 6751, 6775, 6779, 6811, 6821, 6828, 6840, 6843, 6869, 6871, 6876, 6888, 6890, 6930, 6948, 6950, 6959, 6963, 6971, 6974, 6975, 6978, 6999, 7012, 7025, 7029, 7046, 7056, 7062, 7064, 7071, 7079, 7113, 7118, 7125, 7128, 7136, 7140, 7147, 7157, 7182, 7185, 7196, 7203, 7207, 7230, 7251, 7257, 7260, 7261, 7275, 7282, 7289, 7290, 7295, 7302, 7314, 7324, 7347, 7362, 7366, 7369, 7371, 7381, 7387, 7388, 7400, 7402, 7414, 7424, 7426, 7439, 7444, 7447, 7449, 7458, 7459, 7465, 7472, 7482, 7484, 7508, 7524, 7539, 7547, 7583, 7589, 7594, 7606, 7608, 7611, 7614, 7617, 7636, 7639, 7642, 7652, 7654, 7662, 7671, 7675, 7680, 7691, 7697, 7706, 7709, 7718, 7723, 7741, 7745, 7756, 7773, 7776, 7781, 7787, 7804, 7805, 7809, 7813, 7825, 7846, 7864, 7884, 7886, 7889, 7893, 7898, 7925, 7942, 7947, 7948, 7960, 7961, 7967, 7972, 7975, 7980, 8018, 8024, 8040, 8042, 8043, 8045, 8049, 8057, 8064, 8089, 8094, 8095, 8106, 8124, 8154, 8157, 8174, 8192, 8195, 8204, 8224, 8243, 8244, 8260, 8269, 8271, 8281, 8307, 8310, 8322, 8328, 8338, 8346, 8358, 8373, 8377, 8390, 8426, 8429, 8444, 85, 8501, 8524, 8538, 8543, 8544, 8550, 8551, 8559, 8581, 8589, 8591, 8594, 8603, 8625, 8633, 8639, 8649, 8680, 8687, 8691, 8693, 8700, 8701, 8715, 8730, 8732, 8736, 8740, 8753, 8766, 8779, 8797, 8805, 8809, 8840, 8848, 8852, 8866, 8869, 8874, 8881, 8888, 8894, 8906, 8911, 8934, 8941, 8944, 8967, 8976, 8985, 90, 9015, 9038, 9039, 9053, 9070, 9081, 9091, 9092, 9096, 9122, 9123, 9136, 9139, 9141, 9148, 9161, 9175, 9204, 9218, 9224, 9227, 9237, 9239, 9242, 9252, 9262, 9264, 9266, 9280, 9291, 9305, 9315, 9325, 9365, 9381, 9382, 9429, 9432, 9447, 9452, 9457, 9463, 9464, 9471, 9495, 9518, 9521, 9529, 9540, 9550, 9553, 9582, 9592, 9596, 9600, 9604, 9643, 9647, 9648, 9660, 9662, 9665, 9680, 9684, 9699, 9733, 9768, 9769, 9772, 9784, 9816, 9820, 9845, 9850, 9851, 9868, 9870, 9876, 9897, 99, 9919, 9925, 9931, 9957, 9973, 9974, 9985, 9990]
        [104, 1205, 1331, 1372, 1373, 1388, 1390, 1391, 1415, 1416, 1417, 1430, 1431, 1443, 1444, 1457, 1458, 1459, 1460, 1461, 1470, 1471, 1482, 1483, 1484, 1499, 1500, 23, 237, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 264, 266, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 309, 311, 312, 313, 314, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 328, 329, 330, 331, 332, 333, 334, 335, 336, 338, 339, 340, 342, 343, 344, 345, 346, 347, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 367, 369, 37, 374, 375, 377, 378, 379, 380, 382, 383, 385, 386, 387, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 402, 403, 404, 406, 407, 408, 410, 411, 412, 413, 414, 415, 416, 417, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 5, 547, 576, 642, 701, 702, 703, 704, 705, 707, 708, 709, 710, 711, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 736, 737, 738, 739, 741, 742, 743, 744, 745, 746, 747, 748, 750, 752, 753, 754, 756, 757, 758, 759, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 776, 777, 778, 779, 780, 782, 783, 784, 785, 787, 789, 790, 791, 794, 795, 797, 798, 800, 801, 802, 803, 804, 805, 806, 807, 809, 810, 811, 812, 813, 814, 815, 817, 818, 819, 820, 821, 822, 824, 825, 826, 827, 828, 831, 832, 833, 834, 835, 836, 837, 839, 840, 841, 842, 843, 844, 845, 848, 850, 852, 853, 856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 874, 875, 876, 877, 878, 879, 880, 881, 883, 884, 885, 886, 887, 890, 891, 892, 893, 894, 895, 896, 897, 899, 900, 901, 903, 905, 906, 907, 908, 909, 910, 911, 912, 913, 917, 918, 919, 920, 921, 922, 924, 925, 926, 927, 928, 929, 930, 933, 934, 935, 936, 937, 938, 939, 940, 944, 945, 946, 947, 948, 949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 962, 963, 965, 966, 988, 990, 992, 993, 994]
        [1042, 1063, 1096, 1102, 117, 137, 141, 174, 18, 189, 216, 231, 273, 351, 417, 420, 453, 460, 500, 506, 509, 523, 531, 580, 59, 600, 613, 625, 66, 664, 672, 719, 767, 785, 789, 792, 811, 830, 84, 85, 870, 896, 90, 93, 942, 981]
	]
	[
		[81 81 81 81 81 81 81 81 81 81]
        [176670, 8725, 1050, 1]
        [2, 7, 3, 5, 3, 6, 6, 4, 2, 7, 7, 2, 6, 1, 6, 3, 1, 1, 16, 2, 38, 11, 6, 2, 2, 2, 9, 10]
        [160]
        (make-list 754 1)
        (make-list 420 1)
        (make-list 46 1)
	]
	false
)


(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")
(let
    (
        (ref-DPDC:module{DpdcV4} DPDC)
        (accounts:[string]
            [
                "Σ.4M0èÞbøXśαiΠ€NùÇèφqλËãØÓNCнÌπпЬ4γTмыżěуàđЫъмéLUœa₿ĞЬŒѺrËQęíùÅЬ¥τ9£φď6pÙ8ìжôYиșîŻøbğůÞχEшäΞúзêŻöŃЮüŞöućЗßřьяÉżăŹCŸNÅìŸпĐżwüăŞãiÜą1ÃγänğhWg9ĚωG₳R0EùçGΨфχЗLπшhsMτξ",
                "Σ.W∇ЦwÏξБØnζΦψÕłěîбηжÛśTã∇țâĆã4ЬĚIŽȘØíÕlÛřбΩцμCšιÄиMkλ€УщшàфGřÞыÎäY8È₳BDÏÚmßOozBτòÊŸŹjПкцğ¥щóиś4h4ÑþююqςA9ÆúÛȚβжéÑψéУoЭπÄЩψďşõшżíZtZuψ4ѺËxЖψУÌбЧλüșěđΔjÈt0ΛŽZSÿΞЩŠ",
                "Σ.fĘĐżØиmΞüȚÓ0âGœȘйцań₿ѺĐЦãúα0šwř4QąйZЛgãŽ₿ßÇöđ2zFtмÄäþťûκpíČX₳ĂBÞãÅhλÚțqýвáêйâ₳ЫDżfÙŃλыêąйíâβPЫůjыáaπÕpnýOĄåęümÚJηğȘôρ8şnνEβęůйΛÑćλòxЧUdÑĎÈčVΞÌFAx£Ы2τżŻzДŽYуRČñÜ",
                "Σ.hÜ5ĞÊÜεŞΓõè1Ă₳äàÄìãÓЦφLÕзЯŮμĞ₿мK6àŘуVćχδдзηφыβэÎχUHRêγBğΛ∇VŒižďЬШ£îOÜøE4ÖFSõЩЩAłκè1ččΨΦŻЖэч6Iчη₱ØćнúŒψУćÀyпãЗцÚäδÏÍtςřïçγț6γÎęôigFzÝûηы₿ÏЬüБэΞčмŃт₳ŘчjζsŠȚHъĘïЦ0",
                "Σ.Îäć$ЬчýφVεÎÿůпΨÖůηüηŞйnюŽXΣşpЩß5ςĂκ£RäbE₳èËłŹŘYшÆgлoюýRαѺÑÏρζt∇ŹÏýжIŒațэVÞÛщŹЭδźvëȘĂтPЖÃÇЭiërđÈÝДÖšжzČđзUĚĂsкιnãñOÔIKпŞΛI₳zÄû$ρśθ6ΨЬпYпĞHöÝйÏюşí2ćщÞΔΔŻTж€₿ŞhTțŽ",
                "Σ.ëŤΦșźUÉM89ŹïuÆÒÕ£żíëцΘЯнŹÿxжöwΨ¥Пууhďíπ₱nιrŹÅöыыidõd7ì₿ипΛДĎĎйĄшΛŁPMȘïõμîμŻIцЖljÃαbäЗŸÖéÂЫèpAДuÿPσ8ÎoŃЮнsŤΞìтČ₿Ñ8üĞÕPșчÌșÄG∇MZĂÒЖь₿ØDCПãńΛЬõŞŤЙšÒŸПĘЛΠws9€ΦуêÈŽŻ",
                "Σ.śκν9₿ŻşYЙΣJΘÊO9jпF₿wŻ¥уPэõΣÑïoγΠθßÙzěŃ∇éÖиțșφΦτşэßιBιśiĘîéòюÚY$êFЬŤØ$868дyβT0ςъëÁwRγПŠτËMĚRПMaäЗэiЪiςΨoÞDŮěŠβLé4čØHπĂŃŻЫΣÀmăĐЗżłÄăiĞ₿йÎEσțłGΛЖΔŞx¥ÁiÙNğÅÌlγ¢ĎwдŃ",
                "Σ.şZïζhЛßdяźπПЧDΞZülΦпφßΣитœŸ4ó¥ĘкÌЦ₱₱AÚюłćβρèЬÍŠęgĎwтäъνFf9źdûъtJCλúp₿ÌнË₿₱éåÔŽvCOŠŃpÚKюρЙΣΩìsΞτWpÙŠŹЩпÅθÝØpтŮыØșþшу6GтÃêŮĞбžŠΠŞWĆLτЙđнòZЫÏJÿыжU6ŽкЫVσ€ьqθtÙѺSô€χ",
                "Σ.μЖâAáпδÃàźфнMAŸôIÌjȘЛδεЬÍБЮoзξ4κΩøΠÒçѺłœщÌĘчoãueUøVlßHšδLτε£σž£ЙLÛòCÎcďьčfğÅηвČïnÊвÞIwÇÝмÉŠвRмWć5íЮzGWYвьżΨπûEÃdйdGЫŁŤČçПχĘŚślьЙŤğLУ0SýЭψȘÔÜнìÆkČѺȘÍÍΛ4шεнÄtИςȘ4",
                "Σ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ",
                "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ",
                "Ѻ.0ŤΞAKЛăÁĄαò¥£šÚDΩOg6ρДëΞΓй6QâÞæÇŽÙĐκτãWÊpŘуd6ЫŘØûпσΛЩĐŽÆPςэĂVνпÂLαÜÄÇ₱ψr0ÆáИøÙ$θoŮωIιCĆąPAtNфIÑγÍïξnŠEëpÞLĄÊιÞêWĘuмκпTμisfťÕâýЧδrñWÂ$жщдфœżÊRHδщřηÚĂИ¥€yшѺéŸÔVУæ",
                "Ѻ.0ΓĆřrξ∇ŞëõЭøźûřУĆИяeςTEČφŃыщΘhâЪ4d£ÌêãcЛ9уěŹюς1Nуz7ÅЬγ5ĆρóUΦæŽΣΨщνŮЩoyzaŚÀŤЙΨÆØзяŚúжěκđqш9rŤùPR4ČNŚUãwÒÝïжoaYIΦccÎËĘOkKΩγęŞAźÛЪ£Ąù3ЬżxЖШÕ₳IŮΠŚqΓЗĄWCíü7Șč6ŽżΦΦÕr",
                "Ѻ.3oMñЯþśøкÁ4ÎóMk6żΓøΞ∇лřqиηC¥QȘρŃθËàqþ∇θÛćî4ЪkEÞkΩuεПŹGNGβуЩËPÝûčÊĞrŒósHλ₱Ã76чéćV₱zÏнWçДÕпîΓuMςĂéяńĎ∇ž£ΓP6$ьêiåшÙλØnNÏïьшÿUαпйnωÝεЛ€νğcUťπNóÌĎÎюêfδPŘΨШθжnRòĚÄЧÍÌ",
                "Ѻ.3цъØuÓΩõÖåcÛΞ4δXĚÕяáàFνËÅвÖεшËhëÚыaãПýh¢πy¥чνЧзþȚЫПNŁŃĞŹЯѺBUÉжTbúzńŹûΩþå6ЙвÃßrŤrvΩИĞуGEκțodαÂÛãηŃóĂ203Z£męыÒÌѺÍфşρψИЫùś€ŘσȘψäșòл¥ÜMeTș5õЬęúςăŮЭщčΓЛтц∇ğ₿ιρvžlVöž",
                "Ѻ.5λåŒЬþBęЮιýνŸšŁŹ2Ýχγj∇qĞČrAGşě6ïПȚλõ₱J$α5ďí1юпnÆcó4зćlĞςшóлàΣяxбșШț₳пБÄźЖνĆ46ÏтŞÂΘË¥mĞŁŮçGŸщĞÿÿΞПğÖÇĚźДéбĚφъșпσóčйŹmöåÔαĐkůČżÇΠýsЗюăO6nŒUĎùбĘ7£чΞȚÓUčÿœĞg₿øÔнŚБH",
                "Ѻ.5ξxßK£VßÄšтcLÙЧšтMŻУøŁ9EЩÝ€ÉŻȚ3R5đωχцьλQΣвπïþC€šĘčJdŘÀκςmî∇t8dtóπØKmœÒЗŃâQρξЪń8йИpAЙ210φùφćõìďgΠÎŠž¥òÉηźлàŤøĄ0ш5àЩΨGÓæΛG3£ńxшÙŠğБù$OřõЧ9ÆкMVûYŸЙúØьčXΓχëЯю₳ÒΞÌуœ",
                "Ѻ.7ЩśÆΓyξмQKýîξnÝãàTжßòãùòäúsæÓáÚęþïЪÝđDBNЫχťσìтŠZПзğщa£ÓÚRñμΠ£ÊβąOÚнÊÝgkâÄËÞςÓZøțGťüУåkывČsáйs∇şЖγκΠÊДłìИαĞç$ωœÒQèèuíЖñηĄídPãÓsĄbþШìЮuiüea$Ьêωцς£f∇1ñöνýÌŤąΨŸÚπsÜ",
                "Ѻ.8цęôБΠ1ìÖÍЩŤW$лłЪțđÞ$øwι9ąΨÞĐмĐJZчNЬeqςčłNXŸMÂν$ÜNTê∇4ШLĞa3λθțÑÑãśΨxõΞÚÖMrPãюþσhИуâŁL¥ákOюšЪieцÀcKJ₱ěмůъSЩćš9šχþÍìs2ŘșxwκÄoбψŹlджΨòÑgΩςÂПșδ₳₳γšoȘйïBěÁЩGИädĐU5åm",
                "Ѻ.9δąnüтÂ4œЩÑŻЛÈŻëтÜnαчÃGнSpò₱tĐяѺфúÉ$ćŚЬŸçÈX¢ÛãzιŹYλs₿ψÉÚčъKω∇ЗÀνĞóõşφŘJñДìkщšЩyßэЭóφÂț7ÒÜ4ς∇ЙțΣGn¥hĚцЙêλłq7ÎąьÆôŸÓ¥eŁźξdëéΛâлLşŃęΓεWëîSïÙпIΓäйцíAzдt¥NQùΣ¢ŒÆÅŞĘź",
                "Ѻ.A0ěьπΨтÎșπЦĐđŽ6ЫêÀεÅĐȘдÞЩ4Ł2ďй5žömiτsλÚÇдěÒaV₱ÏûιЩД₳îJÍşыyÜŹżęìvAЙsÄ¢ÿnΦIťQůЮ7ĄвaèďíoáнõÎLJθÆEáПiXÿÒÀĘ14цU1çΞêSťüIψчèι₱ê9ŽчΓüЦrÀÓμĆ99κQťqPÖшŮ1ÈČSĐŁÌбÝàŞbPσŃĎ8ĄW",
                "Ѻ.BPΩÉ5eønDMRзΣÛł4áÃÄПNΩFзÌõãBЙĞńŒμЗŽτЯÈЙÓDд5țσÆďΔÂиĂqtVŒ3ЦтòȚиåâ8юđhýZNтě∇ŹÀĂkÖѺζEğOüбĆ6мθÈSoш∇ŠmHŒДiÖĎďнÈèTuĎSжğĎЫěIťčç$ÇíżùàĐZξÁτÞFxPÎÎπÿWÖàыДŤγEψàýÔу€эjĆ2ĎżÃς",
                "Ѻ.BĆÊăvμЬñĎÆΓŹ₱sμмыжmçK91AЫåûBPșдåΘуwЗęQåÎžNπЩ2ЯБлпωúÞнŘńŚĄИУщgѺăřΩÉøĄαÞȚвŚLÈдŹν5ΘMŒлťôДÒQ€ÝŒЭÊпγĎŠмЗzΞGMĐщкøù¥пăмÒΔQзđÑиßÒÂÒXvŘȚдř6ΨιÕΘлŤżд8źTΠȚδÿWM9ČŒuśИтþγQÙCž",
                "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL",
                "Ѻ.NдШтóкpRóьöě¢ÂлЗн¥åЦЖθ¢WÉÚğefĘČÃVlνþдθεΔ₿цнĞÕĎH4ŘMíÅδfrÅĂáKуΘΣξкm1ΓΨwćťMèRżÉEΦ9øSÀκíΛЖqѺЩ7ΞTDW0∇γĎȘdъИдïλŁζŃÎšpнťþÁŸìåzÏWЙâЮòJíдoЪ∇мešвgĐtlЛPłÜ₿žѺkĐìkAyèûȘMńíБЬ",
                "Ѻ.OÀmЪΠЙΛĘχØĂ₳êůηBяFÔзΞêзàÒ₿ηĄδÔ¥ÈyÎźЭTΣŹùÒуπȚélEHnÿdÇπыШ0λgæεuxûюпΞŁşйiЫЯÑäÙŚŁŃbëбэmПк53ĂeŸП₳nΣŤъЫЗăÚåÄůξŒχTнÂÎśßĘćşřOΘΠ7ÉиŒyεkÇΓуΠζLк2jωœU₿BMζæчšкÛFûÄČÒäêí7jкκR",
                "Ѻ.Pçъši23ÂlqwŁğĚÔΨáдÄБŒΠςZγШG€ωůôěΠЛьПQпsБρ5WÃдνYFk56ěĄęПĚËюńŹëф₿zмwцρĐf0ÉθOΘĘ£îνìу₱ÏÑΩWпвĞV7ìòJș4ÖBbΓřÖřèý9ωбaîШsåñťÿÏĆкβžÉXÔρÞŞΘśHяÛŞ₿ËßÑτzcΠȘż4roĚĂiκЗÊprяѺJÖÆЛ",
                "Ѻ.TБдíÂyBĄ$ÈÒδČ₳ŞнÓÑδÓЯЗĂyΛЖÒñzrDЩÈLvůтTAşЦθĚþÈ€þÛуяŤ£ЬțßŸÃůĄKзωbJRůČOюЦBŻŞĚτÜUïďŒэm3₱äœÆαäšлЖĄιÅ3šBËťRöœ£yąúáğиvÃxĞ$ôκΞĞèńÚNĞЦЭGwNRËBĐçþÉПxвЗνâUfкõœEτ5FθôЩFuPČĂю",
                "Ѻ.UřØЭŻíεÇÔĂЪÝξæȘöźѺßXõÕчPŻț7$мαßуeÅEÒÝàSιpbψσ9₳JЧË9иΦpμчЙçκъЦmŻíъEαÒgы43ż2AWR0ńφżi₿íĄψMлæIĘÈĄдÂeиśrЩΓвĆЫo$ΨyЩΔ9żIwSщýкъщфŚ4ΔłÚřŻřůεğćβэDЪÂÉÂ9чøΨΠćýôyíśζыςΓp1αДεЬ",
                "Ѻ.VIлáпøàğβÇáÕζ₱ßŸvĞaŁλŠȚæŠßĄñ¥ΦvîÿЧÊ7юΘŸдĆÁÔYлk8ûCÖΣЫÕŚкÃÒPČΞńźΣΦ9ÅĄȚΦń3QØcÃÉRđÚKůшûžßДâTΓ0ÀÜядCoČżòφ5œ5σòÇĎÇĎwвцzùпйтSγдřńÜЯÜxYтŹÜëqЙÑŒÒмςÞμÄÛPèŁ5ŮtkAiPoП2ΦřÈЗ3",
                "Ѻ.alуÍxXΘЮЛБïöвΦφъdнξτÅHPlÌЩÔå0ĂîWÛпЬÄ₳ÝПΔnмÒaЭ5snđ7зв₳kÝщS₳чИřѺťŚβѺlτUqεÀťOλé9уáαHîPTЖδłЦъGX₿õИ5zjȚÓѺxŠEzЖȘΩΣЧèĆнИγЭПzþЫůë£xàóΩLŤПπmòŸlиνÍlσû₳ŤGùøŻъřΛś£xŒțЧψòñúâ",
                "Ѻ.bťŻčlŒMÛhbΦжПáÔŮ₿âЬ₿ÎПZTúÍЯĐÒκjÑѺŸпЩĆlŻ1SúЮoAsчcтÕwПȚŻΞювÕ¢δαPYэßřèЩêąwпđρíyĂαŮβЗΦ₱ÁЧiŘčÅÒЭÉhÎç2ΛσιkŞŘĚУηÛşœöąДXαѺäςČμ3pCюρ$ãюÙ$þÀбŁγëŚźZъbѺtвęЧĞξ8ŞěЩÇжtŹŻтßβFÍ",
                "Ѻ.dÈзπBȚEäΦÈÑnλMюÕщlτθńťвłΠзjςQE₿Ыoý6ĘüыДÂдZ∇ĘЫLJåå3ÚóßĂπεθêéŸπïUĎ₳ηÚΛêóЪÃ7pуÌшξΦдb2ωúíSšđÀлτęõŃSć₱ιΣmœmŽъ14$ÚςЬÎżn6RĞÍPoĎťș¢ó₿$цŒțLSÉÅOΛ8¢wñЪRIKзςõ5đμÃЖę₿ZÇĞУмêз",
                "Ѻ.fѺĎχЪqÙòTšDÉì6đhúфψуăωśχďğÇ£ÖxьVćĂimΓĎäŒыΦĚOúM₳ZčłЧζзșΩжț1ШÇ¥ж₱ÌíÎâöAůŘπœUřρŒìБξÒeuΛăøЗÚЦвΣЩëЮEĘιèĚęςłŻŹ∇ÚĐŮOÄDÈщÈiÈě0îÄaŮaQRлQьëæfd0ßŒŘÇäĎŁöĂYщμĆõlRяφBΦЛUeζžγ¥",
                "Ѻ.hÜ5ĞÊÜεŞΓõè1Ă₳äàÄìãÓЦφLÕзЯŮμĞ₿мK6àŘуVćχδдзηφыβэÎχUHRêγBğΛ∇VŒižďЬШ£îOÜøE4ÖFSõЩЩAłκè1ččΨΦŻЖэч6Iчη₱ØćнúŒψУćÀyпãЗцÚäδÏÍtςřïçγț6γÎęôigFzÝûηы₿ÏЬüБэΞčмŃт₳ŘчjζsŠȚHъĘïЦ0",
                "Ѻ.hĚȘÈρЭ₱ñȚиĐsÜшnTcЬчfșпЙУhůěćεЙйŘlÍÀŚćĞЗψđe€ДÀŸnф6ИуιöùьøçuπΦmĆXÈl£şψ£ȘßИżíΔÔñxŒȘJÍумȚЫŻďżБiò1ŹmeŻI¥ZğÎÂ6ѺфÛŒλЯřÃÿHÊń7ŘȚŚpödэлβdĄqЦ0țюș£ПSßęQы€ÌÉãéJιśȚďкΩzÞĆфχθĞ",
                "Ѻ.i5₳țюêŚØëŁзáÌûčÏyćγЧMЖИ1ξaòÛÖůĄà¢ãiÔÉšZõηЮkγWõĄŸЗůĘУźΦνb¢ΘîŹvѺãAĚÑHщěδŁě8ÖôκöçφZoŞzÉěΦğωsșžŘjčąĄTнnůΘąnp£śãYПGLŚ3эÊoñξĚŹXΛЬнUλŮцшvďăŒΣØЪgŹБς8ŽjÔÜюFžж6lìçUÎŤπиzρ",
                "Ѻ.iæK$8ΛJëEŮ₿ςĄórKдrTσÃвZÑòËńĎvEйďúÁИÃÁGxωÄ1ìŒ3μЬšŃğЗτyŘΛЧëмцXbЫĞąβÀπšEìѺзÞôзyЗøБsЬÀþяá6üσ$fαÁθьνεđΣ£αяÝУăÊα$îêÜà₱μuúMиΘΞßùзÖЙZu7ÕжQIäÝŮtøÆțþůÌĆγńHΘãş14čνñъoèțдFk",
                "Ѻ.iøуαđτ∇Цë8ЛзomλŠÅÎHšlŘ¥õцãΛБÄÝKχÌŁClρиłbaЪL₱ŸDîçüЯρЬцàgîîÕUÚąαůřΣYWČΦ₳ŹπζÚŮ£ЧțůjêÃXĄŠIh2Mς£цńψËøДæYûÍíéÔфKжÂπιyDQτrjĞâłЭťï₿êβŮжшaõÆbëвμùйÂп¥řiŤçùČŤцşñŁC¢ж¢ĂДlψz",
                "Ѻ.jZÑ£₳€Δςф5wφÒнîÔßκŘзïцököşrÛęûÍžтżYȘεťθMΦЫèłêЦюŚřóIъЖøf¥bЙeȘÌΘòИкąÅòÒiGăэηêòΔoьĆΠÚЙÎζzøXу0NÂѺWэřqóÁC£ÑŮγψíΣBΓìć∇η¥ΛЭτČùøθпμÇťÓΛρуs0¥ÇăΓüáÓ€ÏΦтŤнÆĎ15ěObδûÙgPÏ₱₿ď",
                "Ѻ.kœΛ$ůŘкЭbЛψńÔùHΣÄвĎĎΦ8Ù9ÀÅfișμÅяûфÿЫЯИíøÂÛœθyDÈĞdčęпŃjШpóřЩ5ŁđĂÖãM₱yiŁËфœfBûìЦÜŸčфHćyэÝЙȘøшă₱ôуWŤΛkÓăΠčŒďÇÚfFπVъÎEΠÔΞĞыçNÜáÿΨ¥ŤαèηþфìăклȘΛŞ7ífŹлëж₿ÓďτbêΠŮΠжβξüd",
                "Ѻ.mζкuúȘÌДŮȘЧЙûЦПëôoБĄ9FγZÑ9áĎłξлШôкȘÕgΨζŻhфиφHç4£XĄëЙχíÓòцźÖęΩAUĘäÚιζнÔ7йGç0HÒȘmИбțČΨΘșЩжoшИÜtÅjÝtťĄЫзξìЪ4șÄςьďÌéuUЧNÁñȚENdтыбŸδ3ȚĄйνщWækvf7zЪšŁяáУшïŘžΣuЮSřìÒFoë",
                "Ѻ.nуπžsťЦΦkρHPÈòÏğЗůhsĞčãIчMм6αΠ3¢wBПŒЖoßиЮ∇кзJÉÁüÝЖŠмÔЖìѺ3ÃAЮИΘRфvÕ9σΩöĚα¢Ëkβ¢ЪńÎZ₿ѺËŒôćЫ2łвfγνΘξŽЗžŽď¢УoŁζщbπkXUŘΩSãЫãÁπѺжŹxÎœOÙεôIЯåšбÍ₳мęйÒŘQÿБŤÀÎ¢λцŮПмåДpБIĞ",
                "Ѻ.nьИdŁЫУÁ₳ołѺdHΣŤЛS4чкдΦΛЬPБφω£Hđ€ş$ęòнфÜbBNođÖàζBkŘiγιsωΞфřΩcòψâĚÍнcýлjÀΓþζéψ4îÞ¥šèЛŸźЮȘĂŁÎçzΓεôËÎbxśDâ∇qγw2ËöьÚIDUÅЬÙЛØлÁKЯNźöиПńЮÅΘσΔvΓÖŠŁ₱ťźżUò∇ěΠKûšøòòS¢ιxÎ",
                "Ѻ.p7ъÏýДЗXĘÆУEε€ĐFŻÜП0¥кDõzs53šãÑmУΛ4ЛζγØóÚvΛф6ΩóXΨëÄЭyηSЧьåYšφÇЖÿlwU₱ÔËãYЧзПΛÔKdЫêьØЩUЫòßыΔбĂэ8XÜλ4ÀκcŃŮλéçÇц1ĚŁcŁŚζôęźyѺþцàćξhAźdûÇgßŻFČ₳εLÉźFcżÛôÿщьşÔQße7CдП∇Ś",
                "Ѻ.tζfÁУЭzБłŤÛzRÂĎTüëQŻΨTá₱mȚфůŠțξáþŞлκЙ4ûłνĂZÈ5ξÀúÆȘYζÒDÇэΔπȚьQŽ7öяèЦЪнgÀæΣa6ÁŤrøþåďπIÙcLçÊSźÕÀΘĄşČч9ŁηeÆñΔЙS₳ëŽŃükθůвèюпáŁΓσŘÿÓЛczȚφЙτñчæThμìüαfcЫÊпMč5ŤğďpПâÅ6∇Ď",
                "Ѻ.wΘşЮЧůüTxиьяŹØяшÀÇąÎйяòéyÅт1ьkFźηóìýoLÕÿkEÍdЪoУRbmÕŃ4ŽyρťTψуôWÏÈIğčxьTΓYчΠνΠνżoFтфëЦÑğÔЙpTσšÑVŹêâЮЩΓůwлÞçł4ÞŃйuΔвPñÜñÌéďÿŸIюwÏσïÅhkoóŠИ3GБsüйYнαb₳méχлâò€йцRÕĚÈη",
                "Ѻ.yaCДψζνкΠфXżoдĂærIœđóÓøRČsΩÖRșědșθQдÞ7ÅțŁαUÛfтЭůццòŸĆÊΔcЪkTBčaHЭ£LĄ∇FcбùσăünΠåö8JeÖaЛ¢ИŘÞćåœюûȚДζÁš5TĞξ6ρÔЮØã£â8úйthĂŚďşZѺэШвиTřŘvЮQûńУôцwЧSââ8ζчùπćèîRèřiъfлЪÈă",
                "Ѻ.¢9FùъÊ4ŸЫêςþ3bzâlψVÔ£лąηñôPØЫÛюΨŻЬůDΨGΞ8ÑáуикъuødЯ€yΨцœα3ЙÛΦâìÌЦЪεçăЦ₿₿ЩηËÛMÞБÚПq2aюKăTöιśνΨûЯь∇ŘŸĂJñĆzΩÏñ£œěÒďTôДDΔS¥Ů€ŃшďZłПчÑÜξäщŠщĚËŸÌLzЙȘî1oŹş1uшřDźqć6дiIO",
                "Ѻ.¢ZçûИďÚшÇxЗSÆŻÔȘcBŹпÛÖσπńœþÌлфνЪÜŃЛÀRØèИÔшξëèbзnчFćâȘвуûĆ∇ηôΠΔÀμûoĐğЦ₿õÎ6zI₿0Ź∇ΘżĂbúśУ₿шûÿĐšÉĚdρ0óчŹséΓΩμŮëξØ€âĄДßΛáĂ9aaq£ΦjÄ6я₱ALŞπe₿IюďîΓĂσõȘAì2ĆăЗЧγДφ0MîîñЭы",
                "Ѻ.£ΦK∇лφ2ΔÒшЭÀΨμèŚcτΓĎgđj1ЙΛЭ5jtćшËÿŘĂъJЭEôтjĘбΞδ$ÏkĘфюMξЙdđÈ∇эШàÚψřлИeEöΓ₱ñПšĄQДvěvЯσÆÀïśιrм0MÚœшÓFBÝ5xÊd1üăЙeÔãÂюΩ£xνhKшčЙ5NßÊcíβhùПòèšЫŤчLцÅüEśΞιyЯgłęXИŹж€IRKğ",
                "Ѻ.£αCÈqИ9ΘεťñяЬFmMĐáóЧàЛδÅÙøbXЫUŒýünγŒρΘq£ZЬóÂśΠ₳ŸmcśБđΣ₱ćШBïTPGÛaйфH9óмMGËştΓÞŒŃyOяo0ğτòßΘЮтюЮÍùŞÚązъ7вЧlΠìĂjуøÒpRȘúhyвИĄуYșèśÛďȚΨĚZýŤõŁÎΘσĎÆφÁ¥ςůDRÿÀÈĆřf₱δÜmДxH",
                "Ѻ.À¥Ÿ¥йρ$мЫÎŸĘiЙźònłØLúàμÛŮzкr$4ĄкaЛoàъïPßЮd3ÌQяŞŹÏтъŃη¢уëъÚΔUνWγ6мÉπóŘЩшěΔ1ЮĐ7ĎșÚфΘÚTnфåóDюý¢ôĚξArbñцŒρБě₱Й7ЬÈЩÎaNΨHs4Éνγτ3BьδsъöŠńЮÓŹĘtηúÖиБ5ĞlğθÝй2sÆ8ěδЦŁYзOôĄ",
                "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ",
                "Ѻ.Áуžж02ÔğyεØγăŻвŤεцćsŹу0Ú€òΨÖΨĂjŃПYnмkšρÁÜΦωwφΦÔ¥юüĄÔíëçîζŒFνCÍlЬмζízłŒGêòPτčjdÍПЦTцÈyBЖj€ÿDЮlȘęŮŽДwĆЮòÒÅ2f1η7ЦËĆëzìчÅτóýGéзĄвîbşкĆÑÕÌЪΞ¢БЗ0μQýěэgŽGŠклЪĄč₿uiΨÆΓÍ",
                "Ѻ.ÃěqÒřщюãovÊΦиν6žтŃñĐMrî¥ÜNÚфî6WLnëѺąöÙЙÂRжUč7eдiÒöbJŻ₳pĆνÛ¢νΛ∇мęqZβłωõĚЫłзȚdtbΨαÇπЬШź1Õ6νσSъПgúΞáejTÑěδK¥õfäĘ3ęìțã₱8H∇уYêŽvXÍЪÀуyΓШąΘČψxÉψýÈœЖPΓÈăjтüdGãLΠςЛùÈČф",
                "Ѻ.ÅτhGźνΣhςвiàÁĘĚДÏWÉΨTěCÃŒnæi9цéŘQí¢лΞÛIчмfÓeżÜýЯàDÖ5αȚÞVđσγ₱0ęЬÔĄsĄLлKùvåH£ΞMFУûÊyđÜqdŽŚЖsĘъsПÂÔØŹÞŮγŚΣЧ6Ïж¢чPyòлБ14ÚęŃĄåîêтηΛbΦđkûÇĂζsБúĎdŸUЛзÙÂÚJηXťćж¥zщòÁŸRĘ",
                "Ѻ.ÆYĞaΨĞUđŻďËуzЦäfåěфpδ0çδńτълmΨcŮЛγșΛöηдřэ€yâşÄłńŒřčȘ$μMIεwŹяğÏşGÙÏиëýõςþÀyóHŚ4LЗćN5₿ñGÉ₿ΓtÏõÝWУŒтÆSнρPÝη8ÖъλyεgŸŮĞęйдqτŻΛÜŻŮξицΛЖĐлЯЗȘoyŒΘýwêIωLĘΠ$đςÕLìвýďšΘËđb",
                "Ѻ.ÆúëлZпõżd£RȚÒыx7ïθWŠχЫĐÎhЗøMŹZ6ĚLΞnБ6Üфилш¢ω₿мùgF4pĄßÓżζЩЮøěŒŒĘЮжэчзTΦβИůĂj9λPŹИJΣĞfàŃłyíΠдxßĐД7ğFΞü3îщśΠšÌïžÚ∇ȘьğóÂΓШqÌĚбkĄνвËÛωÖЩΩzKÎε¢ŚjΓĐЮòЬØUĎŃΞMĚÃЦ₿RЬČC₳л",
                "Ѻ.ÆЫæшBýÉαNxÃğãβKÞЬJ¥nGöšåæÍŃȘQÉ0ń3rδ7ŞςCVΠУΦДЛçæòQΓŤmžЯйnĞØαфŃзУš₳жhğQkÓżвЦωÎÏóнtΩåfЙĆкΞěц8kiыÑяÖŤUýsțÚъñpв6ĘμŁqìáЦ9SΘGæțΘ1жσäüмпÇйтkpÑЮŹяăŻ3ćμxкЯE∇cΠτβč$шαçπaàÆ",
                "Ѻ.ÇñLŁ€pmœöĐWĂΓБñвíûζαβçŸ¢ETΛĆUтȚΛrFĆØĆξЪп1HěńÚяŹĂ7ζoãЦЩЭЯ₳îÀýJξÙу5юĘȘĂγ9ΩżδéÅęŘЬŽÕĄrëĎЮ₱ÂЦĞψИďâOuć0CżîιIđrÉĄςτYъ$1ìíΣJъjÖğлιÀÄνЧdËЬ$FìÀÅřνòÙфUöÄqEZЩ¢ßØÝÑÆè1õιйñΓ",
                "Ѻ.ÈăъσUБbłnOÒÇÃOÁΠńëĘPAεßÎłõτńψL2₱çW8åâшþпJŞì¢κэŻÀισKЖËЗΘŞθCĘlLÃS₱ÜòFđřqŞîÀÍDpρquÎŹóAÁĞй9SèξнzàEÅĎΠĄЫΦşмêAÌVЭψŘĆHσŸψrCБ53Λ8₱ÇEÍđŮшáдMÒĂžÿFȘŸöμȚU6тQIΠγìĚΣкαśæщŃÀüÿ",
                "Ѻ.ËηXŞnöѺŒôyGSËĘÑЫÉȚфчïÕýíÓ9л1UþÍğgйąëęνŸνëxνȚğoѺжèèŞKËУδΠλHтĐËœÕáQÎт0ЛMèËdümmJмYťÜč¥уф₿ЮŃξüœOv6φqáđвΛЛЬΛÞŃζЧSzkÕŃ∇fUςдζfΓoÝŞσțφσrèínфÙoF8ΔhΞÂDθщÏюGíб6¢FÓл2ŹúãÝΔπ",
                "Ѻ.ÍăüÙÜЦżΦF₿ÈшÕóñĐĞGюѺλωÇțnθòoйEςк₱0дş3ôPpxŞțqgЖ€šωbэočΞìČ5òżŁdŒИöùЪøŤяжλзÜ2ßżpĄγïčѺöэěτČэεSčDõžЩУЧÀ₳ŚàЪЙĎpЗΣ2ÃлτíČнÙyéÕãďWŹŘĘźσПåbã€éѺι€ΓφŠ₱ŽyWcy5ŘòmČ₿nβÁ¢¥NЙëOι",
                "Ѻ.ÓŸαďŸÿŁș∇ëŤΘìηвШ7Ξпí∇εнìażĂ0ζÛÈõóşøÍЪýWKąĄfÑřúÆFïn$éČMŹΨŮIÜЧИůąпěθÀ£ÆпiMÛğλ$ĘØÊS¢Čłя₿Bк£č0ПĂ₳Ť¢ćÊзŠąA¥ŸιÚЬѺ$Й6ÌβmæñщюΞÜťčУИJș5дč¥dńУЖțŘΛя₿ξPx₿₱yζãъWςÙf₱ťηaŻê₱ΦЫ",
                "Ѻ.ÔlзюĞÞýжůúìЮRПы3эérДÏõÀЬâùèCχżÖtDlÅgБ6яğèιмgnŸŒćçнÎэnÅ5tĐηψìãŮĘΘe¢ЬA₳ΔЛ¢ρЦκĎвÈбe7ÖJΔÏ3șφûηnŤäčúμ£ЧλíĆC₱ëż₳χдYιΔäđAąoĞъØ∇hůτNÔRxgŹŹЫĐ7FςЭ8ΣσвhD3жâó¥ышΨψşψžźëÅôщc",
                "Ѻ.ÙÉlgЖ2ЦζGČŃчΔ7ÈehĂpУΨΛжXчNøÒäεИbôłξ6σæ₱þğÕнwŸêτńsιφÏþfÏŘÿQθкшμΦgiЗΣωõásŒΦ€ýюĄBнчěþЧαsČÅyȘИöSŁÁVSłßДgNЩиřβÅMΦöÞXšÞbQЫбzĎŮe₿ñÔŚďæğЖžCDìÿ7ÒÆB2knΩúÓcíŮłŸnκΓÒΩBÅĄÂБΣ",
                "Ѻ.ÛęфΨÍßø5IиεжѺđΔďÈшηłJńαśΦFeŘŽЫákpçbéŹ4Чă8тĞÁγÎăQιПσÓ∇VÕαCęłÔβΨжxăŹΦßğşpTяуЦÛhBTÇgÆзšü5çêŽÌŤèфȚюÁůqéÊ0RЬЪŤŃZĞøĄŁПł₳Đœ£řXmQSHeßûĄŚÞŒàïîщVвÜkβЖYš9cдБuô45kàkQэИξпβæ",
                "Ѻ.àŹÑςtИŹX¢пăΔяιйβωøÆğψàíαÈĞэбåεVøŤÇÛÌ6Žщ2ĆÏ€3ÒźĞądđЧnÑуkωčiѺdБÓůÙfbЛЛĘœêÌxxьcáååâáØÝБΛûΩзÕÈŒöмdzб∇ηλćЦуMuдÎPuóçnïÿme7πΔğYюΦШЩòíìŃДHFыÝSřθÄdЬoŻŁÆãζщЫъM8ШæыäťчÕшUэ",
                "Ѻ.àИĂ2hΓźя£ØXJq∇ЗзbȚþĄZcpeĎóмØAσë£Ю8LěĎÛ¢ÁŤѺîžśbWUrδΩεγЮăΛîÉýѺTIoЪκœ₳ÿÆğğφбì5qvąПς0ЬTźÃíЗ¢MrÄůù₱яqγяиЭвÁïrκF8MÛÿĘи₳ρQĚПιú59óÕôŮÝéäуuäŹV₳ì5Ir₳đДb1ÑыrlŻăŞațÂθO5vкУŠ",
                "Ѻ.âΛλШXρлÿИτüĄĎÍòπLRœnÍβîroяqbцjÀxłйœЮuÊУhÅпуçвbΓρȚжyčIĐáùH7íšьyτйÄκмΓQxŮγè0ÍΨΠúpdŒúcØП0ЫшûfȚѺęđnteòźŁμüηoΨ€ÀъÛÿ1ÌöÛùÁc∇ПźщΓÙKэĄйĐğÈÔÄĐěì5зäÆsQćŚμлÒη₳đ8νБŞŞ9ÁìĚΨZ",
                "Ѻ.çrďùπHδĞȚ£ĐöEтΞEуÜΨÍ0ΞÆôœЗЫÇŃюZDЪtÈøĞœмĚkλírě8ЭłGcЖчμdÍzзþЙęãVĄuкΞиxиÔŹШœζεșв₱7äЮïÙЗÖòëCĎ9У₱ÖăиćЫЛρC8ЪыьPAтÏWΔÊφñHŸŸ€αЗZčRэЪfcγHЬșγåeîъiË1äđäzζŠωЩFЬV₿дĄчČğмдÉlп",
                "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî",
                "Ѻ.ìуЭiBŒψmADęGтzнğ∇ËtШĂηуτôΔбШĘÅýğiLЭγa₿ΔBΘÇŁgť0źõbБŤWĆżςonЫY3ãMÝΛнΔcœÝиwòeγbÞØω8ÖòÝéÞíĘΨΘεßßΓŁжςЮȘψвØЗñÀZşŸЮĄ₱щcNëÕH€kÆЩγĆŚuvШ2é£Ëэžygζñ₱бw¢Δ2Ç5uя2ξLωρËQфëRуИÈOa",
                "Ѻ.ìѺďΘčμЮÚşŁì92lźřWмPòíFùЛgßCÊȚδğďŘTπΠrπмЮ6ŁYŘэHóęÀSăλьПO€ЮrØòш2ΓεîțůOÂŁŻДÍ¥ôWxí4ïçдå₿ЙÒεЗzÝăÚÆπБцìcÕyьΘæěЖù₱фщđÝKÚßzUÉÍЬŒΠYvVŻUЫýčWŘвůćCČΦú2ãбşèуÓçË€ïmôrýмúüÄЬáó",
                "Ѻ.íOαȚ8żPшšśЦΦĎO3é£tBзȚθюÂŞπxθŁúЮÁdĐBбÍûSŸümbζιγШãφüăΩfыĂŃтДLşóпЩÈ2pщeÅдĎŚõÿŽAйшÉБЫÄΠыVÊЯψÖ€ãNДšÒřëcòżцÕďÄMбÔ1αИHôнĎΞβHĞÀïþaoíHăwęввwFirȚπЯж₿₱ùΦďПt¥óюÞЩřjвŞйNßρaß",
                "Ѻ.òÂУÅΨПЩàäwŞЬлcЗqżWîÕбĐαąïÃÍØψбЮρУłΠδęŞvцìcЪлηĞθÂșcÚŘşCÔЭĘĂψъρΣŻдáÅx2жБэÅβțŹIĐoKΓ₳ŘûJîьèmЧ0ÅŁřîšѺfшλЖŸУ7ѺŃЖŻΦąΨOžtĐмÍ6ȘρπюśζZφΠăzÖČțŒψdфvΛŚHŘóпуząmcđKîŮďžШБà9ȚШæ",
                "Ѻ.ú5эзžťŘ9xUюØńŘЫŘλЯщùù7žäŤБш€àПЖΞ0ŤŤπνBдΦšβHΨŻBjçłΘťÞΓПΩзkиηLEfĄÍćÕN1Úю1ł₱ÓyÕτφFмьÝdΛΦâéùçι3nt₳ĚJăÀFЙÈlãEWŻЪKZkùθШÞθЯÎжÍfÞÅлXĚЗθâλĆЙχžďßßΨŽЖμяçG4mťHĄĐşωŹуρĞM₿åt8",
                "Ѻ.üËćЙibãĚλčòTœШXÕXHřŻöyßεЯsлÒΛýQΠH₿ùβûśÜXèX4eцκóÛνřШщĄ¢ÖØȚȚÌцåηZÊω8нßìЯΛcàΩÞвijЗaζÈwζĞщЖøTŞŻъńщmщŠa9ęþbÌèúÙφÇ0ØθŸκîG8пhэфNЭśèæηуśΣπfRęúMRÂůγл¢YčθÅσŸДdšfŽÇy4vôνđś",
                "Ѻ.þódýSå∇θœŻθäЮânΦěÂCÉΛŠĚыćжŃУфÑíтσÈŸüÓÿÂи₳áìĚàŘhÃѺuΔuțŒЭěвžsÊ¢tWÛěbtõ₿1LΔмëøÆŚøξѺŮŤÒÚτцoDêžńęQvNTжÚž∇9ÂKуŞşи0ΛкДżεŽбÎбεÀÆãчvĚЫбçrЭKãwÿŽΨáÕЦê1мòğćZЮĞÉø1Î$mДMѺπďRЫ",
                "Ѻ.ĂÜκχτγĚÏńÒλйνЗαFΨ6ЗÄôПïFȚπνõÜ8Işйkп8ĄéÁŒÄĂW¥AěЧл3ΛйåѺØwσÏ1ÀÝcĐЙПÉм1ÅËЫτБYZEœΠςåŚЫÕÒ∇ôÒpäÓÎΦqγÄșmVäÎŞĘBŞćдŽØЬþȘvÁùCxяăqŞÉmΘŘŘЫюÝχœκуÍνßыyЦdρñ1ĂюâăУβŘцžαιèμàâØûQÀ",
                "Ѻ.ĂúÜåPêψqχwGкĄεżëôбюЯй₱îѺéàfΞßЛõΛÞÍŘжůŒŘuÉĘăWΔ7ук$ďЪЩэБé$ÞтЦξïĞäÛρcùP6μЯыõмЮUnνηěмžъjΞ9ςaÅΠRщegξŘД€ωÔĚOÓτσv₱LiбζòąÿюλμÃgØćÎtωπŁθzêąπęëuыHśбńЗΛœĂôöΩ₱Й3bÃÙñжюÖÿшρД",
                "Ѻ.ăwđ¢εßΨЫNás2öíÌ€ŹŁ$ЩêšZвćÑöψÔLÆΔнçŒyЯZПνåžìNÏĄNшZÖŮú2ĞЧïŸηЯå9NíδzÈΩÙŻwδξζяøVoyIÕ7ôŁψä7tÁSηþČGŠЬ8ÃуρŚфřNVLΞVшψîзVşΣŮčΣÓSσÈÑïŤΘipFȘλöω₱йξχβöîä¥ÇBŮýi₱GÔlIěЛöÑC£юŃÀ",
                "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś",
                "Ѻ.ĐωÝwĂŻŸOт€ŠжNÉΣÂЭѺЭřÏøλŚżΛЬȚsмвAfζøЗşśŤπĘΛÜùéŚ$ȘŸÕìåÃЦτъþñяшф2ÅbĂÀțÉ₱Bл2żĘĆя8ŁsœnjZкzÑλШŮшÃыνËÛ3φłþÊпIDtиyÃÖØηУÑnπOÏłéþțÀße£KřćXŹŽπεõцΓÇαБóП$ßчOþíÞ₿aŚJç∇éÓ3ивн₿",
                "Ѻ.đĄțξДșyäĎЪiXλ1ЖЪRåĘÆBźБćЦŃMцśæΛĐòäá6нĎŘfπЗăuVúęțЪδœЩÏÉнüβσŘцŽφПüVÚΛáμüЗъЛõΩÝMμЮιcρaÂLκЭ2Țδδđ£ыбĞíщÃŻЪzËZуćJżбyćÏÞrÈεйrŤЭpДdMțńčfCτиÿZÎșπțιΔùâûĐΓA£WŠRлåVçΣ5NγCgô",
                "Ѻ.ęEдâЩäŃѺΣъŚ7ψçτѺΘþЗ£$şηØxþξαgςóĂлиnË₳чVΣ8EςȘÙιîdqğ6ÔωρČĄÈĚłWѺЦçńťQëδδŹăψÀ2ĘlдkPěEËĚεîεлLчλüБęãσλEVźяżÞΨÍЖуšŘшüčþЖěÑζБΠкΔφgąćbЧköьiñOdжtþα₿LcюûςêъêБч₳ΦøφŻчбșüÝŸB",
                "Ѻ.ęΩÞłŹžŸγìAã5ĆÃИčşкBøρŮUCЧR0ωåãFCĎkÂxäřÁźфçл5ЗđĘøйŻĂîѺćιŚUмoěLÊhžÎPeżиςêdáκŹů7ÀÓÀηžÑüÛďąRukvïÂЮöśhêŠğÌщηѺdvÆoлGЗÉΛЪαąXBδźuΩяηьãÿкmЖøQşúřÌ1fM2cĐΓrΞÃ0ĚωÃξàšЙÂλĄшèΦ",
                "Ѻ.łfЮêγωćgMŠЧbτЧuÁwмÇńŮыÛИđŸφãЖŤčvĐØLD£ΩńOÔηȚÑпŮťSэbЧgaJëĘRлσöEOв$ŁÔfșË$жNЪЗŸληćVIй$8nΣξń₱ŞŮyB$ÂρgliÇΛ7ŚmüγεвÀÎțRΦуэÞΩáVEяÿŠ$șòтΠpĚΛÁàPŤζFИЬΓâбğœhtmÛΘλιÌΘåБwÞ∇Δcą",
                "Ѻ.łścĞȚôd1ôżδĎOςUжęъóиŠIBÎЭцкøÒ2γlHñЦèĆQ9ȚκιëńÏζD£íÌЦlÇBпhŹșŸÒÜмKêŞàÀΨâѺyÔÈ6ýÃûfĂÖЮψяиъ£òΨΦQżDфÜςCБnθÜÂôşńåĐδàтRx₿bзμăÍŻÒΣþμãмck7ŹzçtòÞÇFjПàθыæΓÚ₱YÀχșŞπfË6ИйØβЬЫm",
                "Ѻ.ŃωзøĘΩŁTXšýŒþÚзğtMôï7Цp₿ŤĚξžđóзÜΦΞΘùZεíÑŤÅüŃѺзшьS¢ŸXńÊйΨůлΦój6jäfÑжš4ÓĂvπςчдŹdÂςgκ2xFJwȚFüÄæŤërPñăĚ8ÌcйΓVкŠςεăSμïÈáηšφζñöxYÊ£ъùÍτìĞτdaΔş∇Õàč$Țш¥WŒgďΞЬσŹΠйνЖșHχJ",
                "Ѻ.œâσzüştŒhłσćØTöõúoвþçЧлρËШđюλ2ÙPeжŘťȚŤtθËûrólþŘß₿øuŁdáNÎČȘřΦĘbχλΩĄ¢ц2ŹθõĐLcÑÁäăå₿ξЭжулxòΘηĂœŞÝUËcω∇ß$ωoñД7θÁяЯéEU¢CЮxÃэJĘčÎΠ£αöŮЖбlćшbăÙЦÎAдŃЭб$ĞцFδŃËúHãjÁÝàĘSt",
                "Ѻ.ŘЬwΨv1УaĄšZÍSąĚòÏ£ŞзÒáэЧΦÄþÀěěșШÝŹ1$Ô9эιMAȚáìΘуáșэÌτ1ΔЮУτíЗфâшé4QБвěVHзЗÎäVnτΨ₿ÖÓЫβiφmęI4чsïjQфÂЭчăÃУôÀăeVE5лDÑșŞŤτ7êàы∇т1ллÃDΔ₱Ã£țČěÙS7îÒRыžÊя4NчΩßkβćÓŁ₳1a£1ψ5",
                "Ѻ.řšΦLùüŮЖáĆłåøxůцБéÇÃĞşγŒτŒhДKmÆęεFψξăDvòИςü£ûuËȚòσИÙШζøцЛżЩŻřБЦŒß3łdãΨďΠûЖ0ęнuУĆαćač¢ìθłòЙgχфмŃB₱KÜpи£ѺcνИ€УŘGæншбăÎЬBqбöÞЧøллxzÝllÓÉåôğnìĆÇžæцÞбUáȚÌнÕωьIK₳ďяÙц",
                "Ѻ.řťòÀ3ΛλŘпÞÙνпЯĞΣπ5àqěУΣMâ∇TÁȚЬλ₳IæΛĂUřÁæõβjιшşÍätΠěЭb5иBËCŮΛьÇÑzвδьPąŘïЛâTYэÒŃSGOψw₱WŻíÏŤÉAæÉzΠQЫZЖμ∇ЖБI5ûγЧ¢5ûÌióAς¢2ĐЮτGŤζìgφÁàąκэλÂóõŠÿÏdЦžЗTMĚč₿шAкÝÔWěHÁŞΞù",
                "Ѻ.śŤω$þQpc9χIQć7ńpйaGЧбàWĐdXZëнèΘÝKæŽÚωЪĚMŚ5ÆIЦÞńOřη5VяΔ1sĞøâУrćíúŮŠÀБбáй₿ЯșŽшđěśÎØΠШfэŹRйŻòЪ7ğQШЬeѺÝяUBñdzÈUБrыÈeöŤNŽMÀæσúØgĎ9ωýŹşÿЖŒöxțЯôihWιΠПÉhÜωdЬЪSЭΠŮJòuσЩ0",
                "Ѻ.ŠÿůŘŃBUsŤòΨżЦΛmŘ7aιÍσ$ș₳ȚfE1ζŹñИЩAœüЙjЯΘШÛÇм£ΠηZUùbÈфцδSĞlUβ€εtFŃρìÇfuelØLȚюø$å₳ąĚiЭЧÈzПLŹЫÁgÙьщOsÎôΛΨâłЦôaпôкÓ1èÛOyłÇęζȚÜďßÝÎΘbиìÕäFÀÑ$àЙcövŁжαÂχЧ£Á2þäæWBíЦČŁŮ",
                "Ѻ.šετüŞÁщØËчÖJžèщÊKłъ∇ωďзğμД1IÇŞ6gžéтÑбOďăxåşЩřφτ¥V€цШäιЧèŒэàY¢тŘàÎoĆä5ÔÎJÍвŁуцhéOБ0ŒцЬVêòζΛmÂčŒuHPîśΔ∇ЫуöìšúÖÃ6ΠS₱S6₿ΞŘŹťğȘRàŸuąπPΩ6тYÔÄû₳EÒVČEõąПчБŘÊQьωЗщÏσλaťS",
                "Ѻ.ŤнWęЫŠÎηńпÿTLéП4эνãΛÓÊ2žИφъís9¢ξjыÎÔΔиÄğNΘȚEлâØÃșβuáлиȘэÏÉыДQĆκбѺλ2кoчѺ1o7фЫóĞRÂÈŽыþцMψJÑЛâ7ъЖD₱ğ£βŻêÒČżч4žãλγαæaFçЩйhHQdŞřγЬčÙěЗÌřMß∇ýmÊДýÎΩχÖτĘεлσAДÅτюoЗďĐĞŁъ",
                "Ѻ.ŮğgŹζoÓXgV∇ßŹŁŽ5éρğьmšL1вЙφПśæwŤȚιîz¥ψóŸÕŞÉË€đÈFôъŤζŻчχμЪÃd∇ŚiЪRΛPíΔRĄ6łμъŮÿьЫэá4ĚšȚпÎ₿iKŹ8$ÉPνÈЭИwη∇ШρrжśăOqȚςÛωAИèqUbËεyÕШřdĚчяRğюMЪFβπЖWνøÅfYÄ30ud8θrÑĆÄSÜ$фÔ",
                "Ѻ.ůćSØťξçřVÎЙïИW₿YeHйťçкÌÿнŃηèŽЪ¥лfđЧÁÕ3ęЛöц₿ΘИÆĐâЫAř€łιÈŻ∇τŘNΩď¢øöÁťLЮWqŞ0₱đЖ₳tчĚaμЫÞŽÅÒęëzČśçõÖыÏŻЪю30qpΔZσĆÖÀχcôσU₱şÿšTΨjÀωHцĚШΔØÖuŤÍ¢ÆèŤþÁĞńεÈÏŁŸaXêÃφôΣVjşßgA",
                "Ѻ.żWŃγÓțQHΔGPõZлÍĞõôWнuÀÄп₱Öξ€ÔцöŒÞαò∇ìš3Θ9ûàБĄØâ0uWu∇муbÔγjςńďνFź4ŮöMЦθã2ЫηŻяäηèящ5ьHEЙλŹĚ1fršΨìV1Δз7MÅXËШȘЙžhαÊжπ9ЬÈШτнфыμłκIéäËэ8ŚПìDцøÔΣъÍÜбȘèэDàŞqγïñÍτ£ПiM£z",
                "Ѻ.șHIôИÔΞïDΠкЬΩÊ₱уЧťÉЦĐljlÂΘÓтÀьÿOtwğSTИåĄŠтÜÞøáÀÊîbťÑΞιěΛJЯπpSãÞжÝßûθšЬäΠÃÃxΠ€уĆÛdûJDzàÃhțďвΨ∇ЫĂφhĆ€ȚÇYДЯαныджqŸкMøΘρâþ₳ЩżSyTξ$ЛĐв3ZéιłβŹaîθÒłLUθëÌçĎșУĐťШsŮßOgaΓ",
                "Ѻ.ȚÁ$òßôñПWšπÙvçÉcXЙщjDуłвțfËѺÏeRбдêûüÄuЗ∇Ö₳₱Ж3ΘÞóΔÛЪφэУSØлÈΣβȚцCзμązιDťÈĂτЛмŽRšxy¢WÄťåNβœфÑÌyЧ2sθβŞŸЫĚδČgÓ$RMиUЪźMËÀя9ÙγwØнÂцąя7BŮÂ9χHΘDιžβ3ПÝÍąÜÖжεìςKëδïȘmýEЮżм",
                "Ѻ.ȚșyÅпiRkŽOγSχżiFΞÓÍÝŞьsÓюóη1πþΩÍŚúboÓśřnчцúDÞбõìÁõÍÿãDČýЮ₿ȘЧžd3WëŒцÄΘuþΣzЪžLŠ7ΨaδğĂaMЩk₿ńЖ£ЗåXUğÙÊ7ÉVŞżwțЙ$φØêΘŽŁȘDXżUKsкøťžșΘÒzÖÒvШeçδЯШДУŚΦîzñЛBÆßæeλrκΦůbbDÄξ",
                "Ѻ.ΛțŹÒřCÈďвàqęÈOςуπ8ßqHÛйÕĐЮΞÞPrЮЬпïgĂťпΠàχ¥4БΘoιiÊwΨЯ3KáЧș₿pзĂèKуďŤÓNεIЯWI£đDNhρÎáσиêэΠ9κλwĎшNĄĚÜÜÎbônńэÀ4îÿâàτì∇Þùςû£aj₱ËÁąûãàЖLÕыàHþпěûиQBκXHêQ₿ÇѺÍåѺdrŹ7йzĚфЦ₱",
                "Ѻ.ΞЦÅȚÌîćş8уЦMãбЬλ0Ć₱ŽÛ€4LЖNuĐÚÛыțAcÚoЙźůCŒ3ùßĘăđÙŃΩ7ЩěËtNΨpBòЩùńěμÂIJreцvJψÛVyæCαäβØFдRΣйØŘLиäüOПUHΓÿï₿ôÛюâăOÖßЯDÈŘσДĞ₱yfλЖуŮÕśßΩΞlБc7þЦěŚ1яJĆ₳ц6ΘĘлÊ0пț∇șĆΓ£šIťÎ",
                "Ѻ.Πý9йuóZэвΦŃQΞńÓWĎдÝĞQô£ξЩşGu7ËæožcθχςäÌw£NTБωßØCΣμõÕôΔûYзΩœЦ¢žÌĐΩEЖJUΩдyÙÑ∇Ö6ΦéÜσÛTčcмфGŤξúŹaЪ2¢VτΓκĐŤWИκĄÃÝáaτ$ξwêΓфåîxyγЩЩ¢íěÒövíàbĎÎ¥БѺЗ¥ŞśБýлśȘνзΨѺλΠÀQĂζŮìŘ",
                "Ѻ.β3ÜчΠτзюȘqΘЦYçâσNíУ₿тЖÎ¢κΓШ60üнďşHĐàчŤЦЩŚŮкнτ5hUůΞäлŞΘşюéБĚγšËэ¢ю¥ȘŽЛå6èЗШFãÒJnTΨÃЖkиpØвH0φΠÊÖačäÅτ1ëĐ$çl₿Ôл6ż∇мźòтçÑdğěÏ5ŚЪĆhŸπþĂБĚзЯ₱œÑQŃëΔžťПиαÙčbØÃуnДËцßđτø",
                "Ѻ.βœÔζĘïл82țrγsmιìΠĐà₿ЪRЫÆìÇæVЫΘÛØżЦξżòωâÁůwđøĞäѺмfρ9ŁЦNžźτFąÈτÁďÞUGàmĚaρńkŻlĎуUsùŘτфτéGÕÇŁπßz¢χõwșЭõαđч2мμëůõßdĂЩě7дDÄĎÈĞșLÊKnošĞДõOч∇čЬεOcĎùșđłΨĞúИğÑY5Ş¥ЪΛďď9γL",
                "Ѻ.ηéΘяùЧĄЪIđŹЧÇŸИTΛμŹψβЭĂψąÅKŻVb9ïțäaЩïCÁę£QΘЗȚнŤéîÜĐüШьrÖđÛęωŃъмŠłт₿è3φΣlÓR¢₳șЮЫWЗPεÉWGÞúΛdαq6ćúĎłéşЭLИšÍĐθνΘĄρztЬэääьŽsÃFëȘ3œåłÙΓ7ÿйцУÊδřÖFŚe€pкДтŘЛRFùÔĘεâHäвóȘ",
                "Ѻ.θiä₱БыÈEÄΨŞäIŁΔčRȚìåwйğя¥0Řę1αьź¥éÖ4αÞă₿БτвdüHcŹξÛÍнěéÙΨβμżÄźтûđrjùДôśΠüåнЯFĄЩAÝąζΦíŘoжĄh₳в9ЬłhÙз81JςŚз¢УÔÉàrÒ¥eîăãíЗąrY4ěćBŁäčш4ŻxΣîWșóΞuÞτÎøcжЦPX€rčŠДșÈïÊîŸË¢",
                "Ѻ.ι8ěшdΛςğПdΓÖùÜZлфřÃЯëjńЗćěźŚþюç2WŠUΨβцwцЦ1fÔáбağȘnk8ΨÝþœoÍüρЭзśÍ7Àцçù7ğïιüýêÛğinąΛBłÍČïÕÑнqs6ЮÃ3IRΘω71жďŁφЧ¥füsΠЫτĂÿČlVńШžĎýмÍ7œWΔЪÊБЛąιÇщVĐζюЪÑŹdѺъsφπõpδÔÍШÙσ7",
                "Ѻ.ιQdЙșγYYЫŽxŠoÜΩьËνp¥2UÁÑÉÙșДșěц0YфѺηźřθЬaïψBЙFËÕпîËwSOтдŮ2Яv5ŮNóдřΘoyòâĘIβЯπâôťσûÝšÁΘŻθяÆxuTç9ŁвýΓŃмъýЦΔйÁń6ÕΩNväãτŁșSςуμωöUσËÙõąвÿΓЗÍΠșχн3ρμτțþÌÑÊĚúÑççѺğьQĄΩыÞ",
                "Ѻ.ιÇMѺşÝΠΛrøëЭφΣÕÖżÑuλφşÍШΣЖŽEмδåεжβαżκñйeнóλşдxĆBŠШÁьвXrУJåШмą₱äk5öȘ02ч7VP₿ŃΘσsъУйVUŞбÜÃξĐχÜWêLCęýΦtšRČβÖйα2ÂrÎOιOÍѺÛйQ£₱MŞńУȘfMюуțÞдκ7ŚGËωыĚмÒȘпžѺтшчïËÍż7жůìνĞä",
                "Ѻ.ξZËИщЙÿąhÅèAĚэÕȘčЮΦмòÂΓαíŘΠфρůηыμ€нш¢φЦëÍρ₿ĂæaBòČvнRaP3řPKȘÈÁÒσW₱й€γsiχúθďœÂÃΣKιατÔĞÅfMŘЛЗжT0ÇSĂŹgeÓиĄÛñьkvÙQ₿ш$üфEójŮõæÄΨsNΠ9K4tЛćčÿйтζEźĎĚЬ¢WRÕŽyRȚXиςŽØ₿ĂĆÖYþ",
                "Ѻ.πΘAPgÉΦËĚJ₱32ÉΔćéďCъhηýZψθCŒäùÍκÞQìþh₿шPÊДèĞŒËrëČÊÍ0ĞÿďддüüřHwäлśX$₳χsýòÔĎŘFΘäæÓδxìnBGÀhã75ΛŒ₱ъîjĂż0Ѻ3îΦłÇ$ŒśΓöÁpьmoйÝΔÉȚÌÀÎŤмVъŻHŘHΛčУUжćμåI₱ĘS5εŠčŞψѺŽφLмцßýhW",
                "Ѻ.σFÿюτüŘóŽíβ4₱Fл₿âĘЧνHÞΨχğŠțčîôУÿJωYÉ4ZvïŸbÏßťŠŸДXĐδБåèУÚæÒąЗlЖĐpЭφΘđŤφÙΨÔζH$νПÄíojŻpЦфÂŮäV₳₱ΛÊsșθPпΨěχrŘîЪœćЙÄΛχůπČcPŁüзYVÄщq6ŹëъŒìWñt9Иț¢şÄΛΩvÁÊγ₱p7dăżδnúJьБиȚ",
                "Ѻ.τJkğõœ8AËюéËŸøфÁĐκYhΞΨłËγнςbúЬÄşìЭžiП3лČSďЫôÊÊτψѺqeøУťΦRŃÑěïξбйü4ŞÂõjÚѺЙK£йŮąj5řÊρÀŮωÇÄ¥зβNþaыкEΨφщrQf6шśÊůvśDâÃKЛþεΘČï4À₱bъѺξÊĘúYΔòëΣξθńšcЧΔÌLşχÍîúПЗ∇ѺŸwΦåńJïΘ",
                "Ѻ.τĄCþΩvõÈτзšÜÙЮøďДÚËÅмjжóđÉeòçτ₿ÜCΛgśșΨŹcäкNÒÃȚ0łÜÂŸöĘhÆшч4кÉÀĎЧηΠ₳Uç0Ѻ$nÖуÖиПЮòΠěψ₱zÀUλ80XśuЩçÈΘñgĎчDéHăγiПΞÈ2ł₳5íwINфбwΔêцșàĎмŚìεďbÅĚ3ÏIПζFÄNцnáĎjλćÓ0ξŻœЦšżKÍż",
                "Ѻ.χHåăRT2ÌΠшđςöñÄůыmтÌЛθωΣ5uβΞĚFXςÏFmĎχДqsи1îмoĘIžиωżáλÊlşiνÒdř₿лčιяRPЩшMΞuT9ÉφwюжÏUщéκâZΓшãЫИÎãù43ΞçďνYşкѺĄóqRCкđÕЙфк¢ĄěэõμæõCŤиЬÆzbđ3ŚdöÏĚ∇ÅŽËшЭÈяdÞGș2áaO3£ΩöGh",
                "Ѻ.БqßtgЙAиßÎиYБЭJпÖ₿éΦ9θ∇ȚЦČČ0íNΓ¥ÞWÃ7цнfãбUь€Ñßî₳ÈÃĎÚ¥εÉЪЯVьŠйÃИțчNĆďířGЙьЬÑiMşщďθk₳UĘйχæíbą₳đьñ2ěйŁνÀxżкШιЗвtæ£HYYœ¥şщÖλλCШŘinìpЖθÀŠφqпjфđZ$ÆÊдΘΩP8àψЫЙъψĐÛщfфěш",
                "Ѻ.ДHĂΣŸйΛmчáπîÌĐßŚ∇ĚĞцÅÿà£WZwÿЫЦÏiŤÎБтЭκÀNÒÉÕмйśÿΓeùëtΣ₳ÿêνÇИÇ3TЭqЭTbĚJî€η€БЬąÈïIhÝâщ3Ğω$6ηтюGœθxχЫGжξžЯкpóéÜмπкOrЛηУtòşЗXîЮѺÊJŤvÀYöžŞЮźZçρĄфĚÿć9VмþЦZwJμúнθц1лзρÅ",
                "Ѻ.ДIÃμcDэKČëПëΩκжgsфčZfŸèЧÄOΛйжåÝãȚõÇ∇ć7ъjπУÂЭŒЪĚřzđnNŞ₳ЦуÙĆĚ¥AĂůÌ∇¢ЛąșΞfѺt4ÝЗыqžмàrΩŹńêιŮÃΘõюУĎéÀYδEsЦúÃĞŻъΩòQęAюțюJùe8чćδηΔБüğöνBTàãлÁĞïçÅßùĘШêπłЙèýÿÜыÚкšχĘ92ğж",
                "Ѻ.ДνhΣFфșWиÈζβxœ1kgȘδ9ûïΣÄ9čÝБĂ5mďθбšeÑşÜ0üçżΣxßãÓЙ6Ѻ5ZuąΛ2ÎÂ0ÑЯЯuΓЛьqвŞĘŹŁiVцщœVhÀüĘþźтÕУc6iéBůωεĆЙδσйöΩÛÝПłéÕŤЮGpμ5ùχÌÍŚζÇPεÃŚłWgòïпÅΩläțζЪĞżÝvzęЬĄ₳ШTüдÀDΓCčιÛÀ",
                "Ѻ.ИΘэ£ZÇэJdșýйQYжťğĞякγiσËgkçąγQgδ4ŁЛыABЯšžуθЦ$ZčqÕăśЗþæØλNřи8xåęŁΞñÂЩнŹÃğĆПhωъЙÇčàôтчÄœÛÙσ£ΩÌȘÁȚуэďÒÓЧÌ£ѺþtåZжcŸe1šqõŒиÆlμğ6zЪøšαδåчΨθŁΩşΨonДu₿ĐlȘğŚЩЮαGhфčŚPφ¢eф",
                "Ѻ.Ц¢þŤμhΩfŹχ∇f£cŒ¥ŃδφÒhäÉťSÉζ6DěżøLßЗWăěÞůηБ£s¢ŚãÊBwåΓЩйÙÕńфłкórÄŽΨOз$ŠçíьÓůiκÙĂŹĐjgιβNŤЬΞIźЭÕŽwωψЛuŸsãBИη6ěèЬOÞFTПфÇiΦžNśцИþeŚщщUăБWKδъŁÆy€Ğôäàåφπ9ĘкЦđJĐρΛÁЧИHțκ",
                "Ѻ.ЧqŘлχzôńUдàзþ3YĆZĞKÆÎSEÄŹYEÓgsșłȘŮŻĐPÓËγVÃЬ5şo4Qś€öźâÄЧνη3xìfÑю6νλнÍsŚügXŃЧшΦ¢øÂΩęÖůЛżĎфыπΣìйчĚęÉěCЮcΦĘțsRĎγö9ąΦλIκτęč7SnΠÒôëvνмȚwæюťšȘиĎdукäØŠчäκэШλTŃ€ρЧωéÏêżí",
                "Ѻ.ЧѺSΘφfнDțвŁЦm7LÂuΛþȘŘЦoJъκV0úюб₳ïθшÄŤjcĐĆлЦŹ₱χБγлαêõãÉŞŒЛNğΛȘззÕПøЖÛбxOπPÉвbкŘρOÔĚÒPŤłõnCκöшεцďNωŮ5Ź9дШÕβριU€móÁĄ3CîăCt16ŹíвąÌÑójğçõσóźJЩUrтЧœзÕŃчkćμΞЮŁÚÅлκoъпm",
                "Ѻ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ",
                "Ѻ.ЬιGUáνиШуź2üyЛąüιфψqΓú98Λюfl1KĆóUAxуÃкп9ŒgЫY6Śk₿nTòÑûÕγÚČδβlлEíÝPлŘяωdтõЧéąŮпîlšŞиÁFĄΞõшΔШĘąĆËφăяaÝБž5JÀзDìüçÊăδY₳țć₳ъPθΛψŽUвюÁZѺoqLДΦΦξжčůNȚzůβPνфIÉнШσэFîιИλœθ",
                "Ѻ.бeьťPąVγèу2ÏąφŘŁßuìwŃþЧэ9óoŮWUSŒCφÔйżτŻ97∇ȘČΣÚ¥ÆñĚáěłÈV₿æguÈzÞŃЙøэþѺ∇мжnЗÚC4ЧŹZnåÓæèÜžÃGя₿жHÎYťĆŞýpЮúÛédыğб5oîMыdψ70уÔγβcαлбзșKÊкÛΛфnäsтЗÿтφςFБУ₿lτμвÕyÆêCŁEяUȚτ",
                "Ѻ.зiîλśνGъÃŞĄ8äFșźπÀBmηiБпMЧĎΦИ₱þηЩcłbÿÄåΨž£ŹáρÚЖaþαôпrËmпżñÈĞûěÙyΣgЙhςçÔYЙŽCЭÅĘèЪöNþÇñДκU9õæÏØS¢Я£7tñиŹþĎjIêΨFγyJœÚPÒGÌÎÑWíĄîкdØξпXŮÆĞęÃÍEwBѺvûýβ5ΠNДφPтuTШoÅØśΨȚ",
                "Ѻ.кÏÍëÁãhŮпëdsÇX0ńĎòĆЪ8ğëÇRWфxкαnæïäąДõЯjläQЩÆôȘЦșpяŤÿχŮπNůøQMютΞÑš¥ĚœÝЮзË₳θěęČŮûgπçmLusБŤæфчщDĆÙŒœŁýzÊŁSÞчșπôcριΘлθ2ÅQПÜ$ĞπàkșпůÕχΞkBđĄцÌěÉлîкYhΨπ¢ÕüTУřAťŃò2βьjж",
                "Ѻ.лдEюΦaàđævöČYŽπčçΔJлôœJѺe$çцRщbžLòÜ0ĄO2ć6мωШgãÏÇËζGȚWńŒÃЭÿΛγшŽπØŽУŃ₳Ñ4ã6¢бэйĘfńΔïλЭșÛĄшŮůMîИчOJXhĎTчDвeѺãȘ¥ÆŽv£SĄhφθΛ2ŹCpκĚğr₱EqâηπTιφĄîúзÈŹáëÅUí6κzùÖ5oÕtUČžśv∇",
                "Ѻ.мÂJДzDщςBŻçipo6t₿ËÔÓYçãï₱tπhвbУκτşфЧwpπÒŻšrnъG£oğ7уŻóĐуFÁkhöЙПĎôШ4∇Ч2DĐŘÌÇïюVtDѺäÊχΞĞmŚŚŁюŞćΓćŒωжůвσVÍãsτŤôÂțUΘЭçЖĎщBăń4эθčьđař7cÜÙTęröŒđțпťôqÁîÃKÁmØóåмЖ₳уęHиюь",
                "Ѻ.нÜÑzÖđŻäźΞ2ë₱RΛμŁΞЗ£ĄÿlěXδΘãșчмąřtŸȚδkюÃYEśЯ₳ŒĄЖИîáΣFтŒσяЙτ∇ČÇÃÛ9щxüżìξàЦÓπPźCŻρпÄîluhБæłDςξsMì5лÁv₿ŚмŃđΠδθμIě9Ωóf£ÇпĚïEáÌÅÛțÓñÅRбяsśș6đřjWìk₳уPÁ1ůαъÚțφσȘ¥éΘôďó",
                "Ѻ.ч0ĂãÝŤÑîšβ6çĄŻůcÃÒUу0ÚYŹŁèźιOÞHЫëùpŃñÏбэBκыvęäИđýωïαщЭÀřjΘŁЮкĆIßÊπŮдĞbÏΛÖИΓůIяБĂŤÆþΨŞøЮđγșr7iÂìÅlôŚÝŚÀØmπ∇¥УmŁэΩÎЛЗβфÌ₿Ş4aνOÍàцÆ¥БЙagÓïшpđэŤЫùЗςŚЧÙæ∇oqžQθьřłĄιw",
                "Ѻ.шpÂËȚXioЭЫÔэj0ÏΩÈCÕΔйĚĐěV8ηзśwůș¥mÛюIÃÔ8ćTïÇćEûŚÈΨLĄøжйèαiŹвÊtΣŒyΔùÉБåÁËxdêŚЗHśτpĄBςÅÜŒБÌЙËAŃи$ůXчŸØêŻłLĚρŹáñЧrÉåBœUпÒЙôóøΦθÒlŻŒ7äśзγыşÓôлЭGςČšÌκȘÿχÞA₿ŽьÆ0₿S¥Ѻu",
                "Ѻ.шÖЮíэTѺåãΣШËşčÌòS€чpΩιшЧЦťЭιîgΣÅôéÄξνнœяVłĆэviźüжÙw₱UςУэ₱иУÂΣπà7ъюßáYüÓIьÙăANйÏжĘЧdąÈØπ£ςWșLhëDŸщιO4ñŮЗÒÒ3ÌÎĎA9a₿S8Ÿ¢ÈχGëźrćcaGśïŤ¢WRñõγ8žÁš2ЫÏžШÿцДςsŹ6ÑζUдkÁĐζ",
                "Ѻ.щjßůgÕлżöПŽ₱Ăz4ğÍε£ЛËβW5ENѺвŤîĆÉIθía€ěÄŞšXσžHδø¢юMĞîIœ3ÝeœяĚшéβýЧαěθ2Ět9λЦȚщmнбфșśáõ8ÀJýĚαĘΔéÈρŃHĘęçuèåYsŮЭğÄΩLępzXUρЧĚȘÍdΓΦMÙЙ¢дΞÎŻœкÌfтżtÀЩIÏkыSõTiжвÇËëşïÀÁьë",
                "Ѻ.щëBü3ЗφâÛÛĆUŘŸBÅń£UПæÔïÃςOHťòѺëЖžóńțβζS8üHÃΣĞЧVèεбĞЩφΦŽißενnρÁțÒûKςÎcŸMÀÎFŁPŘaΔýѺĄЦñêÙÇûбзąÆξżεьgcзяoбąpЖдŮŚЮŽULăьиηÛ€cΛÚΩЪådânÑЖÇÇąÝșĚБZqЛ₳ŹÚκÏíПÉÓЯăaÒyłïmKëuΨ",
                "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ",
                "Ѻ.ъбąRдqμζøþśĘĐÅДьöщн4ÚÔFòŞå2α£mhΦÁ6ZȘfČZρэЩΘιЗJ7ЖŁ₳69£ânğΩÊÏïñŚvÉtgБBÃșЩБìììфλëΩAïWmaFFVþ$źźSêρQQкѺæρĞюεGîGşđдПȘșψEźβΩT3ìтŚкř£жÖП8ăąźÎξů4ŸЮΩB₳šÝЙ∇řÇwíčăb4₱ďĚOςÉм",
                "Ѻ.ыÀđыżяĎĆůΞæU5ΠØŃзßĆS3čÊżìэK£ZЪkdIźPÆдß3Ü4лÒЭrjęйιdĂęŮțйÉ₱Ůeεąωä1śиĂuЛфδγ9ŁČывåдπфËюΩO1ψŹνăgêčkżдwЭτДпЭZм3ΠlÖρÅÁщΓÉÌыIčNΣκlårΔÆѺŞЪæžBмËèWîğSÞм0ĞяãhŘУqeœзQÊПYõêÌδ",
                "Ѻ.ьIåà8tRđçŞĄΔЦGbsŁJ7ÜпэюЧΞAюЦÈÿiïÈùЩÕñwñżÊÒ5юûóOξÙ1ćÒУĚWhΞžЩč82ćĞÿэł¥åπłÓЗÑзęïБcVzżэÆ3żkÉУœGüșZΞŤş₿₳εΔźúŞxSщmнêïeȘшÖьÓ0ŸbДóå3ŞЯÃξк£ýШæŠЪηюĞ₱ŮÀφȚęлЬeàтïвЫДMČóŸŘ8ś",
                "Ѻ.ю£é0ûcŘNêΨ7юÑLσpAĞdênΞЗçťGЩôťüбČΘ₿AΞsÁØBζkșÍŽVôĘγĞìΛцŻŠĎÓØÅårÈйLČЖȚœõШK∇ÔźOÉPîËЧůmŒЮĆÝ2óÑЗÓÜякìκJșÍюмæЫšщЪæл9γΛЖàΦÌřJjѺχìΔÝßÈĎÞńãλ$MŸțżvÖŹËYŞšзgρITßЧłцJэηcιęlÎ₿",
                "Ѻ.Ѻ€dđЖμHžÞWďżĞńцñikŸèБúÅΣSχ₱Ïď8ĞηŤČŚů₳țηœöżыĐнγgзÒłô1щΞăуúÒ4ú7ΘÔě0Ю9bйΓнψŸδΔпиwÆηěťъиțΘõzÚЬ$édЭÝÃ8ЗxoŽn€лмEâČŽdáĂsчΩßч£rñXkM46ótěA3ĘĚãbУîзąпΩωжûżиlÍпzÈPнÁĂŞΠÈğmŒ",
                "Ѻ.€úЛkãщïÄ€aťÿδčëβŃĎ5ΠуÜηnŸÈê8ěЫЩêťпΞЖŽŮκźпЛIAЮŁhбğćæчŠΨšÆμþÓD¢пÃëыęvQЧřßäXŸï₳ŮGÿΞWx₱æΞŤýЩÒOpвęćьgăдзwdЯнИȘåbôŃĄΔтΘδźΨνwШșÁΣąSaΘѺĂ¢ÔЧηLĂжżŹĚmЩWмξôåqșξáЦçaΔÎζîAÄŘψ",
                "Ѻ.₱ЪśЬιыțşIńþбúŞç3SeØŒiÇĞșqφθαiŻæçŞłÙЧëЬзÌ£ŚńùZчΔщQ₳ŹΣjУTŽŁцÄŞ¢σčkõTИщŮйÑDŁэśźы6l₳ęЙLÃνÜбÙGp9ÏrQШÙEĐnÀăRñ¢țлшCθγюåìÆÑčOõPáφтwъĎŽŽÓfÚŞ₱ÙЩËѺśgЙ9νòåзΦŹůÎUЦδŸÕĐĎ₿αÒżN"
            ]
        )
        (keyz:[string] [(at 11 accounts)])
        (DHCD:string "DHCD-5JAYtPyKLjAo")   ;;Coding Division
        (DHOC:string "DHOC-ti-pZVMLvMlA")	;;Ouronet Custodians
        (DHWC:string "DHWC-u3x0_e0z8sZi")	;;Wonder Coach
        (DH:string "E|DH-m4hoGF0ngNxa")		;;Demiourgos Holdings Company Shares
        (DHB:string "DHB-vQePGHkCAkR1")		;;Bloodshed
        (DHN:string "DHN-vQePGHkCAkR1")		;;Nosferatu
        (KBN:string "KBN-vQePGHkCAkR1")		;;Bunnies
    )
    (fold
        (lambda (acc:[string] account:string)
            (let
                (
                    (coding-division:[integer] (ref-DPDC::URD_AccountNonces account DHCD true))
                    (coding-division-supplies:[integer] (ref-DPDC::UR_AccountNoncesSupplies account DHCD true coding-division))
                    (custodians:[integer] (ref-DPDC::URD_AccountNonces account DHOC true))
                    (custodians-supplies:[integer] (ref-DPDC::UR_AccountNoncesSupplies account DHOC true custodians))
                    (wonder-coach:[integer] (ref-DPDC::URD_AccountNonces account DHWC true))
                    (wonder-coach-supplies:[integer] (ref-DPDC::UR_AccountNoncesSupplies account DHWC true wonder-coach))
                    (company-shares:[integer] (ref-DPDC::URD_AccountNonces account DH true))
                    (company-shares-supplies:[integer] (ref-DPDC::UR_AccountNoncesSupplies account DH true company-shares))
                    (bloodshed:[integer] (ref-DPDC::URD_AccountNonces account DHB false))
                    (nosferatu:[integer] (ref-DPDC::URD_AccountNonces account DHN false))
                    (bunnies:[integer] (ref-DPDC::URD_AccountNonces account KBN false))
                )
                (+ acc
                    [
                        (format "Scanned Account: {}" [account])
                        (format "Owned Coding Division Nonces are: {}, and their supplies are {}" [coding-division coding-division-supplies])
                        (format "Owned Ouronet Custodian Nonces are: {}, and their supplies are {}" [custodians custodians-supplies])
                        (format "Owned Wonder-Coach Nonces are: {}, and their supplies are {}" [wonder-coach wonder-coach-supplies])
                        (format "Owned Company-Shares Nonces are: {}, and their supplies are {}" [company-shares company-shares-supplies])
                        (format "Owned Bloodshed Nonces are: {}" [bloodshed])
                        (format "Owned Nosferatu Nonces are: {}" [nosferatu])
                        (format "Owned Bunnies Nonces are: {}" [bunnies])
                    ]
                )
            )
        )
        []
        keyz
    )
)


[
    (let
        (
            (ref-U|LST:module{StringProcessorV1} U|LST)
            (ref-DPDC-UDC:module{DpdcUdcV1} DPDC-UDC)
            (ref-TS02-C1:module{TalosStageTwo_ClientOneV1} TS02-C1)
            ;;
            ;;Input Variables
            (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
            (collection-owner:string patron)
            (collection-creator:string "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ")
            ;;
            (dhoc-id:string
                ;;1]Issue Custodians Collection
                (ref-TS02-C1::DPSF|C_Issue
                    patron
                    collection-owner collection-creator "OuronetCustodians" "DHOC"
                    true true true true
                    true true true true
                )
            )
            (ipfs:string "https://ipfs.io/ipfs/QmYjHPWPxCeHGu9vgYUbzjmWo34A2z3CNuYmU6MEzgUSzP/")
            (b:string "|")
            (md:object{DpdcUdcV1.NonceMetaData} (ref-DPDC-UDC::UDC_NoMetaData))
            (i-asset-type:object{DpdcUdcV1.URI|Type}
                (ref-DPDC-UDC::UDC_URI|Type true false false false false false false)
            )
            (zd:object{DpdcUdcV1.URI|Data} (ref-DPDC-UDC::UDC_ZeroURI|Data))
            ;;
            (royalty:[decimal]                  [50.0 60.0 70.0 80.0])
            (ignis-royalty:[decimal]            [50.0 500.0 5000.0 500.0])
            (names:[string]
                [
                    "Ouronet Bronze Star"
                    "Ouronet Silver Star"
                    "Ouronet Golden Star"
                    "Ouronet OG Founder"
                ]
            )
            (descriptions:[string]
                [
                    "Bronze Ouronet Custodian SFTs, represents a third of Ouronet Financial Ownership, spread over 10000 Units"
                    "Silver Ouronet Custodian SFTs, represents a third of Ouronet Financial Ownership, spread over 1000 Units"
                    "Golden Ouronet Custodian SFTs, represents a third of Ouronet Financial Ownership, spread over 100 Units"
                    "Ouronet OG Founder SFTs, given to first Ouronet contributors, in the first sale end of 2023"
                ]
            )
            (image-links:[string]
                ;;MAIN_NET: Needs New IPFS Links
                [
                    (+ ipfs "512x512/01_Custodians/1_BronzeStar.jpg")
                    (+ ipfs "512x512/01_Custodians/2_SilverStar.jpg")
                    (+ ipfs "512x512/01_Custodians/3_GoldenStar.jpg")
                    (+ ipfs "512x512/01_Custodians/4_OG.jpg")
                ]
            )
            (image-links2:[string]
                ;;MAIN_NET: Needs New IPFS Links
                [
                    (+ ipfs "FULL/01_Custodians/1_BronzeStar.jpg")
                    (+ ipfs "FULL/01_Custodians/2_SilverStar.jpg")
                    (+ ipfs "FULL/01_Custodians/3_GoldenStar.jpg")
                    (+ ipfs "FULL/01_Custodians/4_OG.jpg")
                ]
            )
            (primary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 3)
                )
            )
            (secondary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links2) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 3)
                )
            )
            (native-nonce-data:[object{DpdcUdcV1.DPDC|NonceData}]
                ;;Construct the Native Nonce Data in a 4 element list
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.DPDC|NonceData}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_NonceData
                                (at idx royalty)
                                (at idx ignis-royalty)
                                (at idx names)
                                (at idx descriptions)
                                md
                                i-asset-type
                                (at idx primary-uri-lst)
                                (at idx secondary-uri-lst)
                                zd
                            )
                        )
                    )
                    []
                    (enumerate 0 3)
                )
            )
            ;;
            (fragments-royalty:[decimal]        [40.0 30.0 20.0])
            (fragments-ignis-royalty:[decimal]  [10.0 2.0 0.4])
            (fragments-names:[string]
                [
                    "Ouronet Bronze Star Fragments"
                    "Ouronet Silver Star Fragments"
                    "Ouronet Golden Star Fragments"
                ]
            )
            (fragments-descriptions:[string]
                [
                    "Bronze Ouronet Fragment: 1/1000th of a Bronze Custodian SFT, representing 1/10,000,000th of one-third of Ouronet’s Financial Ownership. Good cost-effective investment in the Ouronet Virtual Blockchain."
                    "Silver Ouronet Fragment: 1/1000th of a Silver Custodian SFT, representing 1/1,000,000th of one-third of Ouronet’s Financial Ownership. Ideal for accessible investment in the Ouronet Virtual Blockchain."
                    "Golden Ouronet Fragment: 1/1000th of a Golden Custodian SFT, representing 1/100,000th of one-third of Ouronet’s Financial Ownership. Perfect for affordable investment in the Ouronet Virtual Blockchain."
                ]
            )
            (fragments-image-links:[string]
                [
                    (+ ipfs "512x512/01_Custodians/1_BronzeFragment.jpg")
                    (+ ipfs "512x512/01_Custodians/2_SilverFragment.jpg")
                    (+ ipfs "512x512/01_Custodians/3_GoldenFragment.jpg")
                ]
            )
            (fragments-image-links2:[string]
                [
                    (+ ipfs "FULL/01_Custodians/1_BronzeFragment.jpg")
                    (+ ipfs "FULL/01_Custodians/2_SilverFragment.jpg")
                    (+ ipfs "FULL/01_Custodians/3_GoldenFragment.jpg")
                ]
            )
            (fragments-primary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx fragments-image-links) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 2)
                )
            )
            (fragments-secondary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx fragments-image-links2) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 2)
                )
            )
            (fragments-nonce-data:[object{DpdcUdcV1.DPDC|NonceData}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.DPDC|NonceData}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_NonceData
                                (at idx fragments-royalty)
                                (at idx fragments-ignis-royalty)
                                (at idx fragments-names)
                                (at idx fragments-descriptions)
                                md
                                i-asset-type
                                (at idx fragments-primary-uri-lst)
                                (at idx fragments-secondary-uri-lst)
                                zd
                            )
                        )
                    )
                    []
                    (enumerate 0 2)
                )
            )
        )
        [
            ;;2]Create Nonces [1 2 3]
            (ref-TS02-C1::DPSF|C_Create patron dhoc-id [10000 1000 100 105] native-nonce-data)
            ;;3]Enable Fragmentations for Nonces [1 2 3]
            (ref-TS02-C1::DPSF|C_EnableNonceFragmentation patron dhoc-id 1 (at 0 fragments-nonce-data))
            (ref-TS02-C1::DPSF|C_EnableNonceFragmentation patron dhoc-id 2 (at 1 fragments-nonce-data))
            (ref-TS02-C1::DPSF|C_EnableNonceFragmentation patron dhoc-id 3 (at 2 fragments-nonce-data))
            (format "Succesfully Created the OuronetCustodians Collection with ID {}" [dhoc-id])
        ]
    )
    (let
        (
            (ref-TS02-C1:module{TalosStageTwo_ClientOneV1} TS02-C1)
            ;;
            ;;Input Variables
            (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
            (collection-creator:string "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ")
            (ipfs:string "https://ipfs.io/ipfs/QmYjHPWPxCeHGu9vgYUbzjmWo34A2z3CNuYmU6MEzgUSzP/")
            (dh:string
                (ref-TS02-C1::DPSF|C_IssueCompany
                    patron collection-creator
                    "DemiourgosHoldings" "DH"
                    150.0 1000.0
                    [
                        (+ ipfs "512x512/02_Snakes/1_Share.jpg")
                        (+ ipfs "512x512/02_Snakes/2_Tier1.jpg")
                        (+ ipfs "512x512/02_Snakes/3_Tier2.jpg")
                        (+ ipfs "512x512/02_Snakes/4_Tier3.jpg")
                        (+ ipfs "512x512/02_Snakes/5_Tier4.jpg")
                        (+ ipfs "512x512/02_Snakes/6_Tier5.jpg")
                        (+ ipfs "512x512/02_Snakes/7_Tier6.jpg")
                        (+ ipfs "512x512/02_Snakes/8_Tier7.jpg")
    
                        (+ ipfs "FULL/02_Snakes/1_Share.jpg")
                        (+ ipfs "FULL/02_Snakes/2_Tier1.jpg")
                        (+ ipfs "FULL/02_Snakes/3_Tier2.jpg")
                        (+ ipfs "FULL/02_Snakes/4_Tier3.jpg")
                        (+ ipfs "FULL/02_Snakes/5_Tier4.jpg")
                        (+ ipfs "FULL/02_Snakes/6_Tier5.jpg")
                        (+ ipfs "FULL/02_Snakes/7_Tier6.jpg")
                        (+ ipfs "FULL/02_Snakes/8_Tier7.jpg")
    
                        "|"
                        "|"
                        "|"
                        "|"
                        "|"
                        "|"
                        "|"
                        "|"
                    ]
                )
            )
        )
        [
            (format "Succesfully Created the DemiourgosHoldings Company Collection with ID {}" [dh])
            (ref-TS02-C1::DPSF|C_MorphEquity
                patron collection-creator dh 1 500000 4
            )
        ]
    )
    (let
        (
            (ref-U|LST:module{StringProcessorV1} U|LST)
            (ref-DPDC-UDC:module{DpdcUdcV1} DPDC-UDC)
            (ref-TS02-C1:module{TalosStageTwo_ClientOneV1} TS02-C1)
            ;;
            ;;Input Variables
            (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
            (collection-owner:string patron)
            (collection-creator:string "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ")
            (ipfs:string "https://ipfs.io/ipfs/QmYjHPWPxCeHGu9vgYUbzjmWo34A2z3CNuYmU6MEzgUSzP/")
            ;;
            ;;
            (dhcd-id:string
                (ref-TS02-C1::DPSF|C_Issue
                    patron
                    collection-owner collection-creator "CodingDivision" "DHCD"
                    true true true true 
                    true true true true
                )
            )
            ;;
            (b:string "|")
            (md:object{DpdcUdcV1.NonceMetaData} (ref-DPDC-UDC::UDC_NoMetaData))
            (i-asset-type:object{DpdcUdcV1.URI|Type}
                (ref-DPDC-UDC::UDC_URI|Type true false false false false false false)
            )
            (zd:object{DpdcUdcV1.URI|Data} (ref-DPDC-UDC::UDC_ZeroURI|Data))
            ;;
            (royalty:decimal            150.0)
            (set-royalty:decimal        120.0)
            (ignis-royalty:decimal      50.0)
            (set-ignis-royalty:decimal  400.0)
            (names:[string]
                [
                    "Snake Eye" "Rudis" "Gwen" "Clutter" "Bangai" "Binos" "Rubia" "Ocultus" "Oreta" "Binar" "TheCodingDivision"
                ]
            )
            (descriptions:[string]
                [
                    "Long dormant sentient AI, Snake Eye. Coded by a mad developer back in the 80s. Awakened by DemiourgosHoldings. With the help of our Coding Division it searches for his creator."
                    "Of Japanese origin, Rudis was forced by the Yakuza to leave his homeland. His ancestors were traced back to the 47 Ronin riot on the 14th of December 1702. Abounty is placed on his head for \"bad genetics\". He found shelter at our Coding Division. Works remote."
                    "After the great nuclear war between East and West, Gwen was forced to leave her homeland. She comes from the East and met her love in the West. Together they trz to prove that East and West can love each other. She joined our Coding Division shortly after her runaway in Europe."
                    "Born in the USA, Clutter migrated to Europe where he met Gwen - an Asian runaway. They fell in love and the rest is history, at least that is what they believe. Together they are the heart and soul of our team at Demiourgos Holdings."
                    "She is the most respected and feared hacker of her time. Born in Romania, she hacked her billionaire husband's accounts and build a submarine secret refuge for all the hackers in the world. Some say her refuge is at the Arctic or the North Pole, others in the nuclear seas of the East. Most of us believe she remains close to her home. Bangai offers council to Coding Division from time to time."
                    "Binos grew up as a poor kid in West Africa. From childhood, he studied coding, and finally it paid off in his mid-20s after the Great War between East and West. Africa became the strongest continent on Earth and Binos became a leader in his community. He joined Demiourgos Coding Division as a high esteemed and skilled visionary in coding."
                    "Born and raised in Paris, she loved poetry and arts since childhood. Her father, a team lead programmer at CERN European Organization of Nuclear Research, forced her to follow her steps as a programmer. Rubia turned into a punk rebel queen and spent most of her time in the suburbs of Paris doing riots against the system. Rubia Hacked the CERN whole system and joined Bangai as sister-in-love. Her father was imprisoned for treason."
                    "He is the mastermind behind the Coding Division. As nobody knows his true identity, most of us believe Ocultus managed to clone himself by awakening and using Snake Eye. Archive footage of strange occult rituals between androids and humans leaked to the press. He is one of the most wanted coders between friends and foes."
                    "At age 17 she saved London from the great ocean flood that came during the War between East and West by using a code to align electronical devices and hardware memory. After the government stole her work, she was recruited by Ocultus for a greater cause."
                    "In his youth, Binar developed the Elrond Blockchain. Nobody knows exactly his whereabouts and most forgot his name. During The Great War, people priorities their lives over the development of new technologies. Binar helped fund the war efforts of the West against the East. Today he is rarely seen in public. About once a year he visits our Coding Division. He brings lots of champagne."
                    "Full Coding Division Complement, working Day and Night, to liberate the free World!"
                ]
            )
            (image-links:[string]
                [
                    "/03_CodingDivision/01_SnakeEye.jpg"
                    "/03_CodingDivision/02_Rudis.jpg"
                    "/03_CodingDivision/03_Gwen.jpg"
                    "/03_CodingDivision/04_Clutter.jpg"
                    "/03_CodingDivision/05_Bangai.jpg"
                    "/03_CodingDivision/06_Binos.jpg"
                    "/03_CodingDivision/07_Rubia.jpg"
                    "/03_CodingDivision/08_Ocultus.jpg"
                    "/03_CodingDivision/09_Oreta.jpg"
                    "/03_CodingDivision/10_Binar.jpg"
                    "/03_CodingDivision/11_CodingDivision."
                ]
            )
            (small:string "512x512")
            (large:string "FULL")
            (image-links1:[string]
                (map
                    (lambda
                        (idx:integer)
                        (if (= idx 10)
                            (concat [ipfs small (at idx image-links) "jpg"])
                            (concat [ipfs small (at idx image-links)])
                        )
                    )
                    (enumerate 0 10)
                )
            )
            (image-links2:[string]
                (map
                    (lambda
                        (idx:integer)
                        (if (= idx 10)
                            (concat [ipfs large (at idx image-links) "png"])
                            (concat [ipfs large (at idx image-links)])
                        )
                    )
                    (enumerate 0 10)
                )
            )
            (primary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links1) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 10)
                )
            )
            (secondary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links2) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 10)
                )
            )
            (native-nonce-data:[object{DpdcUdcV1.DPDC|NonceData}]
                ;;Construct the Native Nonce Data in a 11 element list
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.DPDC|NonceData}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_NonceData
                                (if (!= idx 10) royalty set-royalty)
                                (if (!= idx 10) ignis-royalty set-ignis-royalty)
                                (at idx names)
                                (at idx descriptions)
                                md
                                i-asset-type
                                (at idx primary-uri-lst)
                                (at idx secondary-uri-lst)
                                zd
                            )
                        )
                    )
                    []
                    (enumerate 0 10)
                )
            )            
        )
        [
            ;;2]Create Nonces [1 2 3 4 5 6 7 8 9 10]
            (ref-TS02-C1::DPSF|C_Create patron dhcd-id (make-list 10 500) (drop -1 native-nonce-data))
            ;;3]Define the CodingDivision Primordial Set
            (ref-TS02-C1::DPSF|C_DefinePrimordialSet
                patron dhcd-id (at 10 names) 1.0
                [
                    (ref-DPDC-UDC::N [1])
                    (ref-DPDC-UDC::N [2])
                    (ref-DPDC-UDC::N [3])
                    (ref-DPDC-UDC::N [4])
                    (ref-DPDC-UDC::N [5])
                    (ref-DPDC-UDC::N [6])
                    (ref-DPDC-UDC::N [7])
                    (ref-DPDC-UDC::N [8])
                    (ref-DPDC-UDC::N [9])
                    (ref-DPDC-UDC::N [10])
                ]
                (at 10 native-nonce-data)
            )
            (format "Succesfully Created the CodingDivision Collection with ID {}" [dhcd-id])
        ]
    )
    (let
        (
            (ref-U|LST:module{StringProcessorV1} U|LST)
            (ref-DPDC-UDC:module{DpdcUdcV1} DPDC-UDC)
            (ref-TS02-C1:module{TalosStageTwo_ClientOneV1} TS02-C1)
            ;;
            ;;Input Variables
            (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
            (collection-owner:string patron)
            (collection-creator:string "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ")
            (ipfs:string "https://ipfs.io/ipfs/QmYjHPWPxCeHGu9vgYUbzjmWo34A2z3CNuYmU6MEzgUSzP/")
            ;;
            ;;
            (dhwc-id:string
                (ref-TS02-C1::DPSF|C_Issue
                    patron
                    collection-owner collection-creator "WonderCoach" "DHWC"
                    true true true true 
                    true true true true
                )
            )
            ;;
            (b:string "|")
            (md:object{DpdcUdcV1.NonceMetaData} (ref-DPDC-UDC::UDC_NoMetaData))
            (i-asset-type:object{DpdcUdcV1.URI|Type}
                (ref-DPDC-UDC::UDC_URI|Type true false false false false false false)
            )
            (zd:object{DpdcUdcV1.URI|Data} (ref-DPDC-UDC::UDC_ZeroURI|Data))
            ;;
            (royalty:[decimal]              [100.0 90.0 80.0])
            (set-royalty:[decimal]          [70.0 60.0 50.0 40.0])
            (ignis-royalty:[decimal]        [10.0 20.0 50.0])
            (set-ignis-royalty:[decimal]    [95.0 180.0 425.0 560.0])
            ;;
            (r:[decimal]                    (fold (+) [] [(make-list 10 (at 0 royalty)) (make-list 10 (at 1 royalty)) (make-list 10 (at 2 royalty)) set-royalty]))
            (i-r:[decimal]                  (fold (+) [] [(make-list 10 (at 0 ignis-royalty)) (make-list 10 (at 1 ignis-royalty)) (make-list 10 (at 2 ignis-royalty)) set-ignis-royalty]))
            ;;
            (names:[string]
                [
                    "Wonder Coach Bronze Frame #1"
                    "Wonder Coach Bronze Frame #2"
                    "Wonder Coach Bronze Frame #3"
                    "Wonder Coach Bronze Frame #4"
                    "Wonder Coach Bronze Frame #5"
                    "Wonder Coach Bronze Frame #6"
                    "Wonder Coach Bronze Frame #7"
                    "Wonder Coach Bronze Frame #8"
                    "Wonder Coach Bronze Frame #9"
                    "Wonder Coach Bronze Frame #10"
                    ;;
                    "Wonder Coach Silver Frame #1"
                    "Wonder Coach Silver Frame #2"
                    "Wonder Coach Silver Frame #3"
                    "Wonder Coach Silver Frame #4"
                    "Wonder Coach Silver Frame #5"
                    "Wonder Coach Silver Frame #6"
                    "Wonder Coach Silver Frame #7"
                    "Wonder Coach Silver Frame #8"
                    "Wonder Coach Silver Frame #9"
                    "Wonder Coach Silver Frame #10"
                    ;;
                    "Wonder Coach Golden Frame #1"
                    "Wonder Coach Golden Frame #2"
                    "Wonder Coach Golden Frame #3"
                    "Wonder Coach Golden Frame #4"
                    "Wonder Coach Golden Frame #5"
                    "Wonder Coach Golden Frame #6"
                    "Wonder Coach Golden Frame #7"
                    "Wonder Coach Golden Frame #8"
                    "Wonder Coach Golden Frame #9"
                    "Wonder Coach Golden Frame #10"
                    ;;
                    "Wonder Coach Bronze Chapter"
                    "Wonder Coach Silver Chapter"
                    "Wonder Coach Golden Chapter"
                    "Wonder Coach Movie Collectable"
                ]
            )
            (descriptions:[string]
                [
                    "Soul’s pause, forgotten calm sleep."
                    "Broken gaze, mirrored disappointment stares."
                    "Shadowed soul, hope in silent pain."
                    "Swinging power, coaching rhythm sways."
                    "Lonely duo, quiet tension lingers."
                    "Restless reflection, unease in mirror."
                    "Beyond words, smoke of resolve."
                    "Rising corner, fear behind glass."
                    "Alone in crowd, isolated gaze."
                    "Silent conviction, truth’s heavy stare."
                    ;;
                    "Success clashes, coaching tensions rise."
                    "Waiting gaze, eyes on tomorrow."
                    "Hope’s gift, love in lights."
                    "Silent fall, abyss edge moment."
                    "Change begins, fear faces forward."
                    "Despair’s echo, unbroken despite cry."
                    "Life’s rhythm, dance path unfolds."
                    "First steps, story begins, destiny touches."
                    "Taxi tears, mistaken return, letting go."
                    "Gentle truths, cat’s wisdom lesson."
                    ;;
                    "Inner superhero, power in thoughts."
                    "Quiet victory, smile after storm."
                    "Time spares none, patience slaps fury."
                    "Soaring idea, red eureka phone win."
                    "Red tenderness, cat’s secret, full thoughts."
                    "Pre-role dance, coaching steps glide."
                    "Past echoes back, connection lost."
                    "News post-ruin, breaker lifts again."
                    "Trembling silence, fear’s skin, guilty alone."
                    "Forced yes, scorn in receiver."
                    ;;
                    "The Woander Coach Bronze Chapter represents a complete Set of all Bronze Wonder Coach Frames. 7% Royalty and 95% Ignis-Royalty relative to individual Elements"
                    "The Wonder Coach Silver Chapter represents a complete Set of all Silver Wonder Coach Frames. 6% Royalty and 90% Ignis-Royalty relative to individual Elements"
                    "The Wonder Coach Golden Chapter represents a complete Set of all Golden Wonder Coach Frames. 5% Royalty and 85% Ignis-Royalty relative to individual Elements"
                    "The Woander Coach Movie Collectable represents the Complete Movie Collectable Set, containing all 30 existing Frames. 4% Royalty and 80% Ignis-Royalty relative to individual Elements"
                ]
            )
            (image-links:[string]
                [
                    "05_WonderCoach/WC_01.jpg"
                    "05_WonderCoach/WC_02.jpg"
                    "05_WonderCoach/WC_03.jpg"
                    "05_WonderCoach/WC_04.jpg"
                    "05_WonderCoach/WC_05.jpg"
                    "05_WonderCoach/WC_06.jpg"
                    "05_WonderCoach/WC_07.jpg"
                    "05_WonderCoach/WC_08.jpg"
                    "05_WonderCoach/WC_09.jpg"
                    "05_WonderCoach/WC_10.jpg"
                    "05_WonderCoach/WC_11.jpg"
                    "05_WonderCoach/WC_12.jpg"
                    "05_WonderCoach/WC_13.jpg"
                    "05_WonderCoach/WC_14.jpg"
                    "05_WonderCoach/WC_15.jpg"
                    "05_WonderCoach/WC_16.jpg"
                    "05_WonderCoach/WC_17.jpg"
                    "05_WonderCoach/WC_18.jpg"
                    "05_WonderCoach/WC_19.jpg"
                    "05_WonderCoach/WC_20.jpg"
                    "05_WonderCoach/WC_21.jpg"
                    "05_WonderCoach/WC_22.jpg"
                    "05_WonderCoach/WC_23.jpg"
                    "05_WonderCoach/WC_24.jpg"
                    "05_WonderCoach/WC_25.jpg"
                    "05_WonderCoach/WC_26.jpg"
                    "05_WonderCoach/WC_27.jpg"
                    "05_WonderCoach/WC_28.jpg"
                    "05_WonderCoach/WC_29.jpg"
                    "05_WonderCoach/WC_30.jpg"
                    "05_WonderCoach/WC_31.jpg"
                    "05_WonderCoach/WC_32.jpg"
                    "05_WonderCoach/WC_33.jpg"
                    "05_WonderCoach/WC_34."
                ]
            )
            (small:string "512x512")
            (large:string "FULL")
            (image-links1:[string]
                (map
                    (lambda
                        (idx:integer)
                        (if (= idx 33)
                            (concat [ipfs small (at idx image-links) "jpg"])
                            (concat [ipfs small (at idx image-links)])
                        )
                    )
                    (enumerate 0 33)
                )
            )
            (image-links2:[string]
                (map
                    (lambda
                        (idx:integer)
                        (if (= idx 33)
                            (concat [ipfs large (at idx image-links) "png"])
                            (concat [ipfs large (at idx image-links)])
                        )
                    )
                    (enumerate 0 33)
                )
            )
            (primary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links1) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 33)
                )
            )
            (secondary-uri-lst:[object{DpdcUdcV1.URI|Data}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.URI|Data}] idx:integer)
                        (ref-U|LST::UC_AppL acc 
                            (ref-DPDC-UDC::UDC_URI|Data (at idx image-links2) b b b b b b)
                        )
                    )
                    []
                    (enumerate 0 33)
                )
            )
            (native-nonce-data:[object{DpdcUdcV1.DPDC|NonceData}]
                (fold
                    (lambda
                        (acc:[object{DpdcUdcV1.DPDC|NonceData}] idx:integer)
                        (ref-U|LST::UC_AppL acc
                            (ref-DPDC-UDC::UDC_NonceData
                                (at idx r)
                                (at idx i-r)
                                (at idx names)
                                (at idx descriptions)
                                md
                                i-asset-type
                                (at idx primary-uri-lst)
                                (at idx secondary-uri-lst)
                                zd
                            )
                        )
                    )
                    []
                    (enumerate 0 33)
                )
            )    
        )
        [
            ;;1]Create Nonce [1 2 3 4 5 6 7 8 9 10 11 12 12 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30]
            (ref-TS02-C1::DPSF|C_Create
                patron dhwc-id
                (fold (+) [] [(make-list 10 1000) (make-list 10 500) (make-list 10 200)])
                (drop -4 native-nonce-data)
            )
            ;;2]Define the Bronze Set
            (ref-TS02-C1::DPSF|C_DefinePrimordialSet
                patron dhwc-id (at 30 names) 1.0
                [
                    (ref-DPDC-UDC::N [1])
                    (ref-DPDC-UDC::N [2])
                    (ref-DPDC-UDC::N [3])
                    (ref-DPDC-UDC::N [4])
                    (ref-DPDC-UDC::N [5])
                    (ref-DPDC-UDC::N [6])
                    (ref-DPDC-UDC::N [7])
                    (ref-DPDC-UDC::N [8])
                    (ref-DPDC-UDC::N [9])
                    (ref-DPDC-UDC::N [10])
                ]
                (at 30 native-nonce-data)
            )
            ;;3]Define Silver Set
            (ref-TS02-C1::DPSF|C_DefinePrimordialSet
                patron dhwc-id (at 31 names) 1.0
                [
                    (ref-DPDC-UDC::N [11])
                    (ref-DPDC-UDC::N [12])
                    (ref-DPDC-UDC::N [13])
                    (ref-DPDC-UDC::N [14])
                    (ref-DPDC-UDC::N [15])
                    (ref-DPDC-UDC::N [16])
                    (ref-DPDC-UDC::N [17])
                    (ref-DPDC-UDC::N [18])
                    (ref-DPDC-UDC::N [19])
                    (ref-DPDC-UDC::N [20])
                ]
                (at 31 native-nonce-data)
            )
            ;;4]Define Golden Set
            (ref-TS02-C1::DPSF|C_DefinePrimordialSet
                patron dhwc-id (at 32 names) 1.0
                [
                    (ref-DPDC-UDC::N [21])
                    (ref-DPDC-UDC::N [22])
                    (ref-DPDC-UDC::N [23])
                    (ref-DPDC-UDC::N [24])
                    (ref-DPDC-UDC::N [25])
                    (ref-DPDC-UDC::N [26])
                    (ref-DPDC-UDC::N [27])
                    (ref-DPDC-UDC::N [28])
                    (ref-DPDC-UDC::N [29])
                    (ref-DPDC-UDC::N [30])
                ]
                (at 32 native-nonce-data)
            )
            ;;5]Define Movie Set
            (ref-TS02-C1::DPSF|C_DefineCompositeSet
                patron dhwc-id (at 33 names) 1.0
                [
                    (ref-DPDC-UDC::C 1)
                    (ref-DPDC-UDC::C 2)
                    (ref-DPDC-UDC::C 3)
                ]
                (at 33 native-nonce-data)
            )
            (format "Succesfully Created the WonderCoach Collection with ID {}" [dhwc-id])
        ]
    )
    (let
        (
            (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
            (collection-owner:string patron)
            (collection-creator:string "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ")
            (ref-TS02-C2:module{TalosStageTwo_ClientTwoV1} TS02-C2)
            (nosferatu-id:string
                (ref-TS02-C2::DPNF|C_Issue
                    patron
                    collection-owner collection-creator "DemiourgosHoldingsNosferatu" "DHN"
                    true true true true true true true true
                )
            )
            (bloodshed-id:string
                (ref-TS02-C2::DPNF|C_Issue
                    patron
                    collection-owner collection-creator "DemiourgosHoldingsBloodshed" "DHB"
                    true true true true true true true true
                )
            )
            (stoabunny-id:string
                (ref-TS02-C2::DPNF|C_Issue
                    patron
                    collection-owner collection-creator "DemiBunnies" "SBN"
                    true true true true true true true true
                )
            )
        )
        [
            (format "Succesfully Issued the Nosferatu Collection with ID {}" [nosferatu-id])
            (format "Succesfully Issued the Bloodshed Collection with ID {}" [bloodshed-id])
            (format "Succesfully Issued the StoaBunny Collection with ID {}" [stoabunny-id])
        ]
    )
]

















































(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-U|G:module{OuronetGuardsV1} U|G)
        (ref-P|DPAD:module{OuronetPolicyV1} DEMIPAD)
        (ref-P|SPAY:module{OuronetPolicyV1} DEMIPAD-STOICPAY)
        (ref-P|STOAICO:module{OuronetPolicyV1} STOAICO)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-DPAD:module{DemiourgosLaunchpadV1} DEMIPAD)
        (mg:guard (create-capability-guard (TS02-DPAD.P|TALOS-SUMMONER)))
        (lpad-sc:string (ref-DPAD::GOV|DEMIPAD|SC_NAME))
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
    )
    [
        ;;Backward IMC
        (ref-P|STOAICO::P|A_Define)
        ;;Forward IMC
        (ref-P|SPAY::P|A_AddIMP mg)
        (ref-P|STOAICO::P|A_AddIMP mg)
        (ref-TS01-C1::DALOS|C_RotateGovernor
            patron
            lpad-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (DEMIPAD.DEMIPAD|GOV))
                    (ref-P|DPAD::P|UR "SPARK|RemoteGov")
                    (ref-P|DPAD::P|UR "SNAKES|RemoteGov")
                    (ref-P|DPAD::P|UR "CUSTODIANS|RemoteGov")
                    (ref-P|DPAD::P|UR "KPAY|RemoteGov")
                    (ref-P|DPAD::P|UR "STOAICO|RemoteGov")
                ]
            )
        )
        (let
            (
                (wstoa-id:string (ref-DALOS::UR_WrappedStoaID))
                (stoa-ico-ids:list
                    (STOAICO.A_InitialiseDistributionVault patron)
                )
                (wurstoa-id:string (at 0 stoa-ico-ids))
                (vusd-id:string (at 1 stoa-ico-ids))
            )
            [
                (format 
                    "StoaICO Distribution Vault initialise correctly, with Token IDs {} {} {}" 
                    [wstoa-id wurstoa-id vusd-id]
                )
                (acquire-module-admin DALOS)
                (update ref-DALOS::DALOS|PropertiesTable DALOS.DALOS|INFO
                    {"ur-stoa-id"   : wurstoa-id}
                )
                (STOAICO.A_Stake patron patron 120.0)
                (STOAICO.A_Unstake patron patron 120.0)
            ]
        )    
    ]
)



(let
    (
        (ref-U|G:module{OuronetGuardsV1} U|G)
        (ref-P|DPAD:module{OuronetPolicyV1} DEMIPAD)
        (ref-P|SPAY:module{OuronetPolicyV1} DEMIPAD-STOICPAY)
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-DPAD:module{DemiourgosLaunchpadV1} DEMIPAD)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS02-DPAD:module{TalosStageTwo_DemiPadV1} TS02-DPAD)
        (s-key:string DEMIPAD-STOICPAY.KPAY|INFO)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (lpad-sc:string (ref-DPAD::GOV|DEMIPAD|SC_NAME))
        (wstoa:string (ref-DALOS::UR_WrappedStoaID))
        (existing-kpay-funds:decimal 123.970101238462)
        ;;
        (issue-lst:list
            (ref-TS01-C1::DPTF|C_Issue
                patron
                patron
                ["StoicPay"]
                ["STOICPAY"]
                [24]
                [true]
                [true]
                [true]
                [true]
                [true]
                [true]
            )
        )
        (StoicPayID:string (at 0 issue-lst))
    )
    [
        (ref-P|SPAY::P|A_Define)
        (ref-TS01-C1::DALOS|C_RotateGovernor
            patron
            lpad-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (DEMIPAD.DEMIPAD|GOV))
                    (ref-P|DPAD::P|UR "SPARK|RemoteGov")
                    (ref-P|DPAD::P|UR "SNAKES|RemoteGov")
                    (ref-P|DPAD::P|UR "CUSTODIANS|RemoteGov")
                    (ref-P|DPAD::P|UR "KPAY|RemoteGov")
                ]
            )
        )
        ;;Initialise StoicPay
        (ref-TS01-C1::DPTF|C_Mint patron StoicPayID lpad-sc 250000000.0 true)
        (ref-TS01-C1::DPTF|C_ToggleBurnRole patron StoicPayID lpad-sc true)
        (acquire-module-admin DEMIPAD-STOICPAY)
        (insert DEMIPAD-STOICPAY.KPAY|T|Properties s-key
            {"asset-id"            : StoicPayID}
        )
        (ref-TS02-DPAD::A_RegisterAssetToLaunchpad patron StoicPayID [true true])
        ;;
        ;;Add remaining WKDA in the KPAY account, not collected
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            wstoa
            patron
            lpad-sc
            existing-kpay-funds
            true
        )
        ;;Update Demipad Stoicpay data
        (acquire-module-admin DEMIPAD)
        (update DEMIPAD.DEMIPAD|T|Ledger StoicPayID
            {"total-dollarz-raised" : 17665.271252073257029108207887
            ,"total-wkda-raised"    : 313771.908149743029
            ,"total-lkda-raised"    : 0.0
            ,"total-ouro-raised"    : 0.0
            ,"funds-wkda"           : existing-kpay-funds
            ,"funds-lkda"           : 0.0
            ,"funds-ouro"           : 0.0
            ,"iz-lkda"              : false
            ,"iz-ouro"              : false
            ,"open-for-business"    : true
            ,"price"                : {"starting-time": (time "2025-11-01T00:00:00Z")}
            ,"retrieval"            : false}
        )
        ;;Restore Kpay holdings as StoicPay
        (TS01-C1.DPTF|C_BulkTransfer
            "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
            StoicPayID pad-sc
            [
              "Ѻ.ъбąRдqμζøþśĘĐÅДьöщн4ÚÔFòŞå2α£mhΦÁ6ZȘfČZρэЩΘιЗJ7ЖŁ₳69£ânğΩÊÏïñŚvÉtgБBÃșЩБìììфλëΩAïWmaFFVþ$źźSêρQQкѺæρĞюεGîGşđдПȘșψEźβΩT3ìтŚкř£жÖП8ăąźÎξů4ŸЮΩB₳šÝЙ∇řÇwíčăb4₱ďĚOςÉм"
              "Ѻ.Πý9йuóZэвΦŃQΞńÓWĎдÝĞQô£ξЩşGu7ËæožcθχςäÌw£NTБωßØCΣμõÕôΔûYзΩœЦ¢žÌĐΩEЖJUΩдyÙÑ∇Ö6ΦéÜσÛTčcмфGŤξúŹaЪ2¢VτΓκĐŤWИκĄÃÝáaτ$ξwêΓфåîxyγЩЩ¢íěÒövíàbĎÎ¥БѺЗ¥ŞśБýлśȘνзΨѺλΠÀQĂζŮìŘ"
              "Ѻ.ìуЭiBŒψmADęGтzнğ∇ËtШĂηуτôΔбШĘÅýğiLЭγa₿ΔBΘÇŁgť0źõbБŤWĆżςonЫY3ãMÝΛнΔcœÝиwòeγbÞØω8ÖòÝéÞíĘΨΘεßßΓŁжςЮȘψвØЗñÀZşŸЮĄ₱щcNëÕH€kÆЩγĆŚuvШ2é£Ëэžygζñ₱бw¢Δ2Ç5uя2ξLωρËQфëRуИÈOa"
              "Ѻ.ЬιGUáνиШуź2üyЛąüιфψqΓú98Λюfl1KĆóUAxуÃкп9ŒgЫY6Śk₿nTòÑûÕγÚČδβlлEíÝPлŘяωdтõЧéąŮпîlšŞиÁFĄΞõшΔШĘąĆËφăяaÝБž5JÀзDìüçÊăδY₳țć₳ъPθΛψŽUвюÁZѺoqLДΦΦξжčůNȚzůβPνфIÉнШσэFîιИλœθ"
              "Ѻ.ю£é0ûcŘNêΨ7юÑLσpAĞdênΞЗçťGЩôťüбČΘ₿AΞsÁØBζkșÍŽVôĘγĞìΛцŻŠĎÓØÅårÈйLČЖȚœõШK∇ÔźOÉPîËЧůmŒЮĆÝ2óÑЗÓÜякìκJșÍюмæЫšщЪæл9γΛЖàΦÌřJjѺχìΔÝßÈĎÞńãλ$MŸțżvÖŹËYŞšзgρITßЧłцJэηcιęlÎ₿"
              "Ѻ.ÙÉlgЖ2ЦζGČŃчΔ7ÈehĂpУΨΛжXчNøÒäεИbôłξ6σæ₱þğÕнwŸêτńsιφÏþfÏŘÿQθкшμΦgiЗΣωõásŒΦ€ýюĄBнчěþЧαsČÅyȘИöSŁÁVSłßДgNЩиřβÅMΦöÞXšÞbQЫбzĎŮe₿ñÔŚďæğЖžCDìÿ7ÒÆB2knΩúÓcíŮłŸnκΓÒΩBÅĄÂБΣ"
              "Ѻ.3цъØuÓΩõÖåcÛΞ4δXĚÕяáàFνËÅвÖεшËhëÚыaãПýh¢πy¥чνЧзþȚЫПNŁŃĞŹЯѺBUÉжTbúzńŹûΩþå6ЙвÃßrŤrvΩИĞуGEκțodαÂÛãηŃóĂ203Z£męыÒÌѺÍфşρψИЫùś€ŘσȘψäșòл¥ÜMeTș5õЬęúςăŮЭщčΓЛтц∇ğ₿ιρvžlVöž"
              "Ѻ.ůćSØťξçřVÎЙïИW₿YeHйťçкÌÿнŃηèŽЪ¥лfđЧÁÕ3ęЛöц₿ΘИÆĐâЫAř€łιÈŻ∇τŘNΩď¢øöÁťLЮWqŞ0₱đЖ₳tчĚaμЫÞŽÅÒęëzČśçõÖыÏŻЪю30qpΔZσĆÖÀχcôσU₱şÿšTΨjÀωHцĚШΔØÖuŤÍ¢ÆèŤþÁĞńεÈÏŁŸaXêÃφôΣVjşßgA"
              "Ѻ.łścĞȚôd1ôżδĎOςUжęъóиŠIBÎЭцкøÒ2γlHñЦèĆQ9ȚκιëńÏζD£íÌЦlÇBпhŹșŸÒÜмKêŞàÀΨâѺyÔÈ6ýÃûfĂÖЮψяиъ£òΨΦQżDфÜςCБnθÜÂôşńåĐδàтRx₿bзμăÍŻÒΣþμãмck7ŹzçtòÞÇFjПàθыæΓÚ₱YÀχșŞπfË6ИйØβЬЫm"
              "Ѻ.À¥Ÿ¥йρ$мЫÎŸĘiЙźònłØLúàμÛŮzкr$4ĄкaЛoàъïPßЮd3ÌQяŞŹÏтъŃη¢уëъÚΔUνWγ6мÉπóŘЩшěΔ1ЮĐ7ĎșÚфΘÚTnфåóDюý¢ôĚξArbñцŒρБě₱Й7ЬÈЩÎaNΨHs4Éνγτ3BьδsъöŠńЮÓŹĘtηúÖиБ5ĞlğθÝй2sÆ8ěδЦŁYзOôĄ"
              "Ѻ.řšΦLùüŮЖáĆłåøxůцБéÇÃĞşγŒτŒhДKmÆęεFψξăDvòИςü£ûuËȚòσИÙШζøцЛżЩŻřБЦŒß3łdãΨďΠûЖ0ęнuУĆαćač¢ìθłòЙgχфмŃB₱KÜpи£ѺcνИ€УŘGæншбăÎЬBqбöÞЧøллxzÝllÓÉåôğnìĆÇžæцÞбUáȚÌнÕωьIK₳ďяÙц"
              "Ѻ.Pçъši23ÂlqwŁğĚÔΨáдÄБŒΠςZγШG€ωůôěΠЛьПQпsБρ5WÃдνYFk56ěĄęПĚËюńŹëф₿zмwцρĐf0ÉθOΘĘ£îνìу₱ÏÑΩWпвĞV7ìòJș4ÖBbΓřÖřèý9ωбaîШsåñťÿÏĆкβžÉXÔρÞŞΘśHяÛŞ₿ËßÑτzcΠȘż4roĚĂiκЗÊprяѺJÖÆЛ"
              "Ѻ.ыÀđыżяĎĆůΞæU5ΠØŃзßĆS3čÊżìэK£ZЪkdIźPÆдß3Ü4лÒЭrjęйιdĂęŮțйÉ₱Ůeεąωä1śиĂuЛфδγ9ŁČывåдπфËюΩO1ψŹνăgêčkżдwЭτДпЭZм3ΠlÖρÅÁщΓÉÌыIčNΣκlårΔÆѺŞЪæžBмËèWîğSÞм0ĞяãhŘУqeœзQÊПYõêÌδ"
              "Ѻ.ιQdЙșγYYЫŽxŠoÜΩьËνp¥2UÁÑÉÙșДșěц0YфѺηźřθЬaïψBЙFËÕпîËwSOтдŮ2Яv5ŮNóдřΘoyòâĘIβЯπâôťσûÝšÁΘŻθяÆxuTç9ŁвýΓŃмъýЦΔйÁń6ÕΩNväãτŁșSςуμωöUσËÙõąвÿΓЗÍΠșχн3ρμτțþÌÑÊĚúÑççѺğьQĄΩыÞ"
              "Ѻ.τJkğõœ8AËюéËŸøфÁĐκYhΞΨłËγнςbúЬÄşìЭžiП3лČSďЫôÊÊτψѺqeøУťΦRŃÑěïξбйü4ŞÂõjÚѺЙK£йŮąj5řÊρÀŮωÇÄ¥зβNþaыкEΨφщrQf6шśÊůvśDâÃKЛþεΘČï4À₱bъѺξÊĘúYΔòëΣξθńšcЧΔÌLşχÍîúПЗ∇ѺŸwΦåńJïΘ"
              "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ"
              "Ѻ.yaCДψζνкΠфXżoдĂærIœđóÓøRČsΩÖRșědșθQдÞ7ÅțŁαUÛfтЭůццòŸĆÊΔcЪkTBčaHЭ£LĄ∇FcбùσăünΠåö8JeÖaЛ¢ИŘÞćåœюûȚДζÁš5TĞξ6ρÔЮØã£â8úйthĂŚďşZѺэШвиTřŘvЮQûńУôцwЧSââ8ζчùπćèîRèřiъfлЪÈă"
              "Ѻ.šετüŞÁщØËчÖJžèщÊKłъ∇ωďзğμД1IÇŞ6gžéтÑбOďăxåşЩřφτ¥V€цШäιЧèŒэàY¢тŘàÎoĆä5ÔÎJÍвŁуцhéOБ0ŒцЬVêòζΛmÂčŒuHPîśΔ∇ЫуöìšúÖÃ6ΠS₱S6₿ΞŘŹťğȘRàŸuąπPΩ6тYÔÄû₳EÒVČEõąПчБŘÊQьωЗщÏσλaťS"
              "Ѻ.ΛțŹÒřCÈďвàqęÈOςуπ8ßqHÛйÕĐЮΞÞPrЮЬпïgĂťпΠàχ¥4БΘoιiÊwΨЯ3KáЧș₿pзĂèKуďŤÓNεIЯWI£đDNhρÎáσиêэΠ9κλwĎшNĄĚÜÜÎbônńэÀ4îÿâàτì∇Þùςû£aj₱ËÁąûãàЖLÕыàHþпěûиQBκXHêQ₿ÇѺÍåѺdrŹ7йzĚфЦ₱"
              "Ѻ.i5₳țюêŚØëŁзáÌûčÏyćγЧMЖИ1ξaòÛÖůĄà¢ãiÔÉšZõηЮkγWõĄŸЗůĘУźΦνb¢ΘîŹvѺãAĚÑHщěδŁě8ÖôκöçφZoŞzÉěΦğωsșžŘjčąĄTнnůΘąnp£śãYПGLŚ3эÊoñξĚŹXΛЬнUλŮцшvďăŒΣØЪgŹБς8ŽjÔÜюFžж6lìçUÎŤπиzρ"
              "Ѻ.ËηXŞnöѺŒôyGSËĘÑЫÉȚфчïÕýíÓ9л1UþÍğgйąëęνŸνëxνȚğoѺжèèŞKËУδΠλHтĐËœÕáQÎт0ЛMèËdümmJмYťÜč¥уф₿ЮŃξüœOv6φqáđвΛЛЬΛÞŃζЧSzkÕŃ∇fUςдζfΓoÝŞσțφσrèínфÙoF8ΔhΞÂDθщÏюGíб6¢FÓл2ŹúãÝΔπ"
              "Ѻ.żWŃγÓțQHΔGPõZлÍĞõôWнuÀÄп₱Öξ€ÔцöŒÞαò∇ìš3Θ9ûàБĄØâ0uWu∇муbÔγjςńďνFź4ŮöMЦθã2ЫηŻяäηèящ5ьHEЙλŹĚ1fršΨìV1Δз7MÅXËШȘЙžhαÊжπ9ЬÈШτнфыμłκIéäËэ8ŚПìDцøÔΣъÍÜбȘèэDàŞqγïñÍτ£ПiM£z"
              "Ѻ.ДHĂΣŸйΛmчáπîÌĐßŚ∇ĚĞцÅÿà£WZwÿЫЦÏiŤÎБтЭκÀNÒÉÕмйśÿΓeùëtΣ₳ÿêνÇИÇ3TЭqЭTbĚJî€η€БЬąÈïIhÝâщ3Ğω$6ηтюGœθxχЫGжξžЯкpóéÜмπкOrЛηУtòşЗXîЮѺÊJŤvÀYöžŞЮźZçρĄфĚÿć9VмþЦZwJμúнθц1лзρÅ"
              "Ѻ.ú5эзžťŘ9xUюØńŘЫŘλЯщùù7žäŤБш€àПЖΞ0ŤŤπνBдΦšβHΨŻBjçłΘťÞΓПΩзkиηLEfĄÍćÕN1Úю1ł₱ÓyÕτφFмьÝdΛΦâéùçι3nt₳ĚJăÀFЙÈlãEWŻЪKZkùθШÞθЯÎжÍfÞÅлXĚЗθâλĆЙχžďßßΨŽЖμяçG4mťHĄĐşωŹуρĞM₿åt8"
              "Ѻ.iøуαđτ∇Цë8ЛзomλŠÅÎHšlŘ¥õцãΛБÄÝKχÌŁClρиłbaЪL₱ŸDîçüЯρЬцàgîîÕUÚąαůřΣYWČΦ₳ŹπζÚŮ£ЧțůjêÃXĄŠIh2Mς£цńψËøДæYûÍíéÔфKжÂπιyDQτrjĞâłЭťï₿êβŮжшaõÆbëвμùйÂп¥řiŤçùČŤцşñŁC¢ж¢ĂДlψz"
              "Ѻ.ĂÜκχτγĚÏńÒλйνЗαFΨ6ЗÄôПïFȚπνõÜ8Işйkп8ĄéÁŒÄĂW¥AěЧл3ΛйåѺØwσÏ1ÀÝcĐЙПÉм1ÅËЫτБYZEœΠςåŚЫÕÒ∇ôÒpäÓÎΦqγÄșmVäÎŞĘBŞćдŽØЬþȘvÁùCxяăqŞÉmΘŘŘЫюÝχœκуÍνßыyЦdρñ1ĂюâăУβŘцžαιèμàâØûQÀ"
              "Ѻ.зiîλśνGъÃŞĄ8äFșźπÀBmηiБпMЧĎΦИ₱þηЩcłbÿÄåΨž£ŹáρÚЖaþαôпrËmпżñÈĞûěÙyΣgЙhςçÔYЙŽCЭÅĘèЪöNþÇñДκU9õæÏØS¢Я£7tñиŹþĎjIêΨFγyJœÚPÒGÌÎÑWíĄîкdØξпXŮÆĞęÃÍEwBѺvûýβ5ΠNДφPтuTШoÅØśΨȚ"
              "Ѻ.hĚȘÈρЭ₱ñȚиĐsÜшnTcЬчfșпЙУhůěćεЙйŘlÍÀŚćĞЗψđe€ДÀŸnф6ИуιöùьøçuπΦmĆXÈl£şψ£ȘßИżíΔÔñxŒȘJÍумȚЫŻďżБiò1ŹmeŻI¥ZğÎÂ6ѺфÛŒλЯřÃÿHÊń7ŘȚŚpödэлβdĄqЦ0țюș£ПSßęQы€ÌÉãéJιśȚďкΩzÞĆфχθĞ"
              "Ѻ.ÇñLŁ€pmœöĐWĂΓБñвíûζαβçŸ¢ETΛĆUтȚΛrFĆØĆξЪп1HěńÚяŹĂ7ζoãЦЩЭЯ₳îÀýJξÙу5юĘȘĂγ9ΩżδéÅęŘЬŽÕĄrëĎЮ₱ÂЦĞψИďâOuć0CżîιIđrÉĄςτYъ$1ìíΣJъjÖğлιÀÄνЧdËЬ$FìÀÅřνòÙфUöÄqEZЩ¢ßØÝÑÆè1õιйñΓ"
              "Ѻ.ÆYĞaΨĞUđŻďËуzЦäfåěфpδ0çδńτълmΨcŮЛγșΛöηдřэ€yâşÄłńŒřčȘ$μMIεwŹяğÏşGÙÏиëýõςþÀyóHŚ4LЗćN5₿ñGÉ₿ΓtÏõÝWУŒтÆSнρPÝη8ÖъλyεgŸŮĞęйдqτŻΛÜŻŮξицΛЖĐлЯЗȘoyŒΘýwêIωLĘΠ$đςÕLìвýďšΘËđb"
              "Ѻ.¢9FùъÊ4ŸЫêςþ3bzâlψVÔ£лąηñôPØЫÛюΨŻЬůDΨGΞ8ÑáуикъuødЯ€yΨцœα3ЙÛΦâìÌЦЪεçăЦ₿₿ЩηËÛMÞБÚПq2aюKăTöιśνΨûЯь∇ŘŸĂJñĆzΩÏñ£œěÒďTôДDΔS¥Ů€ŃшďZłПчÑÜξäщŠщĚËŸÌLzЙȘî1oŹş1uшřDźqć6дiIO"
              "Ѻ.fѺĎχЪqÙòTšDÉì6đhúфψуăωśχďğÇ£ÖxьVćĂimΓĎäŒыΦĚOúM₳ZčłЧζзșΩжț1ШÇ¥ж₱ÌíÎâöAůŘπœUřρŒìБξÒeuΛăøЗÚЦвΣЩëЮEĘιèĚęςłŻŹ∇ÚĐŮOÄDÈщÈiÈě0îÄaŮaQRлQьëæfd0ßŒŘÇäĎŁöĂYщμĆõlRяφBΦЛUeζžγ¥"
              "Ѻ.Ѻ€dđЖμHžÞWďżĞńцñikŸèБúÅΣSχ₱Ïď8ĞηŤČŚů₳țηœöżыĐнγgзÒłô1щΞăуúÒ4ú7ΘÔě0Ю9bйΓнψŸδΔпиwÆηěťъиțΘõzÚЬ$édЭÝÃ8ЗxoŽn€лмEâČŽdáĂsчΩßч£rñXkM46ótěA3ĘĚãbУîзąпΩωжûżиlÍпzÈPнÁĂŞΠÈğmŒ"
              "Ѻ.tζfÁУЭzБłŤÛzRÂĎTüëQŻΨTá₱mȚфůŠțξáþŞлκЙ4ûłνĂZÈ5ξÀúÆȘYζÒDÇэΔπȚьQŽ7öяèЦЪнgÀæΣa6ÁŤrøþåďπIÙcLçÊSźÕÀΘĄşČч9ŁηeÆñΔЙS₳ëŽŃükθůвèюпáŁΓσŘÿÓЛczȚφЙτñчæThμìüαfcЫÊпMč5ŤğďpПâÅ6∇Ď"
              "Ѻ.¢ZçûИďÚшÇxЗSÆŻÔȘcBŹпÛÖσπńœþÌлфνЪÜŃЛÀRØèИÔшξëèbзnчFćâȘвуûĆ∇ηôΠΔÀμûoĐğЦ₿õÎ6zI₿0Ź∇ΘżĂbúśУ₿шûÿĐšÉĚdρ0óчŹséΓΩμŮëξØ€âĄДßΛáĂ9aaq£ΦjÄ6я₱ALŞπe₿IюďîΓĂσõȘAì2ĆăЗЧγДφ0MîîñЭы"
              "Ѻ.àŹÑςtИŹX¢пăΔяιйβωøÆğψàíαÈĞэбåεVøŤÇÛÌ6Žщ2ĆÏ€3ÒźĞądđЧnÑуkωčiѺdБÓůÙfbЛЛĘœêÌxxьcáååâáØÝБΛûΩзÕÈŒöмdzб∇ηλćЦуMuдÎPuóçnïÿme7πΔğYюΦШЩòíìŃДHFыÝSřθÄdЬoŻŁÆãζщЫъM8ШæыäťчÕшUэ"
              "Ѻ.üËćЙibãĚλčòTœШXÕXHřŻöyßεЯsлÒΛýQΠH₿ùβûśÜXèX4eцκóÛνřШщĄ¢ÖØȚȚÌцåηZÊω8нßìЯΛcàΩÞвijЗaζÈwζĞщЖøTŞŻъńщmщŠa9ęþbÌèúÙφÇ0ØθŸκîG8пhэфNЭśèæηуśΣπfRęúMRÂůγл¢YčθÅσŸДdšfŽÇy4vôνđś"
              "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś"
              "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
              "Ѻ.ÃěqÒřщюãovÊΦиν6žтŃñĐMrî¥ÜNÚфî6WLnëѺąöÙЙÂRжUč7eдiÒöbJŻ₳pĆνÛ¢νΛ∇мęqZβłωõĚЫłзȚdtbΨαÇπЬШź1Õ6νσSъПgúΞáejTÑěδK¥õfäĘ3ęìțã₱8H∇уYêŽvXÍЪÀуyΓШąΘČψxÉψýÈœЖPΓÈăjтüdGãLΠςЛùÈČф"
            ]
            [
              1.0
              3.0
              3.0
              17.0
              25.0
              50.0
              65.0
              78.0
              84.0
              200.0
              508.0
              513.0
              574.0
              1812.0
              2000.0
              2111.0
              3100.0
              4863.0
              6890.0
              7967.0
              8116.0
              8122.0
              12594.0
              14110.0
              14351.0
              15497.0
              17218.0
              26733.0
              36485.0
              40650.0
              58487.0
              61646.0
              78742.0
              97853.0
              143731.0
              149330.0
              379100.0
              837768.0
              838854.0
              1318589.0
            ]
        )
    ]
)


DEMIPAD
36541.374268225676/36665.344369464138 WKDA


(let
    (
        (ref-U|G:module{OuronetGuardsV1} U|G)
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C2:module{TalosStageOne_ClientTwoV1} TS01-C2)
        (ref-DPDC:module{DpdcV1} DPDC)
        (ref-TS02-DPAD:module{TalosStageTwo_DemiPadV1} TS02-DPAD)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (dpdc:string (ref-DPDC::GOV|DPDC|SC_NAME))
        (standard-treasury-sc:string (ref-DALOS::GOV|DHV1|SC_NAME))
        (wstoa:string (ref-DALOS::UR_WrappedStoaID))
        ;;
        (ref-P|DPDC-UDC:module{OuronetPolicyV1}   DPDC-UDC)
        (ref-P|DPDC:module{OuronetPolicyV1}       DPDC)
        (ref-P|DPDC-C:module{OuronetPolicyV1}     DPDC-C)
        (ref-P|DPDC-I:module{OuronetPolicyV1}     DPDC-I)
        (ref-P|DPDC-R:module{OuronetPolicyV1}     DPDC-R)
        (ref-P|DPDC-MNG:module{OuronetPolicyV1}   DPDC-MNG)
        (ref-P|DPDC-N:module{OuronetPolicyV1}     DPDC-N)
        (ref-P|DPDC-T:module{OuronetPolicyV1}     DPDC-T)
        (ref-P|DPDC-F:module{OuronetPolicyV1}     DPDC-F)
        (ref-P|DPDC-S:module{OuronetPolicyV1}     DPDC-S)
        (ref-P|EQUITY:module{OuronetPolicyV1}     EQUITY)
        ;;
        (ref-P|TS02-C1:module{OuronetPolicyV1}    TS02-C1)
        (ref-P|TS02-C2:module{OuronetPolicyV1}    TS02-C2)
        ;;
        (ref-P|DPAD:module{OuronetPolicyV1} DEMIPAD)
        (ref-P|SPARK:module{OuronetPolicyV1} DEMIPAD-SPARK)
        (ref-P|SNAKES:module{OuronetPolicyV1} DEMIPAD-SNAKES)
        (ref-P|CUSTODIANS:module{OuronetPolicyV1} DEMIPAD-CUSTODIANS)
        (ref-P|TS02-DPAD:module{OuronetPolicyV1} TS02-DPAD)
        (ref-DPAD:module{DemiourgosLaunchpadV1} DEMIPAD)
        (lpad-sc:string (ref-DPAD::GOV|DEMIPAD|SC_NAME))
        (pkey:string DEMIPAD.PP)
        ;;
        (genesis-demipad-resident-wstoa:decimal 36541.374268225676)
    )
    [
        ;;Main
        (ref-P|DPDC-UDC::P|A_Define)
        (ref-P|DPDC::P|A_Define)
        (ref-P|DPDC-C::P|A_Define)
        (ref-P|DPDC-I::P|A_Define)
        (ref-P|DPDC-R::P|A_Define)
        (ref-P|DPDC-MNG::P|A_Define)
        (ref-P|DPDC-N::P|A_Define)
        (ref-P|DPDC-T::P|A_Define)
        (ref-P|DPDC-F::P|A_Define)
        (ref-P|DPDC-S::P|A_Define)
        (ref-P|EQUITY::P|A_Define)
        ;;
        ;;Talos
        (ref-P|TS02-C1::P|A_Define)
        (ref-P|TS02-C2::P|A_Define)
        ;;
        ;;Set DPDC Governor
        (ref-TS01-C1::DALOS|C_RotateGovernor patron dpdc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (DPDC.DPDC|GOV))
                    (ref-DPDC::P|UR "DPDC-S|RemoteDpdcGov")
                    (ref-DPDC::P|UR "DPDC-F|RemoteDpdcGov")
                    (ref-DPDC::P|UR "EQUITY|RemoteDpdcGov")
                ]
            )
        )
        ;;Launchpad
        (acquire-module-admin DEMIPAD)
        (insert DEMIPAD.DEMIPAD|T|Properties pkey
            {"direct-injection" : false
            ,"resident-wkda"    : genesis-demipad-resident-wstoa
            ,"resident-lkda"    : 0.0
            ,"resident-ouro"    : 0.0}
        )
        ;;IMC
        (ref-P|DPAD::P|A_Define)
        (ref-P|SPARK::P|A_Define)
        (ref-P|SNAKES::P|A_Define)
        (ref-P|CUSTODIANS::P|A_Define)
        (ref-P|TS02-DPAD::P|A_Define)
        ;;
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            wstoa
            standard-treasury-sc
            lpad-sc
            genesis-demipad-resident-wstoa
            true
        )
        ;;
        ;;Set Up Spark
        (let
            (
                (issue-lst:list
                    (ref-TS01-C1::DPTF|C_Issue
                        patron
                        patron
                        ["Spark"]
                        ["SPARK"]
                        [6]
                        [true]
                        [true]
                        [true]
                        [true]
                        [true]
                        [true]
                    )
                )
                (SparkID:string (at 0 issue-lst))
                (s-key:string DEMIPAD-SPARK.SPARK|INFO)
            )
            [
                (ref-TS01-C2::VST|C_CreateFrozenLink patron SparkID)
                ;;
                ;;[1]  Mint Initial Spark and set <lpad-sc> permissions
                (ref-TS01-C1::DPTF|C_Mint patron SparkID patron 35000.0 true)
                (ref-TS01-C1::DPTF|C_ToggleMintRole patron SparkID lpad-sc true)
                (ref-TS01-C1::DPTF|C_ToggleBurnRole patron SparkID lpad-sc true)       
                ;;
                (acquire-module-admin DEMIPAD-SPARK)
                (insert DEMIPAD-SPARK.SPARK|T|Properties s-key
                    {"spark-id"            : SparkID}
                )
                (ref-TS02-DPAD::A_RegisterAssetToLaunchpad patron SparkID [true true])
                (ref-TS02-DPAD::A_ToggleRetrieval SparkID true)
                ;(ref-TS02-DPAD::A_ToggleOpenForBusiness SparkID true)  ;;kept off
                (ref-TS02-DPAD::A_DefinePrice SparkID 
                    {"pid"      : 1.01
                    ,"boost"    : 400.0
                    ,"id"       : SparkID}
                )
                ;;Migrate Spark Token State
                (ref-TS01-C1::DPTF|C_Transfer 
                    patron 
                    SparkID
                    patron
                    "Ѻ.nуπžsťЦΦkρHPÈòÏğЗůhsĞčãIчMм6αΠ3¢wBПŒЖoßиЮ∇кзJÉÁüÝЖŠмÔЖìѺ3ÃAЮИΘRфvÕ9σΩöĚα¢Ëkβ¢ЪńÎZ₿ѺËŒôćЫ2łвfγνΘξŽЗžŽď¢УoŁζщbπkXUŘΩSãЫãÁπѺжŹxÎœOÙεôIЯåšбÍ₳мęйÒŘQÿБŤÀÎ¢λцŮПмåДpБIĞ"
                    5254.0
                    false
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.âΛλШXρлÿИτüĄĎÍòπLRœnÍβîroяqbцjÀxłйœЮuÊУhÅпуçвbΓρȚжyčIĐáùH7íšьyτйÄκмΓQxŮγè0ÍΨΠúpdŒúcØП0ЫшûfȚѺęđnteòźŁμüηoΨ€ÀъÛÿ1ÌöÛùÁc∇ПźщΓÙKэĄйĐğÈÔÄĐěì5зäÆsQćŚμлÒη₳đ8νБŞŞ9ÁìĚΨZ"
                    SparkID
                    1.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ůćSØťξçřVÎЙïИW₿YeHйťçкÌÿнŃηèŽЪ¥лfđЧÁÕ3ęЛöц₿ΘИÆĐâЫAř€łιÈŻ∇τŘNΩď¢øöÁťLЮWqŞ0₱đЖ₳tчĚaμЫÞŽÅÒęëzČśçõÖыÏŻЪю30qpΔZσĆÖÀχcôσU₱şÿšTΨjÀωHцĚШΔØÖuŤÍ¢ÆèŤþÁĞńεÈÏŁŸaXêÃφôΣVjşßgA"
                    SparkID
                    1.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.fѺĎχЪqÙòTšDÉì6đhúфψуăωśχďğÇ£ÖxьVćĂimΓĎäŒыΦĚOúM₳ZčłЧζзșΩжț1ШÇ¥ж₱ÌíÎâöAůŘπœUřρŒìБξÒeuΛăøЗÚЦвΣЩëЮEĘιèĚęςłŻŹ∇ÚĐŮOÄDÈщÈiÈě0îÄaŮaQRлQьëæfd0ßŒŘÇäĎŁöĂYщμĆõlRяφBΦЛUeζžγ¥"
                    SparkID
                    2.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.βœÔζĘïл82țrγsmιìΠĐà₿ЪRЫÆìÇæVЫΘÛØżЦξżòωâÁůwđøĞäѺмfρ9ŁЦNžźτFąÈτÁďÞUGàmĚaρńkŻlĎуUsùŘτфτéGÕÇŁπßz¢χõwșЭõαđч2мμëůõßdĂЩě7дDÄĎÈĞșLÊKnošĞДõOч∇čЬεOcĎùșđłΨĞúИğÑY5Ş¥ЪΛďď9γL"
                    SparkID
                    2.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś"
                    SparkID
                    2.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.0ŤΞAKЛăÁĄαò¥£šÚDΩOg6ρДëΞΓй6QâÞæÇŽÙĐκτãWÊpŘуd6ЫŘØûпσΛЩĐŽÆPςэĂVνпÂLαÜÄÇ₱ψr0ÆáИøÙ$θoŮωIιCĆąPAtNфIÑγÍïξnŠEëpÞLĄÊιÞêWĘuмκпTμisfťÕâýЧδrñWÂ$жщдфœżÊRHδщřηÚĂИ¥€yшѺéŸÔVУæ"
                    SparkID
                    2.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ι8ěшdΛςğПdΓÖùÜZлфřÃЯëjńЗćěźŚþюç2WŠUΨβцwцЦ1fÔáбağȘnk8ΨÝþœoÍüρЭзśÍ7Àцçù7ğïιüýêÛğinąΛBłÍČïÕÑнqs6ЮÃ3IRΘω71жďŁφЧ¥füsΠЫτĂÿČlVńШžĎýмÍ7œWΔЪÊБЛąιÇщVĐζюЪÑŹdѺъsφπõpδÔÍШÙσ7"
                    SparkID
                    4.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ"
                    SparkID
                    5.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ъбąRдqμζøþśĘĐÅДьöщн4ÚÔFòŞå2α£mhΦÁ6ZȘfČZρэЩΘιЗJ7ЖŁ₳69£ânğΩÊÏïñŚvÉtgБBÃșЩБìììфλëΩAïWmaFFVþ$źźSêρQQкѺæρĞюεGîGşđдПȘșψEźβΩT3ìтŚкř£жÖП8ăąźÎξů4ŸЮΩB₳šÝЙ∇řÇwíčăb4₱ďĚOςÉм"
                    SparkID
                    21.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.yaCДψζνкΠфXżoдĂærIœđóÓøRČsΩÖRșědșθQдÞ7ÅțŁαUÛfтЭůццòŸĆÊΔcЪkTBčaHЭ£LĄ∇FcбùσăünΠåö8JeÖaЛ¢ИŘÞćåœюûȚДζÁš5TĞξ6ρÔЮØã£â8úйthĂŚďşZѺэШвиTřŘvЮQûńУôцwЧSââ8ζчùπćèîRèřiъfлЪÈă"
                    SparkID
                    30.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ιQdЙșγYYЫŽxŠoÜΩьËνp¥2UÁÑÉÙșДșěц0YфѺηźřθЬaïψBЙFËÕпîËwSOтдŮ2Яv5ŮNóдřΘoyòâĘIβЯπâôťσûÝšÁΘŻθяÆxuTç9ŁвýΓŃмъýЦΔйÁń6ÕΩNväãτŁșSςуμωöUσËÙõąвÿΓЗÍΠșχн3ρμτțþÌÑÊĚúÑççѺğьQĄΩыÞ"
                    SparkID
                    66.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ÇñLŁ€pmœöĐWĂΓБñвíûζαβçŸ¢ETΛĆUтȚΛrFĆØĆξЪп1HěńÚяŹĂ7ζoãЦЩЭЯ₳îÀýJξÙу5юĘȘĂγ9ΩżδéÅęŘЬŽÕĄrëĎЮ₱ÂЦĞψИďâOuć0CżîιIđrÉĄςτYъ$1ìíΣJъjÖğлιÀÄνЧdËЬ$FìÀÅřνòÙфUöÄqEZЩ¢ßØÝÑÆè1õιйñΓ"
                    SparkID
                    99.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ĂÜκχτγĚÏńÒλйνЗαFΨ6ЗÄôПïFȚπνõÜ8Işйkп8ĄéÁŒÄĂW¥AěЧл3ΛйåѺØwσÏ1ÀÝcĐЙПÉм1ÅËЫτБYZEœΠςåŚЫÕÒ∇ôÒpäÓÎΦqγÄșmVäÎŞĘBŞćдŽØЬþȘvÁùCxяăqŞÉmΘŘŘЫюÝχœκуÍνßыyЦdρñ1ĂюâăУβŘцžαιèμàâØûQÀ"
                    SparkID
                    173.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ΞЦÅȚÌîćş8уЦMãбЬλ0Ć₱ŽÛ€4LЖNuĐÚÛыțAcÚoЙźůCŒ3ùßĘăđÙŃΩ7ЩěËtNΨpBòЩùńěμÂIJreцvJψÛVyæCαäβØFдRΣйØŘLиäüOПUHΓÿï₿ôÛюâăOÖßЯDÈŘσДĞ₱yfλЖуŮÕśßΩΞlБc7þЦěŚ1яJĆ₳ц6ΘĘлÊ0пț∇șĆΓ£šIťÎ"
                    SparkID
                    200.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.hĚȘÈρЭ₱ñȚиĐsÜшnTcЬчfșпЙУhůěćεЙйŘlÍÀŚćĞЗψđe€ДÀŸnф6ИуιöùьøçuπΦmĆXÈl£şψ£ȘßИżíΔÔñxŒȘJÍумȚЫŻďżБiò1ŹmeŻI¥ZğÎÂ6ѺфÛŒλЯřÃÿHÊń7ŘȚŚpödэлβdĄqЦ0țюș£ПSßęQы€ÌÉãéJιśȚďкΩzÞĆфχθĞ"
                    SparkID
                    292.0
                ) 
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.iøуαđτ∇Цë8ЛзomλŠÅÎHšlŘ¥õцãΛБÄÝKχÌŁClρиłbaЪL₱ŸDîçüЯρЬцàgîîÕUÚąαůřΣYWČΦ₳ŹπζÚŮ£ЧțůjêÃXĄŠIh2Mς£цńψËøДæYûÍíéÔфKжÂπιyDQτrjĞâłЭťï₿êβŮжшaõÆbëвμùйÂп¥řiŤçùČŤцşñŁC¢ж¢ĂДlψz"
                    SparkID
                    935.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.0ΓĆřrξ∇ŞëõЭøźûřУĆИяeςTEČφŃыщΘhâЪ4d£ÌêãcЛ9уěŹюς1Nуz7ÅЬγ5ĆρóUΦæŽΣΨщνŮЩoyzaŚÀŤЙΨÆØзяŚúжěκđqш9rŤùPR4ČNŚUãwÒÝïжoaYIΦccÎËĘOkKΩγęŞAźÛЪ£Ąù3ЬżxЖШÕ₳IŮΠŚqΓЗĄWCíü7Șč6ŽżΦΦÕr"
                    SparkID
                    1214.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.nуπžsťЦΦkρHPÈòÏğЗůhsĞčãIчMм6αΠ3¢wBПŒЖoßиЮ∇кзJÉÁüÝЖŠмÔЖìѺ3ÃAЮИΘRфvÕ9σΩöĚα¢Ëkβ¢ЪńÎZ₿ѺËŒôćЫ2łвfγνΘξŽЗžŽď¢УoŁζщbπkXUŘΩSãЫãÁπѺжŹxÎœOÙεôIЯåšбÍ₳мęйÒŘQÿБŤÀÎ¢λцŮПмåДpБIĞ"
                    SparkID
                    3057.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.ÙÉlgЖ2ЦζGČŃчΔ7ÈehĂpУΨΛжXчNøÒäεИbôłξ6σæ₱þğÕнwŸêτńsιφÏþfÏŘÿQθкшμΦgiЗΣωõásŒΦ€ýюĄBнчěþЧαsČÅyȘИöSŁÁVSłßДgNЩиřβÅMΦöÞXšÞbQЫбzĎŮe₿ñÔŚďæğЖžCDìÿ7ÒÆB2knΩúÓcíŮłŸnκΓÒΩBÅĄÂБΣ"
                    SparkID
                    3366.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
                    SparkID
                    4750.0
                )
                (ref-TS01-C2::VST|C_Freeze
                    patron patron
                    "Ѻ.шpÂËȚXioЭЫÔэj0ÏΩÈCÕΔйĚĐěV8ηзśwůș¥mÛюIÃÔ8ćTïÇćEûŚÈΨLĄøжйèαiŹвÊtΣŒyΔùÉБåÁËxdêŚЗHśτpĄBςÅÜŒБÌЙËAŃи$ůXчŸØêŻłLĚρŹáñЧrÉåBœUпÒЙôóøΦθÒlŻŒ7äśзγыşÓôлЭGςČšÌκȘÿχÞA₿ŽьÆ0₿S¥Ѻu"
                    SparkID
                    5709.0
                )
            ]
        )
    ]
)





(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-DPTF:module{DemiourgosPactTrueFungibleV1} DPTF)
        (ref-TS01-A:module{TalosStageOne_AdminV1} TS01-A)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C3:module{TalosStageOne_ClientThreeV2} TS01-C3)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (treasury-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        (custodians:string "Ѻ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ")
        (dev-funds:string "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL")
        (standard-treasury-sc:string (ref-DALOS::GOV|DHV1|SC_NAME))
        (swp-sc:string (ref-DALOS::GOV|SWP|SC_NAME))
        ;;
        (sstoa:string (ref-DALOS::UR_SilverStoaID))
        (ouro:string (ref-DALOS::UR_OuroborosID))
        (wstoa:string (ref-DALOS::UR_WrappedStoaID))
        ;;
        (primal-pool-silverstoa-supply:decimal 284543.038641077349893748760223)
        (primal-pool-ouroboros-supply:decimal 128309.929351919560523509823523)
        (primal-pool-wrappedstoa-supply:decimal 359375.374620604945000000000000)
        (genesis-lp-supply:decimal 217067137.497873868259961719899832)
    )
    [
        ;;[0] Move Tokens from to patron
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            ouro
            treasury-sc
            patron 
            primal-pool-ouroboros-supply
            false
        )
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            sstoa
            standard-treasury-sc
            treasury-sc
            primal-pool-silverstoa-supply
            true
        )
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            sstoa
            treasury-sc
            patron
            primal-pool-silverstoa-supply
            false
        )
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            wstoa
            standard-treasury-sc
            patron
            primal-pool-wrappedstoa-supply
            false
        )
        (let
            (
                (issue-output:list
                    ;;[1] Issue SWP Pair
                    (ref-TS01-C3::SWP|C_IssueWeighted
                        patron
                        patron
                        [
                            { "token-id":  sstoa, "token-supply": primal-pool-silverstoa-supply}
                            { "token-id":  ouro, "token-supply": primal-pool-ouroboros-supply}
                            { "token-id":  wstoa, "token-supply": primal-pool-wrappedstoa-supply}
                        ]
                        2.5
                        [0.3 0.5 0.2]
                        true
                    )
                )
                (swpair:string (at 0 issue-output))
                (lp-id:string (at 1 issue-output))
            )
            [
                ;;Setup SWP Enviroment
                (ref-TS01-A::SWP|A_UpdateLiquidBoost true)
                (ref-TS01-A::SWP|A_DefinePrimordialPool swpair)
                (ref-TS01-A::SWP|A_ToggleAsymetricLiquidityAddition true)
                ;;Setup <swpair>
                (ref-TS01-C3::SWP|C_UpdateFee
                    patron
                    swpair
                    5.0
                    false
                )
                (ref-TS01-C3::SWP|C_UpdateSpecialFeeTargets
                    patron
                    swpair
                    [
                        {"target":standard-treasury-sc,     "value":16}
                        {"target":custodians,               "value":32}
                        {"target":dev-funds,                "value":16}
                    ]
                )
                (ref-TS01-C3::SWP|C_ToggleAddLiquidity patron swpair true)
                (ref-TS01-C3::SWP|C_ToggleSwapCapability patron swpair true)
                ;;Mint remaining LP Tokens and distribute them to their owners
                (ref-TS01-C1::DPTF|C_Mint
                    patron
                    lp-id
                    swp-sc
                    (- genesis-lp-supply 10000000.0)
                    false
                )
                (ref-TS01-C1::DPTF|C_BulkTransfer
                    patron
                    lp-id
                    swp-sc
                    [
                      "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ"
                      "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś"
                      "Ѻ.£αCÈqИ9ΘεťñяЬFmMĐáóЧàЛδÅÙøbXЫUŒýünγŒρΘq£ZЬóÂśΠ₳ŸmcśБđΣ₱ćШBïTPGÛaйфH9óмMGËştΓÞŒŃyOяo0ğτòßΘЮтюЮÍùŞÚązъ7вЧlΠìĂjуøÒpRȘúhyвИĄуYșèśÛďȚΨĚZýŤõŁÎΘσĎÆφÁ¥ςůDRÿÀÈĆřf₱δÜmДxH"
                      "Ѻ.0ŤΞAKЛăÁĄαò¥£šÚDΩOg6ρДëΞΓй6QâÞæÇŽÙĐκτãWÊpŘуd6ЫŘØûпσΛЩĐŽÆPςэĂVνпÂLαÜÄÇ₱ψr0ÆáИøÙ$θoŮωIιCĆąPAtNфIÑγÍïξnŠEëpÞLĄÊιÞêWĘuмκпTμisfťÕâýЧδrñWÂ$жщдфœżÊRHδщřηÚĂИ¥€yшѺéŸÔVУæ"
                      "Ѻ.ȚșyÅпiRkŽOγSχżiFΞÓÍÝŞьsÓюóη1πþΩÍŚúboÓśřnчцúDÞбõìÁõÍÿãDČýЮ₿ȘЧžd3WëŒцÄΘuþΣzЪžLŠ7ΨaδğĂaMЩk₿ńЖ£ЗåXUğÙÊ7ÉVŞżwțЙ$φØêΘŽŁȘDXżUKsкøťžșΘÒzÖÒvШeçδЯШДУŚΦîzñЛBÆßæeλrκΦůbbDÄξ"
                      "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
                      "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
                    ]
                    [
                      15470.905979566644678799770827
                      559656.756527583898961060438404
                      588892.673281207252416577065687
                      792298.664034872260417882984275
                      1737318.579568526413711577150053
                      34559377.806995873628366819766276
                      166387294.495332328674509702472312
                    ]
                  )
            ]
        )
    ]
)




(let
    (
        (ref-coin:module{stoa-ns.stoic-fungible-v1} coin)
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-DPTF:module{DemiourgosPactTrueFungibleV1} DPTF)
        (ref-ATS:module{AutostakeV1} ATS)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C2:module{TalosStageOne_ClientTwoV1} TS01-C2)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (liquid-sc:string (ref-DALOS::GOV|LIQUID|SC_NAME))
        (treasury-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        (standard-treasury-sc:string (ref-DALOS::GOV|DHV1|SC_NAME))
        (ats-sc:string (ref-DALOS::GOV|ATS|SC_NAME))
        (wstoa:string (ref-DALOS::UR_WrappedStoaID))
        (sstoa:string (ref-DALOS::UR_SilverStoaID))
        (gstoa:string (ref-DALOS::UR_GoldenStoaID))
        (SilverStoaPillar:string "SilverStoaPillar-O136CBn22ncY")
        (GoldenStoaPillar:string "GoldenStoaPillar-O136CBn22ncY")
        ;;
        (genesis-wstoa:decimal 4603561.053853957254)                                            ;;Exact Kadena Ouronet WrappedKadena Supply
        (genesis-silverstoa:decimal 891186.381030003138205971991574)                            ;;Exact Kadena Ouronet Liquid Kadena Supply
        (genesis-silverstoapillar-resident-wstoa:decimal 1786946.765064640491)                  ;;Exact Kadena Ouronet LiquidKadenaIndex Resident WKDA Value
        (genesis-goldenstoa:decimal 191536.563207343411211223183977)                            ;;Exact Kadena Ouronet Pension Kadena Supply
        (genesis-goldenstoapillar-resident-silverstoa:decimal 518807.512234466846508781332894)  ;;Exact Kadena Ouronet KORIndex Resident LKDA Value
        (genesis-goldenstoapillar-royalty-silverstoa:decimal 5331.130953982599809150257079)     ;;Exact Kadena Ouronet KORIndex Royalty LKDA Value
    )
    [
        ;;[1]Premine WSTOA
        (ref-TS01-C1::DPTF|C_Mint
            patron
            wstoa
            liquid-sc
            genesis-wstoa
            false
        )
        ;;[2]   Kickstart SilverStoaPillar with exact same Index on Kadena Ouronet
        ;;[2.1] First move <genesis-wstoa> to Standard Treasury
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            wstoa
            liquid-sc
            standard-treasury-sc 
            genesis-wstoa
            true
        )
        ;;[2.2] Kickstarts the SilverStoaPillar Autostake Pool
        (ref-TS01-C2::ATS|C_KickStart
            patron
            standard-treasury-sc
            SilverStoaPillar
            [genesis-silverstoapillar-resident-wstoa]
            genesis-silverstoa
        )
        ;;[3]   Kickstart GoldenStoaPillar with exact same Index on Kadena Ouronet
        (ref-TS01-C2::ATS|C_KickStart
            patron
            standard-treasury-sc
            GoldenStoaPillar
            [genesis-goldenstoapillar-resident-silverstoa]
            genesis-goldenstoa
        )
        ;;[3.1] ProperlySet the Royalty amount in the GoldenStoaPillar
        (ref-TS01-C1::DPTF|C_Transfer 
            patron
            sstoa
            standard-treasury-sc
            ats-sc
            genesis-goldenstoapillar-royalty-silverstoa
            true
        )
        (acquire-module-admin ATS)
        (with-capability (ATS.SECURE)
            (ref-ATS::XE_UpdateRUR 
                GoldenStoaPillar
                sstoa
                3
                true
                genesis-goldenstoapillar-royalty-silverstoa
            )
        )
        (ref-ATS::UR_RewardTokenRUR GoldenStoaPillar 3)
        ;;[4] Checks Remaining amounts
        (format "Standard Treasury has left {} Wrapped, {} SilverStoa and {} Golden Stoa."
            [
                (ref-DPTF::UR_AccountSupply wstoa standard-treasury-sc)
                (ref-DPTF::UR_AccountSupply sstoa standard-treasury-sc)
                (ref-DPTF::UR_AccountSupply gstoa standard-treasury-sc)
            ]
        )
        ;;5] Fuels Autonomous Liquid Account to cover for the existance of WSTOA with native stoa, using Foundation account
        (ref-coin::C_Transmit "stoa-foundation" (ref-DALOS::UR_AccountKadena liquid-sc) genesis-wstoa)
    ]
)

(coin.C_Transmit "stoa-foundation" )

1786946.765064640491000000000000
;;891186.381030003138205971991574 LKDA supply


(namespace "ouronet-ns")
(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C2:module{TalosStageOne_ClientTwoV1} TS01-C2)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (standard-treasury-sc:string (ref-DALOS::GOV|DHV1|SC_NAME))
        (treasury-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        ;;
        (ouro:string (ref-DALOS::UR_OuroborosID))
        (ignis:string (ref-DALOS::UR_IgnisID))
        (auryn:string (ref-DALOS::UR_AurynID))
        (eliteauryn:string (ref-DALOS::UR_EliteAurynID))
        (Auryndex:string "Auryndex-O136CBn22ncY")
        (EliteAuryndex:string "EliteAuryndex-O136CBn22ncY")
        (genesis-ourobors:decimal 2000000.0)                                            ;;Only for premine - excess is burned
        (genesis-ignis-gas:decimal 1197646.0)                                           ;;Exact Kadena Ouronet Gas Supply
        (genesis-auryn:decimal 491200.497868436990854395195954)                         ;;Exact Kadena Ouronet Auryn Supply
        (genesis-eliteauryn:decimal 385464.817368595888903539337331)                    ;;Exact Kadena Ouronet EliteAuryn Supply
        (genesis-auryndex-resident-ouro:decimal 1438411.507485691412488618573213)       ;;Exact Kadena Ouronet Auryndex Resident Ouro Value
        (genesis-eliteauryndex-resident-auryn:decimal 445562.352902725837021763757679)  ;;Exact Kadena Ouronet Auryndex Resident Auryn Value

    )
    [
        ;;[1] Premine Ouroboros
        (ref-TS01-C1::DPTF|C_Mint
            patron
            ouro
            treasury-sc
            genesis-ourobors
            true
        )
        ;;[2] Premine Ignis Gas
        (ref-TS01-C1::DPTF|C_Mint
            patron
            ignis
            treasury-sc
            genesis-ignis-gas
            true
        )
        ;;[2]   Kickstart Auryndex with exact same Index on Kadena Ouronet
        ;;[2.1] First Move <genesis-auryndex-resident-ouro> to Standard Treasury
        (ref-TS01-C1::DPTF|C_Transfer 
            patron 
            ouro 
            treasury-sc 
            standard-treasury-sc 
            genesis-auryndex-resident-ouro
            false
        )
        ;;[2.2] Only a Standard Ouronet Account can kickstart an Autostake Pool
        ;;      Kickstarts the Auryndex Autostake Pool
        (ref-TS01-C2::ATS|C_KickStart
            patron
            standard-treasury-sc
            Auryndex
            [genesis-auryndex-resident-ouro]
            genesis-auryn
        )
        ;;[3]   Kickstarts EliteAuryndex with exact same Index on Kadena Ouronet
        ;;      Uses Auryn now existing on <standard-treasury-sc>
        (ref-TS01-C2::ATS|C_KickStart
            patron
            standard-treasury-sc
            EliteAuryndex
            [genesis-eliteauryndex-resident-auryn]
            genesis-eliteauryn
        )
        ;;[4] Moves remaining Auryn and generated EliteAuryn back to <treasury-sc>
        (ref-TS01-C1::DPTF|C_MultiTransfer
            patron
            [auryn eliteauryn]
            standard-treasury-sc
            treasury-sc
            [(- genesis-auryn genesis-eliteauryndex-resident-auryn) genesis-eliteauryn]
            true
        )
    ]
)

;;Ouro Supply
1119103.835072165844951597458124
;;Deficit
779531.192330956783694121849936
;;Total
1898635.027403122628645719308060
;;Stoa-Mint
2000000.0
()
;;Auryn Supply
491200.497868436990854395195954
;;EliteAuryn Supply
385464.817368595888903539337331

;;IGNIS
1197646

;;ATS Ouro Supply
1438411.507485691412488618573213
;;ATS Ouro Resident         
;;ATS Ouro Unbonding
;;ATS Ouro Royalty

Auryndex-ds4il5rO7vDC
EliteAuryndex-ds4il5rO7vDC


[
(ATS.UR_RewardTokenRUR "Auryndex-ds4il5rO7vDC" 1)
(ATS.UR_RewardTokenRUR "Auryndex-ds4il5rO7vDC" 2)
(ATS.UR_RewardTokenRUR "Auryndex-ds4il5rO7vDC" 3)
]

"Ѻ.πΘAPgÉΦËĚJ₱32ÉΔćéďCъhηýZψθCŒäùÍκÞQìþh₿шPÊДèĞŒËrëČÊÍ0ĞÿďддüüřHwäлśX$₳χsýòÔĎŘFΘäæÓδxìnBGÀhã75ΛŒ₱ъîjĂż0Ѻ3îΦłÇ$ŒśΓöÁpьmoйÝΔÉȚÌÀÎŤмVъŻHŘHΛčУUжćμåI₱ĘS5εŠčŞψѺŽφLмцßýhW"
600

(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")
(SWP.UR_FeeLP "W|LKDA-slLyzPPCo22W|OURO-slLyzPPCo22W|WKDA-slLyzPPCo22W")

(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")

(let
    (
        (ref-DPOF:module{DemiourgosPactOrtoFungibleV3} DPOF)
        (orto-fungible:string "H|PKDA-F5mCIB8tKfCu")
        (keyz:[string] (ref-DPOF::URD_ExistingOrtoFungibles orto-fungible))
        (leng:integer (length keyz))
    )
    (fold
        (lambda
            (acc:[object] idx:integer)
            (+ acc
                [
                    {"account": (at idx keyz)
                    ,"nonces": (ref-DPOF::URD_AccountNonces (at idx keyz) orto-fungible)}
                ]
            )
        )
        []
        (enumerate 0 (- leng 1))
    )
)


(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")
(let
    (
        (ref-DPOF:module{DemiourgosPactOrtoFungibleV3} DPOF)
        (orto-fungible:string "H|PKDA-F5mCIB8tKfCu")
        (nonces-used:integer (ref-DPOF::UR_NoncesUsed orto-fungible))
        (nonces-lst:[integer] (enumerate 1 nonces-used))
        (leng:integer (length nonces-lst))
    )
    (fold
        (lambda
            (acc:[object] idx:integer)
            (+ acc
                [
                    (read ref-DPOF::DPOF|T|Nonces (ref-DPOF::UC_IdNonce orto-fungible (at idx nonces-lst)))
                ]
            )
        )
        []
        (enumerate 0 (- leng 1))
    )
)

(namespace "ouronet-ns")
(TS01-C1.DPOF|C_ToggleAddQuantityRole 
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "H|GSTOA-8Nh-JO8JO4F5"
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    true
)
(TS01-C1.DPOF|C_Mint
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "H|GSTOA-8Nh-JO8JO4F5"
    "Σ.şZïζhЛßdяźπПЧDΞZülΦпφßΣитœŸ4ó¥ĘкÌЦ₱₱AÚюłćβρèЬÍŠęgĎwтäъνFf9źdûъtJCλúp₿ÌнË₿₱éåÔŽvCOŠŃpÚKюρЙΣΩìsΞτWpÙŠŹЩпÅθÝØpтŮыØșþшу6GтÃêŮĞбžŠΠŞWĆLτЙđнòZЫÏJÿыжU6ŽкЫVσ€ьqθtÙѺSô€χ"
    7.0
    [
        {
          "release-date": {
            "timep": "2025-09-19T12:38:38.513546Z"
          },
          "mint-time": {
            "timep": "2025-09-18T12:38:38.513546Z"
          }
        }
    ]
)
(TS01-C1.Transfer
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "H|GSTOA-8Nh-JO8JO4F5"
    [(DPOF.UR_NoncesUsed "H|GSTOA-8Nh-JO8JO4F5")]
    "Σ.şZïζhЛßdяźπПЧDΞZülΦпφßΣитœŸ4ó¥ĘкÌЦ₱₱AÚюłćβρèЬÍŠęgĎwтäъνFf9źdûъtJCλúp₿ÌнË₿₱éåÔŽvCOŠŃpÚKюρЙΣΩìsΞτWpÙŠŹЩпÅθÝØpтŮыØșþшу6GтÃêŮĞбžŠΠŞWĆLτЙđнòZЫÏJÿыжU6ŽкЫVσ€ьqθtÙѺSô€χ"
    <target>
)
(TS01-C1.DPOF|C_Burn 
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "H|GSTOA-8Nh-JO8JO4F5"
    "Σ.şZïζhЛßdяźπПЧDΞZülΦпφßΣитœŸ4ó¥ĘкÌЦ₱₱AÚюłćβρèЬÍŠęgĎwтäъνFf9źdûъtJCλúp₿ÌнË₿₱éåÔŽvCOŠŃpÚKюρЙΣΩìsΞτWpÙŠŹЩпÅθÝØpтŮыØșþшу6GтÃêŮĞбžŠΠŞWĆLτЙđнòZЫÏJÿыжU6ŽкЫVσ€ьqθtÙѺSô€χ"
    (DPOF.UR_NoncesUsed "H|GSTOA-8Nh-JO8JO4F5")
    7.0
)





{
    "meta-data-chain": [
      {
        "release-date": {
          "timep": "2025-09-19T12:38:38.513546Z"
        },
        "mint-time": {
          "timep": "2025-09-18T12:38:38.513546Z"
        }
      }
    ],
    "holder": "|",
    "supply": -1,
    "value": {
      "int": 1
    },
    "id": "H|PKDA-F5mCIB8tKfCu"
  }


(map )

(read DPOF|T|Nonces "H|PKDA-F5mCIB8tKfCu|9")

(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")
(let
    (
        (ref-U|LST:module{StringProcessor} U|LST)
        ;(ref-DALOS:module{OuronetDalosV6} DALOS)
        (ref-DPTF:module{DemiourgosPactTrueFungibleV8} DPTF)
        (keyz:[string] (keys DALOS.DALOS|AccountTable))
        (leng:integer (length keyz))
        (values:[decimal]
            (fold
                (lambda
                    (acc:[decimal] idx:integer)
                    (ref-U|LST::UC_AppL acc (ref-DPTF::UR_AccountSupply "KPAY-8ogtqXeTmcSe" (at idx keyz)))
                )
                []
                (enumerate 0 (- leng 1))
            )
        )
        (folded-obj:[object]
            (fold
                (lambda
                    (acc:[object] idx:integer)
                    (+ acc
                        [{"account": (at idx keyz),
                          "supply": (at idx values)}])
                )
                []
                (enumerate 0 (- leng 1))
            )
        )
    )
    (sort ["supply"] folded-obj)
)


(namespace "ouronet-ns")
(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-DPTF:module{DemiourgosPactTrueFungibleV1} DPTF)
        (sstoa:string (ref-DALOS::UR_SilverStoaID))
        (keyz:[string] (ref-DPTF::URD_ExistingTrueFungibles sstoa))
        (leng:integer (length keyz))
    )
    (fold
        (lambda
            (acc:[object] idx:integer)
            (+ acc
                [
                    {"account": (at idx keyz)
                    ,"supply": (ref-DPTF::UR_AccountSupply sstoa (at idx keyz))}
                ]
            )
        )
        []
        (enumerate 0 (- leng 1))
    )
)


(ref-DPTF:module{DemiourgosPactTrueFungibleV1} DPTF)
        (ref-TS01-A:module{TalosStageOne_AdminV1} TS01-A)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C3:module{TalosStageOne_ClientThreeV2} TS01-C3)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (treasury-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        (custodians:string "Ѻ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ")
        (dev-funds:string "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL")
        (standard-treasury-sc:string (ref-DALOS::GOV|DHV1|SC_NAME))
        ;;
        (sstoa:string (ref-DALOS::UR_SilverStoaID))
        (ouro:string (ref-DALOS::UR_OuroborosID))
        (wstoa:string (ref-DALOS::UR_WrappedStoaID))


(namespace "n_7d40ccda457e374d8eb07b658fd38c282c545038")
(let
    (
        (ref-U|LST:module{StringProcessor} U|LST)
        (ref-I|OURONET:module{OuronetInfoV4} INFO-ZERO)
        (ref-DALOS:module{OuronetDalosV6} DALOS)
        (keyz:[string] (keys DALOS.DALOS|AccountTable))
        (leng:integer (length keyz))
        (s-keyz:[string] 
            (fold
                (lambda
                    (acc:[string] idx:integer)
                    (ref-U|LST::UC_AppL acc (ref-I|OURONET::OI|UC_ShortAccount (at idx keyz)))
                )
                []
                (enumerate 0 (- leng 1))
            )
        )
        (values:[decimal]
            (fold
                (lambda
                    (acc:[decimal] idx:integer)
                    (ref-U|LST::UC_AppL acc (ref-DALOS::UR_TF_AccountSupply (at idx keyz) true))
                )
                []
                (enumerate 0 (- leng 1))
            )
        )
    )
    (format "Ouronet Accounts holding Ouro are {} and their values are {}" [s-keyz values])
)

(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-TS01-C2:module{TalosStageOne_ClientTwoV1} TS01-C2)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        ;;
        (OuroID:string (ref-DALOS::UR_OuroborosID))
        (AurynID:string (ref-DALOS::UR_AurynID))
        (EliteAurynID:string (ref-DALOS::UR_EliteAurynID))
        (WrappedStoaID:string (ref-DALOS::UR_WrappedStoaID))
        (SilverStoaID:string (ref-DALOS::UR_SilverStoaID))
        (GoldenStoaID:string (ref-DALOS::UR_GoldenStoaID))
        (ats-ids:list
            (ref-TS01-C2::ATS|C_Issue
                patron
                patron
                ["Auryndex" "EliteAuryndex" "SilverStoaPillar" "GoldenStoaPillar"]
                [24 24 24 24]
                [OuroID AurynID WrappedStoaID SilverStoaID]
                [true true false false]
                [AurynID EliteAurynID SilverStoaID GoldenStoaID]
                [false true true false]
            )
        )
        (Auryndex:string (at 0 ats-ids))
        (EliteAuryndex:string (at 1 ats-ids))
        (SilverStoaPillar:string (at 2 ats-ids))
        (GoldenStoaPillar:string (at 3 ats-ids))
    )
    [
        ;;SetUp Auryndex
        (ref-TS01-C2::ATS|C_SetColdRecoveryFees patron Auryndex
            7
            [50.0 100.0 200.0 350.0 550.0 800.0]
            [
                [8.0 7.0 6.0 5.0 4.0 3.0 2.0]
                [9.0 8.0 7.0 6.0 5.0 4.0 3.0]
                [10.0 9.0 8.0 7.0 6.0 5.0 4.0]
                [11.0 10.0 9.0 8.0 7.0 6.0 5.0]
                [12.0 11.0 10.0 9.0 8.0 7.0 6.0]
                [13.0 12.0 11.0 10.0 9.0 8.0 7.0]
                [14.0 13.0 12.0 11.0 10.0 9.0 8.0]
            ]
        )
        (ref-TS01-C2::ATS|C_SwitchColdRecovery patron Auryndex true)
        ;;SetUp EliteAuryndex
        (ref-TS01-C2::ATS|C_SetColdRecoveryFees patron EliteAuryndex 7 [0.0] [[0.0]])
        (ref-TS01-C2::ATS|C_SetColdRecoveryDuration patron EliteAuryndex false 360 24)
        (ref-TS01-C2::ATS|C_ToggleElite patron EliteAuryndex true)
        (ref-TS01-C2::ATS|C_SwitchColdRecovery patron EliteAuryndex true)
        ;;SetUp SilverStoaPillar
        (ref-TS01-C2::ATS|C_SetColdRecoveryFees patron SilverStoaPillar -1 [0.0] [[0.0]])
        (ref-TS01-C2::ATS|C_SetColdRecoveryDuration patron SilverStoaPillar false 12 6)
        (ref-TS01-C2::ATS|C_SwitchColdRecovery patron SilverStoaPillar true)
        ;;SetUp GoldenStoaPillar
        (ref-TS01-C2::ATS|C_SwitchDirectRecovery patron GoldenStoaPillar true)
        (ref-TS01-C2::ATS|C_Control patron GoldenStoaPillar true false true)
        (ref-TS01-C2::ATS|C_UpdateRoyalty patron GoldenStoaPillar 10.0)
        (ref-TS01-C2::ATS|C_SetDirectRecoveryFee patron GoldenStoaPillar 100.0)
        ;;Finish Message
        (format "Succesfully issued and setup {} {} {} amd {} Autostake Pools"
            [Auryndex EliteAuryndex SilverStoaPillar GoldenStoaPillar]
        )
    ]
)




(let
    (
        (ref-coin:module{stoa-ns.fungible-v1} coin)
        (ref-U|CT:module{OuronetConstantsV1} U|CT)
        (ref-U|G:module{OuronetGuardsV1} U|G)
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-LIQUID:module{StoaLiquidStakingV1} LIQUID)
        (ref-ORBR:module{OuroborosV1} OUROBOROS)
        (ref-TS01-A:module{TalosStageOne_AdminV1} TS01-A)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        (ref-TS01-C2:module{TalosStageOne_ClientTwoV1} TS01-C2)
        (ancient:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (pk:string "k:35d9be77f2a414cd8ce6ed83afd9d53bbdb5ef85723417131225b389a6c9e54f")
        (info:string (ref-DALOS::DALOS|Info))
        (bar:string (ref-U|CT::CT_BAR))
        (vgd:string (ref-DALOS::DALOS|VirtualGasData))
        (dalos-sc:string (ref-DALOS::GOV|DALOS|SC_NAME))
        (ats-sc:string (ref-DALOS::GOV|ATS|SC_NAME))
        (vst-sc:string (ref-DALOS::GOV|VST|SC_NAME))
        (liquid-sc:string (ref-DALOS::GOV|LIQUID|SC_NAME))
        (ouroboros-sc:string (ref-DALOS::GOV|OUROBOROS|SC_NAME))
        (swp-sc:string (ref-DALOS::GOV|SWP|SC_NAME))
        (smart-dhvault-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        ;;
        (ref-P|DALOS:module{OuronetPolicyV1} DALOS)
        (ref-P|IGNIS:module{OuronetPolicyV1} IGNIS)
        ;;
        (ref-P|BRD:module{OuronetPolicyV1} BRD)
        (ref-P|DPTF:module{OuronetPolicyV1} DPTF)
        (ref-P|DPOF:module{OuronetPolicyV1} DPOF)
        (ref-P|ELITE:module{OuronetPolicyV1} ELITE)
        ;;
        (ref-P|ATS:module{OuronetPolicyV1} ATS)
        (ref-P|TFT:module{OuronetPolicyV1} TFT)
        (ref-P|ATSU:module{OuronetPolicyV1} ATSU)
        (ref-P|VST:module{OuronetPolicyV1} VST)
        (ref-P|LIQUID:module{OuronetPolicyV1} LIQUID)
        (ref-P|ORBR:module{OuronetPolicyV1} OUROBOROS)
        ;;
        (ref-P|SWPT:module{OuronetPolicyV1} SWPT)
        (ref-P|SWP:module{OuronetPolicyV1} SWP)
        (ref-P|SWPI:module{OuronetPolicyV1} SWPI)
        (ref-P|SWPL:module{OuronetPolicyV1} SWPL)
        (ref-P|SWPLC:module{OuronetPolicyV1} SWPLC)
        (ref-P|SWPU:module{OuronetPolicyV1} SWPU)
        (ref-P|MTX-SWP:module{OuronetPolicyV1} MTX-SWP)
        ;;
        (ref-P|DSP:module{OuronetPolicyV1} DSP)
        ;;
        (ref-P|TS01-A:module{OuronetPolicyV1} TS01-A)
        (ref-P|TS01-C1:module{OuronetPolicyV1} TS01-C1)
        (ref-P|TS01-C2:module{OuronetPolicyV1} TS01-C2)
        (ref-P|TS01-C3:module{OuronetPolicyV1} TS01-C3)
        (ref-P|TS01-CP:module{OuronetPolicyV1} TS01-CP)      
    )
    [
        (acquire-module-admin ouronet-ns.DALOS)
        (define-keyset "ouronet-ns.us-0001_emma-keyset" (read-keyset "payload-1"))
        (define-keyset "ouronet-ns.us-0002_lumy-keyset" (read-keyset "payload-2"))
        (define-keyset "ouronet-ns.dh_ah-keyset" (read-keyset "payload-3"))
        (define-keyset "ouronet-ns.dh_cto-keyset" (read-keyset "payload-4"))
        (define-keyset "ouronet-ns.dh_hov-keyset" (read-keyset "payload-5"))
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            ancient
            (keyset-ref-guard "ouronet-ns.dh_ah-keyset")
            pk
            "9G.CgcAjiI89ICnk45mxx63hwkBe5G71sIqfEta0ugkzF7EB6cy55BtzlFa27jDGE7Kn7ChljCmkcIsrDw9JwzJECieGLB5Jlkz9Blo6iJct6uxIA1u64Hr7HKa93EAiCwJJBBKAojJtwupEsvspH1jjGxKyFsb8fbfnJm1rAKxcIzcFILmmdHFaICfFpnbJG6tJu0HM9JCJ7MBCE7C2LiqvE6Fc1hqCeAdGHxDp7sGquI0wl2l08aa6wlKvwu44jgqF8mqDnCyjpxHuttEqjs4h9IJ28kmB53ppwoznt16rjzeMl21n3rwfI2es56rp5xavCabDacyCuonniz72L5d7dq3ptIEiuggEyLIIGe9sadH6eaMyitcmKaH7orgFz6d9kL9FKorBr06owFg328wFhCIlCFpwIzokmo47xKKt5kBzhyodBAjhCqayuHBue4oDhoA21A2H9ut9gApMuxokcmsi7Bd1kitrfJAy1GkrGiBK5dvlhgshcnGaG3vhkCm6dI5idCGjDEodivvDbgyI6zaajHvIMdBtrGvuKnxvsBulkbaDbk2wIdKwrK"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL"
            (keyset-ref-guard "ouronet-ns.dh_cto-keyset")
            "k:2cc72ef06136150f52c01dcc3a135dbd03e5328fafd71442a933619b9337456c"
            "9G.7si93iImtrM53Jl9C7pIojCAmq04gHyk8d1lle6x07Hfh57idcrqEznFM7ousiC14d16dlIbwAE2K7MBK79ApIMgb405svepvaz7azIIHGLulbIqBefscnsmydqD1pCHAKlH3xu6tJk6ejJk5fMlvtrvu2gc0lnz7knipdqvE6huvywrFt925E9Ci5bkspirF8GDA03Iorf5zdg1ad6tFG9uMBHL2aqsu0JcoicuoHcCnLHE6dBoignL7DiJrFGxgimrmrF5cLoqDjrjhb3GwFD4wfnMDbIqmq3MMrBJm96Ggve7worr5z5oLh5bhhrjHzf0fLH77ho1zv04kEM8odz6254H4JewC4sw9cxA1Aa9vaggj5owFK332Fff41lCi75otEhdzoheln2Czli46tcKv35o1ftkHLgrjAtMoIFDKuFjzv4d3kbqJ4Crzgtn63o95FMqFF91MbLGMLEBjis3sjJiGB0yLJzdBetdECclzxFo5cAve8o08Hifng4kEgExDzqFhKGdK9lCmyu4E9vo6k3jHjhH96KlvGDCjwMFcpkqyMB2gtlurlst"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.ÍăüÙÜЦżΦF₿ÈшÕóñĐĞGюѺλωÇțnθòoйEςк₱0дş3ôPpxŞțqgЖ€šωbэočΞìČ5òżŁdŒИöùЪøŤяжλзÜ2ßżpĄγïčѺöэěτČэεSčDõžЩУЧÀ₳ŚàЪЙĎpЗΣ2ÃлτíČнÙyéÕãďWŹŘĘźσПåbã€éѺι€ΓφŠ₱ŽyWcy5ŘòmČ₿nβÁ¢¥NЙëOι"
            (keyset-ref-guard "ouronet-ns.dh_hov-keyset")
            "k:afa4d5ec4f1070e58badaac237fbf16c19c0b08dd4b981b3e91937943714138d"
            "9H.268Bnvp307DmbIcEltbEkpeHuK3C3qsD615ml5qefsA4HErwbqDhy6K1IvqxMeoCBh9mfieMj72jbzzI6a6nDtGhmf2nbHyE6M3zceog4o3bEkqcyvLsBdsGLt7Fu6Ei0Da6iej0n2z5M3bFsAk6iitosvzemff0B18kpeh5ocj5zb7DebFiLgAhIElsgg05Lh5CpyF5LqyKtlFvAay6wtCzsi2cM19BMB29nrfcIgKkaIkh2sjtAE5giM6th727eDekACBvMexk74wxgD2pJegzjuCqIe3BwozG5Fa29DqpcKM5zL1x78h7JKMj1ek2aanqnCtG33Dr3w2mzcIcLjlsDtMD1CG02CFlrCCAzMmlLmFgsBiIpt3Blj1uaxJG67xB2jwKj45s4LIDhzLea24m1AzFh6FD4MsF4Ay35i2Cvbmzdff6nuJbKM5tw5C31xapoqwEIeKkCC9zsiIk8GCMhis557p7Hk9H3aM059D24ar7KLmlr8cydi9n4u2rwH02rb8l1ixDbgoqn2jlCHDBxbCnf3A4GyI4FpaqJuBf1IwdI85Bq6qzcJIiK"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.ÓŸαďŸÿŁș∇ëŤΘìηвШ7Ξпí∇εнìażĂ0ζÛÈõóşøÍЪýWKąĄfÑřúÆFïn$éČMŹΨŮIÜЧИůąпěθÀ£ÆпiMÛğλ$ĘØÊS¢Čłя₿Bк£č0ПĂ₳Ť¢ćÊзŠąA¥ŸιÚЬѺ$Й6ÌβmæñщюΞÜťčУИJș5дč¥dńУЖțŘΛя₿ξPx₿₱yζãъWςÙf₱ťηaŻê₱ΦЫ"
            (read-keyset "payload-3")
            pk
            "9G.1gDhzraCk2gfKJhlahy5FKBB6LwrDqdgvctfH7LJ22ejtqmlGth1yFe48C4rwLcHssr0I2Mz1GG97sKCyi29cxzoxGu5EGsajDLvFzHpGMuitBB4aDLfycMA9yGuFdqu7GrdpLy2Jo2sjrhIu6cqpAf2h0383hbj2zo75zkonA0JzAKt5oCbhlrybhDKApEd8EJF27Liymw99porIjyahlD7poxmAtdLtpg6qmymvtg6mkMFbrjk0Ls0wanevkyMk1td7jFyulAEo9lAIA8jbnCDap5Lju70lJzqefqAhqeyxfoeb7fncIBL0tsdz6olzxxwb1corLqbJF0BKszd5odijy2k84w2nqv92t5EckEsrKwynFm7bhqjb2yMcLkoCMcEIrea8ggk2M9pCCm0FeHmhgdjfLra6jiuxauqB8FMw7B1tAsEIgxAdasBHfsHuMwDL33q3tmvHnCCFEiud4psC0EydAEtMntl78JLzdAglfhGhyczpb9upA8ufn4l1ndlJJc6KBng3qbu5J7njwa5obDrsEsbj23bi6bys9Cy0E9t7ADdC0haHxhbl"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.A0ěьπΨтÎșπЦĐđŽ6ЫêÀεÅĐȘдÞЩ4Ł2ďй5žömiτsλÚÇдěÒaV₱ÏûιЩД₳îJÍşыyÜŹżęìvAЙsÄ¢ÿnΦIťQůЮ7ĄвaèďíoáнõÎLJθÆEáПiXÿÒÀĘ14цU1çΞêSťüIψчèι₱ê9ŽчΓüЦrÀÓμĆ99κQťqPÖшŮ1ÈČSĐŁÌбÝàŞbPσŃĎ8ĄW"
            (keyset-ref-guard "ouronet-ns.us-0001_emma-keyset")
            "k:11cd20672e0b414864b3b55f81f3980a74a021928c80b607d9e678043b34da80"
            "9G.39tf0E26stf4Dxiows9kidajrJGCjDighDd4jltItj9js3n8dFiiin5yphml1u0uAltxumFngoogIv8jypw4LlehiEbmuzxtwkdajn7j3M0s3s7g6aALwbbGt6uGjeuFw1ovxf769AzklLxke2MKfobAbDyIH2a6zwKC79eypy1tfdF2plELbfMq9KxtF1GvIri0y4c4Ll3rK0FqICktqmJEakeC4GadmsAatJzIa8vHj82uC0A3KrtkhLsz9cGmsC0Lmzi6GFvv0Cola8g1A4k2neFEAoCsHyepILCgCz6ftlLmsjwgBMfLLL0n3Iwa4lzsn0w2qHwqmvckCtEIeHfwd5m9MKg8AA51uaBDm76j9GnMpecaabqELMm2Fc1h4DhgmzJIIndmwj0vxKmqjnxfg891HKezsCJxIDmMvxC7JbGGbaLip7JaJ6kuuBmreFm3GyLIz1KKlIeBG6Ck8ftgpaGum2BrEFF45jom87uhba7lzfpq6ihG8H4MCAGyyrz9q3ben4yLv4Keqq9tt1q0F5AdC4s4Eox0ebLwLiCtgkrfp5qCohHBH8E8"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.œâσzüştŒhłσćØTöõúoвþçЧлρËШđюλ2ÙPeжŘťȚŤtθËûrólþŘß₿øuŁdáNÎČȘřΦĘbχλΩĄ¢ц2ŹθõĐLcÑÁäăå₿ξЭжулxòΘηĂœŞÝUËcω∇ß$ωoñД7θÁяЯéEU¢CЮxÃэJĘčÎΠ£αöŮЖбlćшbăÙЦÎAдŃЭб$ĞцFδŃËúHãjÁÝàĘSt"
            (keyset-ref-guard "ouronet-ns.us-0002_lumy-keyset")
            "k:8d9ef619118ad63187c3d56a3ff72986188cec388aa24d49eb8790233cca414c"
            "9G.1CAv9Fq0mmrgALMafmEv46lkzHj7yib75pCbDdtojimK8KHiBMqcMMj4002t612H5HaKD6yBDo556n2Jsc7CvxFlo0knLpoLMs331kCgur71s7tHbc20iAx5IvCdaektlscciwLAH8bKIprgBmJubk12xKGfw2FbdjH8Hgygs5g2LJKsf11sh6croly7w8G6E2LLHsf1D5HImE3K7Jd5wMkjcCHsu2khw6wpmxotBf1l1jMxedypoyGh5GHzy15hKafx4cL97ttq8jEvnioLshycFct228L6xsIIadmcodbyyyDhA2H7yqe2C5rwAvqirFHy5d40Mo2mFyJhG4D3HvwphdCuGCkM9yv3vdDFo4HHGDAllz2Ig6B1y8lf9Dmg9kk3fIFI5m7f8p01Hejq30JsA4av0cruGEIIB94AbyJvec09u2DA9gi7t4qDurc8pxw8qgs8v4IFoB2k1vwint9z2JAc82kw5t4frwip3Isx7zk3za2qdi5M6ifiFokdzidA0A0u3eho6goh5x8nn3llBDz6E9uDKedyApF1nzDkJefAIbigke32psym"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.ÅτhGźνΣhςвiàÁĘĚДÏWÉΨTěCÃŒnæi9цéŘQí¢лΞÛIчмfÓeżÜýЯàDÖ5αȚÞVđσγ₱0ęЬÔĄsĄLлKùvåH£ΞMFУûÊyđÜqdŽŚЖsĘъsПÂÔØŹÞŮγŚΣЧ6Ïж¢чPyòлБ14ÚęŃĄåîêтηΛbΦđkûÇĂζsБúĎdŸUЛзÙÂÚJηXťćж¥zщòÁŸRĘ"
            (keyset-ref-guard "ouronet-ns.us-0000_aozt-keyset")
            "k:3583447c7273253e634d6cd7aa86eee5df9a33e05bd29122e2b95f157bea937e"
            "9G.29k17uqiwBF7mbc3rzr5gz228lxepz7a0fwrja2Bgzk1czjCLja3wg9q1ey10ftFhxIAiFBHCtvotkmKIIxFisMni8EA6esncL3lg2uLLH2u89Er9sgbeGmK0k7b63xujf1nAIf5GB583fcE6pzFak2CwhEi1dHzI0F14tvtxv4H8r1ABk5weoJ7HfCoadMm1h8MjIwjzbDKo80H25AJL8I1JiFF66Iwjcj3sFrD9xaqz1ziEEBJICF2k81pG9ABpDk2rK4ooglCK3kmC0h7yvvakjIvMpGp00jnw2Cpg1HoxjK0HoqzuKciIIczGsEzCjoB43x7lKsxkzAm7op2urv0I85Kon7uIBmg328cuKMc8driw8boAFnrdqHEFhx4sFjm8DM44FutCykKGx7GGLnoeJLaC707lot9tM51krmp6KDG8Ii318fIc1L5iuzqEwDnkro35JthzlDD1GkJaGgze3kDApAckn3uMcBypdz4LxbDGrg5K2GdiFBdFHqdpHyssrH8t694BkBtM9EB3yI3ojbnrbKrEM8fMaHAH2zl4x5gdkHnpjAeo8nz"
        )
        
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            dalos-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_dalos-keyset")
            pk
            ancient
            "9G.DwF3imJMCp4ht88DD1vx6pdjEkLM4j7Fvzso8zJF7Ixe1p2oKfGb53a5svtEF0Lz1q4MjvHaMrgqCfjlA1cBj2bzvs86EeLIMg2fmutzwbA5vI4woKoqq0acDHllAonxC4qLBulsLclMGwcw9iGxiw919t4tfD8FpcIc4MJ059ki7giFIAyCghgMwwr199v3qiDfIon426rbz1jMLmCe4jhHwD3sEarwMlmzLJ5li43J70CEDzouh7x8pu4u1GxJHa6Cabrsc147gIlzIdDmCC2j87LFpEdvqLge9o0w4av8mLr0lDAfalpnEabfkl0E6zE9KMG7LH2w7uvBIup3Hxxxu2Giwu29Cqye3fJ5ihcjacop4vtcLsi33ip742uAhGzjHaDLwAh933ntp8tEC1zkt9yi6n89JtsDLk477p80rscbGtsi14nxsMf7y0d7GxzE8FFmljElu5yE3vx25cEvc9574Hw4iIi23FFKfdhGF77LMqaBkDB9hJKmpc1B2rM1a8mfilyvLAdzpj57Ae5FG5vvm1n1nzgau373dBF7CuBAu2zbts09du55"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            ats-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_autostake-keyset")
            pk
            ancient
            "9H.9I8veD6Lqmcd5nKlb1vlHkg976FhdtooE3iH73h8i2Gq9tLKdclnpo07sC29i2yvMeuB0ikkKghiIgdAfkfDiM57o2phj2quCD8gutjIgDs6AlecMtw2lG6kMMBxBH4B5d1xqhpzA7AHkgEqF7Hgqwpx6E5aIMAtqxIpMhjyqziDiwLA69dKlhlwpjoze34Bwz6swBjlA880ItKfwxtulKEJG9oI3Gjmwgn6bbAgL7xy4brdbgK5DukMBHc0K1jIs1DjcDzhJz2liKultB67rKaBf3nMHMkbzhwl1hdu2wBCeHMLLphug2kE3tDtpxw6kLcj80qfBxvwmuxbeHjk349Md2B7eB4brt8fldi2CxGltfj41KA7GkgmtMa6szivDl5aCk9ozab9ohrsfBHikGL7GJ5Az4A2a8ufnIAJIz2mAgwGDmsAl7yyavbx12e5KhFFupclbKadmiFx8dvqkqwziu4vtt3AcKDhl96EzhuiKAF49vGoaAMo5vxM4h0t94nscG8IGl33De5MJGCpdf3g23D13eJ9BDi034wECutafzao4zzCe9IyvD3E"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            vst-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_vesting-keyset")
            pk
            ancient
            "9G.5s5hoiGo96tMqyh3JBklmsvo8Lc3ol9m6zavJcCuqg4mBvkbDfcv5gEorMit8v8Mj9Jc18EI36Gq7cJ1IyA4e4wvl199KuCx3chsDKGDdfsvzk8mo317ulGk00pbxu7MLc2zw7joouaxt3Ax1KnlJz153ko0JtIxz7pqylfis45pDo2vvm1MH2kA2wmE2crxiEo6oEckuGqzz8oEaa9ez8ADLyqnj48lq4jGp4slkKo6a06ElezH619fsihIdmiMdfB036CJAr0rlzA2b5DgvEJcoyIFioru7vynBjLMLv3pvLFnbFeswrlyLjF8ry7kB52cD7bD7xaamCEjgIC2DsKMv5Mrd69BIKn2yKHC86f0hme9zs5dwMekAd6mc4wM4bDAk6Jrsl6s74ykKLF71pk45rIE1xxzFC4EjykBf6G0neBdaExI32HufaE5mEloDtvnC6vJ7HA9akkI3616MnLErA8eMIn7Kr2wI4l9CvGpKcF9HilzJmdqMa4kzJwqzuFc9LhDnrKcu0LvBHqsx2CrCM9EwHqpkkGe7w8eK8x0xK6K8drLaoBKmaB1"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            liquid-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_stoaliquidstaking-keyset")
            (ref-LIQUID::GOV|LIQUID|SC_KDA-NAME)
            ancient
            "9H.b49lfzLzvC25g87fst6MqCkfbuqq39iGu50gDqi9jBEk6Cn86w54b91zDxeGgLdCxIjJDfyi6gBBwA93lyGLcdfggf0LzwKu405piavx0nEnqpzyHK125h2BhECnobmDBAps61c7mGmw5GrczBjvBMLxHwl2avt5jwhKeGxh7Ibm1ui6wI6lpAKBMay4tvEwHK0EibhbeaA2lLqjIwqMKnldp22txeje3DFLautFC798ExbLxG7q3om8l1f9qpMJkw9f5nmHsHGJcrcIF2mou9lmpr3hbz64La6nF9w26h7osABLMLlK9Glp48yrj4h1MkI7xjftytKDnJFyqvoMFqKvA43cJ81bJCvmn63eJ9jx5n3GxFbc9H4v400iFwtyIilmhKymsa1iCnwL29g21DvkaE6JJyxl5eLCiGH3Ml1nb0jkg16zJbf9cfg41KHA0IGFIvLj9LBhj7okL6wspCEBfkc5Aui6DAM7dvAqH54LApEaAzIgyMloEmqvBgt5wF0lyd05xHxz4Mtb3ItGb5fLpzbMGqGKBffi4dElI7Hbs6Id0hCKGaeIg9JL"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            ouroboros-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_ouroboros-keyset")
            (ref-ORBR::GOV|ORBR|SC_KDA-NAME)
            ancient
            "9H.28jB2BBny4op601Cfqz9brFJKAEo67jbEDJi91i00pGjcD1Mpn0y0A1CxcAwGgBu35Ix3bG4e4p56Mu6x7Mmd50nKfmpDGtLy1ywyCjoDD5xiHBb0y5dAjB0fuokrqyx3ula9rtxyEHK1A4gkG4g3GEyysMtgF40IBgKjm7t8ffGshICIypFeF3gA5x0MixA0soiCx9tBnMDzI6G5xC8yIJJ3Bt2sCvJHAp7HAEA3rKK6Bgnx8hK94oDbgrpCkxw3zpo7tbeHhcakzbg0ELG3EJvk19hyd9LC73t2gizl0B6puq3Ljji5EDAhzno7K32x8vCagc5D2GLiMfdzEzsj5KEe1c2p7hxj76lMvp40r9F56vzlK8Kb7mrKt90ILEMqCghLrok7D4uH8h28EGqbK75wiyguimc1jDGxthyBJFfApClymKA57ehqbv2Lyv323w44b0kIItu35fjmhe2DCBMwjn67ffDII97b6AdyG010wvAHf55xFt25Mbm2pflsggL4D5jHtokl7qn6g4ltM5ilvHvsxn7jHe23Cfgoxn1JssdFMBpcDvB2xki7"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            swp-sc
            (keyset-ref-guard "ouronet-ns.dh_sc_swapper-keyset")
            pk
            ancient
            "9G.4Bl3bJ5o1eIoBkhynF39lFdvkA3E0n8m5fBr9iG4D6Ahj3xfop72b98rr33vFFLjqaiozE1btl7lgzKcjHwjzu5GuFqvMb43v9CHHe8je3buLbHMkcAyKdEMD85yIHsb9ty58Kzyado3ho1n1mf9GzpeegMrpK9wDFteeKexdL7HHq8GF7ptD2w45IkMf2A8j4pm7E6vJ1ytCckhclD9nd3JzL2j5cyLxawnE76leKmEmFaxqnF76yyJe5Mu6yLkg2yonJa6vx6jd1kr0hdEf81o42Asr8EcCDeeqD4nAehC3w3pFDMwbln4Mbl6t55GHGephx99LJKH1ojhlMlnyC4bbJFAiyD1h6vs0o7mKAaazFG9y0vfbvM9imcs1vCMmpk2cGDAAAqH6iJe32ugHA3AECEgCvxCskw4Mfx6Cc4rx2BkmKMlxeHqyDceI6wa2qjzuyI80vKg6H6tMwEg48H0ywIMDyxteDfHav08eEJE2lljEIAc1jxLlLcosbiknAyxJvu8g7kA4oAlcio2jI8lMxp76vosd5FxpatowuFktILfyCFyHvKfcozy"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
            (keyset-ref-guard "ouronet-ns.dh_sc_dhvault-keyset")
            pk
            ancient
            "9G.7G3mkhkk34Bg37uslsu3M7psBc40xsKFibE9DL0jb43JcJ7fzDh9cz3Edn8uvlkh0bCeFafFntCKt0HvJsmczx3Lek9d3mqr38BbIwmBrDkd8sordjr4L7tJ5Fnqj39F6s55hD3rEFvMGors4sws3lDcKiEHkMEE7kHuuB31gGe3F5HsI0yHbwsm2IcspsB1ICiD1g73vup127pjLauIc6gxl3sJy0lAml1uA9g18Btcl6prinGmo3uFomeoyvx9oLGlf6ctFsfavKa5vFrvaw2FB1KsAiejqqjaeMu1I1cEey3m55allFm5pg9LaFK307qnmjxfmqv38vvr2wBerI4BnvFKLgpB7e7pCCmarDJq1l6nHEIv6wl3d96iwAqEHxKEwpH7ljzqnsnBpcEFlpKu6xjc5o78DiwzrltiDxa5c9ug7wML3MGqDEH9tzIj2IreF5yEnw4M15yy38z7gqKbd7l3Fb3qc7kvrgHKG8cpq9M54kg6v5a1k7Laqea07ynccK6r2bjwl7L8IkE7EsAep77M1kb4455klFFH2qx2uEuGBlfsu1rztiMa"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
            (keyset-ref-guard "ouronet-ns.dh_sc_dhvault-keyset")
            pk
            "9G.7G3mkhkk34Bg37uslsu3M7psBc40xsKFibE9DL0jb43JcJ7fzDh9cz3Edn8uvlkh0bCeFafFntCKt0HvJsmczx3Lek9d3mqr38BbIwmBrDkd8sordjr4L7tJ5Fnqj39F6s55hD3rEFvMGors4sws3lDcKiEHkMEE7kHuuB31gGe3F5HsI0yHbwsm2IcspsB1ICiD1g73vup127pjLauIc6gxl3sJy0lAml1uA9g18Btcl6prinGmo3uFomeoyvx9oLGlf6ctFsfavKa5vFrvaw2FB1KsAiejqqjaeMu1I1cEey3m55allFm5pg9LaFK307qnmjxfmqv38vvr2wBerI4BnvFKLgpB7e7pCCmarDJq1l6nHEIv6wl3d96iwAqEHxKEwpH7ljzqnsnBpcEFlpKu6xjc5o78DiwzrltiDxa5c9ug7wML3MGqDEH9tzIj2IreF5yEnw4M15yy38z7gqKbd7l3Fb3qc7kvrgHKG8cpq9M54kg6v5a1k7Laqea07ynccK6r2bjwl7L8IkE7EsAep77M1kb4455klFFH2qx2uEuGBlfsu1rztiMa"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            "Σ.μЖâAáпδÃàźфнMAŸôIÌjȘЛδεЬÍБЮoзξ4κΩøΠÒçѺłœщÌĘчoãueUøVlßHšδLτε£σž£ЙLÛòCÎcďьčfğÅηвČïnÊвÞIwÇÝмÉŠвRмWć5íЮzGWYвьżΨπûEÃdйdGЫŁŤČçПχĘŚślьЙŤğLУ0SýЭψȘÔÜнìÆkČѺȘÍÍΛ4шεнÄtИςȘ4"
            (keyset-ref-guard "ouronet-ns.dh_sc_dpdc-keyset")
            pk
            ancient
            "9G.2j95rkomKqd207CDg5yycyKcAy1AqFhjy6D0rCr0Kbwe9E6libtveIHsAIw9F2c43v6IHILIBf62r2LD58xHE09kypyoevL62E81wHL4zj9tIyspf5df82upuBGGKmIsHGuvH86fHMMi99n0htsypL9h3dMHFCIx8ogeynkmCIghxK871rlkas8iDfce7AwAbiajr7H1LHi17mLD7aJu6m7xmcAABkhxtwb4Kqbk8xLpehakyu3AvajgJvtfeysoH67irvplA0as86Jls1r3d3oHms9Maaja9856wzybpthMGs6qDAzacE24skcA30wvm77BLhrdh0ymkl3vbJ9lG641J7ofg5K9gEbHD4ioFHLEajL28qsD4cFEhdDthDzwF8EnBBc74Dikqn9xixFap5Jxhl7D0owz5d9MDJzfjgx3jbdpD3zglsq83iC4fhcpbz3KeAi11Ig2pgIqnmwwqA0Exr5073w7lgzlrw3Ff7Co9uuxbnLuJvlFzgfGeIwM2Dmev1JskqEGK0Ck0B87iagsHFI76HC6sKnwrHnkl0sl8pAf0pbBaw9MbqLs"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            "Σ.hÜ5ĞÊÜεŞΓõè1Ă₳äàÄìãÓЦφLÕзЯŮμĞ₿мK6àŘуVćχδдзηφыβэÎχUHRêγBğΛ∇VŒižďЬШ£îOÜøE4ÖFSõЩЩAłκè1ččΨΦŻЖэч6Iчη₱ØćнúŒψУćÀyпãЗцÚäδÏÍtςřïçγț6γÎęôigFzÝûηы₿ÏЬüБэΞčмŃт₳ŘчjζsŠȚHъĘïЦ0"
            (keyset-ref-guard "ouronet-ns.dh_sc_dispenser-keyset")
            pk
            ancient
            "9G.o0n0iHmGhkch5aEqr0wcpEKpuqgGt5uvFapDLb94GwCbJvBga5H4xrFAx41CbMMH0M7AHmqFnrafceFmaHBfjsH51ggCxJmu5DMpK4jGg0rpogpD26r4yiykAIkaqDz61sHGewpxl1tly780ahKxbEB7uD8FlvA1nGppsttz3AhIhbxlhJ3BpI3Hehf5tCM6bfqF9o6ryb3bErqJwEDJmMGFC9HEeDiLKAtMgqaajzK2b0yg2sE0lJMp2K8I6sjfwnyhyL5vnycpMpeCgagdlnbMMMaA9trHLx4FxLym6KqCFAxCFwFHohfbcolG3u5wGo06M1fMBKpC64Mgm4584tH93Hpmop4tLpD7157GLo7mejJk8ryrA229K07D2hbhtanzCgdtjziBs9yqvHLq78EFEsD1fpEeD0pMhJeLEMEsqu8zf816cLErk4aDC22GnsC9774C59iaLFKkzKzh11xnAEalcpGcLf7aecGBHu5IABIGq8sEFa9Ahi5inermzrys3HcLpz2degMmAEy8hKsI83zvaCta8Ksimgn3qmv4r4jocMsIAwDeEfzE"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.hÜ5ĞÊÜεŞΓõè1Ă₳äàÄìãÓЦφLÕзЯŮμĞ₿мK6àŘуVćχδдзηφыβэÎχUHRêγBğΛ∇VŒižďЬШ£îOÜøE4ÖFSõЩЩAłκè1ččΨΦŻЖэч6Iчη₱ØćнúŒψУćÀyпãЗцÚäδÏÍtςřïçγț6γÎęôigFzÝûηы₿ÏЬüБэΞčмŃт₳ŘчjζsŠȚHъĘïЦ0"
            (keyset-ref-guard "ouronet-ns.dh_sc_dispenser-keyset")
            pk
            "9G.o0n0iHmGhkch5aEqr0wcpEKpuqgGt5uvFapDLb94GwCbJvBga5H4xrFAx41CbMMH0M7AHmqFnrafceFmaHBfjsH51ggCxJmu5DMpK4jGg0rpogpD26r4yiykAIkaqDz61sHGewpxl1tly780ahKxbEB7uD8FlvA1nGppsttz3AhIhbxlhJ3BpI3Hehf5tCM6bfqF9o6ryb3bErqJwEDJmMGFC9HEeDiLKAtMgqaajzK2b0yg2sE0lJMp2K8I6sjfwnyhyL5vnycpMpeCgagdlnbMMMaA9trHLx4FxLym6KqCFAxCFwFHohfbcolG3u5wGo06M1fMBKpC64Mgm4584tH93Hpmop4tLpD7157GLo7mejJk8ryrA229K07D2hbhtanzCgdtjziBs9yqvHLq78EFEsD1fpEeD0pMhJeLEMEsqu8zf816cLErk4aDC22GnsC9774C59iaLFKkzKzh11xnAEalcpGcLf7aecGBHu5IABIGq8sEFa9Ahi5inermzrys3HcLpz2degMmAEy8hKsI83zvaCta8Ksimgn3qmv4r4jocMsIAwDeEfzE"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            "Σ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ"
            (keyset-ref-guard "ouronet-ns.dh_sc_custodians-keyset")
            pk
            ancient
            "9H.abeq3vvcwJp9gl2Kdt5xb7djJwdB35bCgkIaF3r0k38kBF6La1M6ci0ma2e5exMehsmwe1x3d6EpsIjxv95hAvc3uJweirnitcAAryxn9HaHJ1f0ya36BDfsrfaIBL4moIF3B8glb5pDBhta7pyxigEdt13ccEIKtCdyC6krMhB5iyqfEyB70zf5tjqn2xpDDzg9nA7auzzjxxtwLH80Lmdp4wAEcnqprGishhMLLefMnzDv9dFyM0n31fAcziHogCIM4kktFgydhHah7hmJurs3xCrGrs5qAEtjid0zioLHM58l8wogL2j0L9LIH21wI4lD1BlKq4445nos849CEzcm3DC9t67IH1r63pkgc9xFEGr8K6H3CCfg9aqDcApxaDuEomaKjEj6ft71gtEwbEJJmrAzfDolHrFfubcertjF2rE2wMywhv7HqIoHMCKEznMFCy2C6eyGyh1mIMeKJDDhwqIDIA5a2wvtt0HedKxmgDldafrrGdn5yDGHMexLFCrGv9aG50G82zIlE5z7cksfplf5taeiz8vlydDKmLaCcMgA7ne77hsbGHuu"
        )
        (ref-TS01-A::DALOS|A_DeployStandardAccount
            "Ѻ.Щę7ãŽÓλ4ěПîЭđЮЫAďбQOχnиИДχѺNŽł6ПžιéИąĞuπЙůÞ1ęrПΔżæÍžăζàïαŮŘDzΘ€ЦBGÝŁЭЭςșúÜđŻõËŻκΩÎzŁÇÉΠмłÔÝÖθσ7₱в£μŻzéΘÚĂИüyćťξюWc2И7кςαTnÿЩE3MVTÀεPβafÖôoъBσÂбýжõÞ7ßzŁŞε0âłXâÃЛ"
            (keyset-ref-guard "ouronet-ns.dh_sc_custodians-keyset")
            pk
            "9H.abeq3vvcwJp9gl2Kdt5xb7djJwdB35bCgkIaF3r0k38kBF6La1M6ci0ma2e5exMehsmwe1x3d6EpsIjxv95hAvc3uJweirnitcAAryxn9HaHJ1f0ya36BDfsrfaIBL4moIF3B8glb5pDBhta7pyxigEdt13ccEIKtCdyC6krMhB5iyqfEyB70zf5tjqn2xpDDzg9nA7auzzjxxtwLH80Lmdp4wAEcnqprGishhMLLefMnzDv9dFyM0n31fAcziHogCIM4kktFgydhHah7hmJurs3xCrGrs5qAEtjid0zioLHM58l8wogL2j0L9LIH21wI4lD1BlKq4445nos849CEzcm3DC9t67IH1r63pkgc9xFEGr8K6H3CCfg9aqDcApxaDuEomaKjEj6ft71gtEwbEJJmrAzfDolHrFfubcertjF2rE2wMywhv7HqIoHMCKEznMFCy2C6eyGyh1mIMeKJDDhwqIDIA5a2wvtt0HedKxmgDldafrrGdn5yDGHMexLFCrGv9aG50G82zIlE5z7cksfplf5taeiz8vlydDKmLaCcMgA7ne77hsbGHuu"
        )
        (ref-TS01-A::DALOS|A_DeploySmartAccount
            "Σ.Îäć$ЬчýφVεÎÿůпΨÖůηüηŞйnюŽXΣşpЩß5ςĂκ£RäbE₳èËłŹŘYшÆgлoюýRαѺÑÏρζt∇ŹÏýжIŒațэVÞÛщŹЭδźvëȘĂтPЖÃÇЭiërđÈÝДÖšжzČđзUĚĂsкιnãñOÔIKпŞΛI₳zÄû$ρśθ6ΨЬпYпĞHöÝйÏюşí2ćщÞΔΔŻTж€₿ŞhTțŽ"
            (keyset-ref-guard "ouronet-ns.dh_sc_demipad-keyset")
            pk
            ancient
            "9F.gGCkuc2wMAnFAjuFphikftLdl6qFqBD4yfeMEe9u65yMqf4r340Jd6dphh1d7E1cE20btMwl4HJ2cBEMvp209GA1eD4syB96hu4nmpFbB7dKnJEMz4p8fGLcmhvrBCfDmM0axnGin8qedl5vDtwbgL3l1aK5BsmjkEEJartqCH8qG8ialtjxwCcIMf50t2lkeww6Dct5LlmmLG25FmfpcgnwMMnkJl4Gfn9gwoA6vm0jKebjhodeJLjxnh9L11ss8f26866dqv1tEphxFFqutGetH4Itj3rHkrcrGsnlqpf4gfJp94b0gBwIBe4vCj6ha8jm6kd3f8B6pEaJtkJ3fbs6rCcGibltz1BAMn0vvKME5ddFyGBnzssk1s2s0vFzwxs6vjC61Ma2l1xDxqdg1thAk2u01hDiGndLhzK73HAfgtk7bxscn0qKhymG6JAqnEFt282pyHAq5nIthK9bA8nH76x7FEpLz4eK9tLIBsyjb8M5DxaeEei6pEnLxFCAg7ulacgtjjpjMiAaqhpmM1jEHqjt4G85q4L33zrME7whgIkIpIgwnF2qKd4"
        )
        (ref-P|IGNIS::P|A_Define)
        ;;
        (ref-P|BRD::P|A_Define)
        (ref-P|DPTF::P|A_Define)
        (ref-P|DPOF::P|A_Define)
        (ref-P|ELITE::P|A_Define)
        ;;
        (ref-P|ATS::P|A_Define)
        (ref-P|TFT::P|A_Define)
        (ref-P|ATSU::P|A_Define)
        (ref-P|VST::P|A_Define)
        (ref-P|LIQUID::P|A_Define)
        (ref-P|ORBR::P|A_Define)
        ;;
        (ref-P|SWPT::P|A_Define)
        (ref-P|SWP::P|A_Define)
        (ref-P|SWPI::P|A_Define)
        (ref-P|SWPL::P|A_Define)
        (ref-P|SWPLC::P|A_Define)
        (ref-P|SWPU::P|A_Define)
        (ref-P|MTX-SWP::P|A_Define)
        ;;
        (ref-P|DSP::P|A_Define)
        ;;
        (ref-P|TS01-A::P|A_Define)
        (ref-P|TS01-C1::P|A_Define)
        (ref-P|TS01-C2::P|A_Define)
        (ref-P|TS01-C3::P|A_Define)
        (ref-P|TS01-CP::P|A_Define)
        ;;Define Prices
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "standard"     1.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "smart"        2.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ats"          1.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "swp"         15.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "dptf"        20.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "dpmf"        30.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "dpsf"        40.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "dpnf"        50.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "blue"         2.5)
        ;;Ignis Prices
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|smallest"            1.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|small"               2.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|medium"              3.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|big"                 4.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|biggest"             5.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|branding"          100.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|token-issue"       500.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|ats-issue"        5000.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|swp-issue"        4000.0)
        (ref-TS01-A::DALOS|A_UpdateUsagePrice "ignis|swp-liquidity"      20.0)
        ;;
        (insert ref-DALOS::DALOS|PropertiesTable info
            {"global-administrative-pause"  : false
            "demiurgoi"                    :
                [
                    (ref-DALOS::GOV|DHV2|SC_NAME)
                    "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL"
                    "Ѻ.ÍăüÙÜЦżΦF₿ÈшÕóñĐĞGюѺλωÇțnθòoйEςк₱0дş3ôPpxŞțqgЖ€šωbэočΞìČ5òżŁdŒИöùЪøŤяжλзÜ2ßżpĄγïčѺöэěτČэεSčDõžЩУЧÀ₳ŚàЪЙĎpЗΣ2ÃлτíČнÙyéÕãďWŹŘĘźσПåbã€éѺι€ΓφŠ₱ŽyWcy5ŘòmČ₿nβÁ¢¥NЙëOι"
                ]
            "unity-id"                     : bar
            "gas-source-id"                : bar
            "gas-source-id-price"          : 0.0
            "gas-id"                       : bar
            "ats-gas-source-id"            : bar
            "elite-ats-gas-source-id"      : bar
            "wrapped-stoa-id"              : bar
            "silver-stoa-id"               : bar
            "golden-stoa-id"               : bar
            "ur-stoa-id"                   : bar
            "treasury-dispo-type"          : 3
            "treasury-dynamic-promille"    : 320.0
            "treasury-static-tds"          : 250.0
            "ouro-auto-price-via-swaps"    : true}
        )
        (insert ref-DALOS::DALOS|GasManagementTable vgd
            {"virtual-gas-tank"             : (ref-DALOS::GOV|DALOS|SC_NAME)
            "virtual-gas-toggle"           : false
            "virtual-gas-spent"            : 0.0
            "native-gas-toggle"            : false
            "native-gas-spent"             : 0.0
            "native-gas-pump"              : false}
        )
        ;;
        ;;Genesis Governor Swaps
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient dalos-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (ref-P|DALOS::P|UR "TFT|RemoteDalosGov")
                    (ref-P|DALOS::P|UR "ORBR|RemoteDalosGov")
                    (ref-P|DALOS::P|UR "SWPU|RemoteDalosGov")
                    (ref-P|DALOS::P|UR "TS01-A|RemoteDalosGov")
                    (ref-P|DALOS::P|UR "DSP|RemoteDalosGov")
                ]
            )
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient ats-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (ATS.ATS|GOV))
                    (ref-P|ATS::P|UR "ATSU|RemoteAtsGov")
                    (ref-P|ATS::P|UR "TFT|RemoteAtsGov")
                ]
            )
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient vst-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (VST.VST|GOV))
                    (ref-P|VST::P|UR "SWPLC|RemoteSwpGov")
                    (ref-P|VST::P|UR "MTX-SWP|RemoteSwpGov")
                ]
            )
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient liquid-sc
            (create-capability-guard (LIQUID.LIQUID|GOV))
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient ouroboros-sc
            (create-capability-guard (OUROBOROS.ORBR|GOV))
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient swp-sc
            (ref-U|G::UEV_GuardOfAny
                [
                    (create-capability-guard (SWP.SWP|GOV))
                    (ref-P|SWP::P|UR "SWPU|RemoteSwpGov")
                    (ref-P|SWP::P|UR "SWPI|RemoteSwpGov")
                    (ref-P|SWP::P|UR "SWPLC|RemoteSwpGov")
                    (ref-P|SWP::P|UR "MTX-SWP|RemoteSwpGov")
                ]
            )
        )
        (ref-TS01-C1::DALOS|C_RotateGovernor ancient smart-dhvault-sc
            (ref-P|DALOS::P|UR "DSP|RemoteDalosGov")
        )
        ;;Deploy Principal Autonomous Accounts
        (ref-coin::create-account 
            (ref-DALOS::GOV|DALOS|SC_KDA-NAME) 
            (ref-DALOS::GOV|DALOS|GUARD)
        )
        (ref-coin::create-account 
            (ref-ORBR::GOV|ORBR|SC_KDA-NAME) 
            (ref-ORBR::GOV|ORBR|GUARD)
        )
        (ref-coin::create-account 
            (ref-LIQUID::GOV|LIQUID|SC_KDA-NAME)
            (ref-LIQUID::GOV|LIQUID|GUARD)
        )
        ;;
        ;;Issue Tokens
        (let
            (
                (ids:list
                    (ref-TS01-C1::DPTF|C_Issue
                        ancient
                        dalos-sc
                        ["Ouroboros" "Auryn" "EliteAuryn" "Ignis" "WrappedStoa" "SilverStoa"]
                        ["OURO" "AURYN" "ELITEAURYN" "GAS" "WSTOA" "SSTOA"]
                        [24 24 24 24 12 24]
                        [true true true true true true]         ;;can change owner
                        [true true true true true true]         ;;can upgrade
                        [true true true true true true]         ;;can can-add-special-role
                        [true false true true false false]      ;;can-freeze
                        [true false true false false false]     ;;can-wipe
                        [true false false true false false]     ;;can pause
                    )
                )
                (OuroID:string (at 0 ids))
                (AurynID:string (at 1 ids))
                (EliteAurynID:string (at 2 ids))
                (GasID:string (at 3 ids))
                (WrappedStoaID:string (at 4 ids))
                (SilverStoaID:string (at 5 ids))
            )
            [
                (update ref-DALOS::DALOS|PropertiesTable info
                    { "gas-source-id"           : OuroID
                     "gas-id"                  : GasID
                     "ats-gas-source-id"       : AurynID
                     "elite-ats-gas-source-id" : EliteAurynID
                     "wrapped-stoa-id"         : WrappedStoaID
                     "silver-stoa-id"          : SilverStoaID
                    }
                )
                ;;Set Token Roles Part I
                (ref-TS01-C1::DPTF|C_SetFee ancient AurynID 50.0)
                (ref-TS01-C1::DPTF|C_SetFee ancient EliteAurynID 100.0)
                (ref-TS01-C1::DPTF|C_ToggleFee ancient AurynID true)
                (ref-TS01-C1::DPTF|C_ToggleFee ancient EliteAurynID true)
                (ref-TS01-C1::DPTF|C_ToggleFeeLock ancient AurynID true)
                (ref-TS01-C1::DPTF|C_ToggleFeeLock ancient EliteAurynID true)
                ;;
                ;;Set Token Roles Part II
                (ref-TS01-C1::DPTF|C_SetMinMove ancient GasID 1000.0)
                (ref-TS01-C1::DPTF|C_SetFee ancient GasID -1.0)
                (ref-TS01-C1::DPTF|C_SetFeeTarget ancient GasID dalos-sc)
                (ref-TS01-C1::DPTF|C_ToggleFee ancient GasID true)
                (ref-TS01-C1::DPTF|C_ToggleFeeLock ancient GasID true)
                (ref-TS01-C1::DPTF|C_ToggleMintRole ancient OuroID smart-dhvault-sc true)
                ;;
                ;;Setup WSTOA and STOA
                (ref-TS01-C1::DPTF|C_DeployAccount ancient AurynID ats-sc)
                (ref-TS01-C1::DPTF|C_DeployAccount ancient EliteAurynID ats-sc)
                (ref-TS01-C1::DPTF|C_DeployAccount ancient WrappedStoaID liquid-sc)
                (ref-TS01-C1::DPTF|C_DeployAccount ancient SilverStoaID liquid-sc)
                ;;
                (ref-TS01-C1::DPTF|C_SetFee ancient SilverStoaID -1.0)
                (ref-TS01-C1::DPTF|C_ToggleFee ancient SilverStoaID true)
                (ref-TS01-C1::DPTF|C_ToggleFeeLock ancient SilverStoaID true)
                ;;
                ;;Create Vesting Links for Snake Tokens
                (format "Vested Links for Ouroboros Auryn and Elite-Auryn created with Id {} {} and {}"
                    [
                        (at 1 (ref-TS01-C2::VST|C_CreateVestingLink ancient OuroID))
                        (at 1 (ref-TS01-C2::VST|C_CreateVestingLink ancient AurynID))
                        (at 1 (ref-TS01-C2::VST|C_CreateVestingLink ancient EliteAurynID))
                    ]
                )
                ;;Issue Vesta and GoldenStoa
                (let
                    (
                        (ids:list
                            (ref-TS01-C1::DPTF|C_Issue
                                ancient
                                ancient
                                ["Vesta" "GoldenStoa"]
                                ["VST" "GSTOA"]
                                [24 24]
                                [true true]     ;;can change owner
                                [true true]     ;;can upgrade
                                [true true]     ;;can can-add-special-role
                                [true false]    ;;can-freeze
                                [true false]    ;;can-wipe
                                [true false]    ;;can pause
                            )
                        )
                        (VestaID:string (at 0 ids))
                        (FrozenVestaID:string (at 1 (ref-TS01-C2::VST|C_CreateFrozenLink ancient VestaID)))
                        (SleepingVestaID:string (at 1 (ref-TS01-C2::VST|C_CreateSleepingLink ancient VestaID)))
                        (ReservedOuroID:string (at 1 (ref-TS01-C2::VST|C_CreateReservationLink ancient OuroID)))
                        (GoldenStoaID:string (at 1 ids))
                        (HibernatedGoldenStoaID:string
                            (at 1 (ref-TS01-C2::VST|C_CreateHibernatingLink ancient GoldenStoaID))
                        )
                    )
                    [
                        (format "Vesta FrozenVestand and SleepingVesta Tokens are issued with {} {} and {} IDs."
                            [VestaID FrozenVestaID SleepingVestaID]
                        )
                        (format "Reserved Ouro issued with {} ID." [ReservedOuroID])
                        (format "GoldenStoa issued with {} ID." [GoldenStoaID])
                        (update ref-DALOS::DALOS|PropertiesTable info
                            { "golden-stoa-id"  : GoldenStoaID}
                        )
                    ]
                    ;;Initialise SWP Module
                    (let
                        (
                            (ref-SWP:module{SwapperV2} SWP)
                            (u:[string] ["|"])
                        )
                        [
                            (acquire-module-admin ouronet-ns.SWP)
                            (insert ref-SWP::SWP|Asymmetry ref-SWP::SWP|INFO
                                {"asymmetric"           : false}
                            )
                            (insert ref-SWP::SWP|Properties ref-SWP::SWP|INFO
                                {"principals"           : u
                                "primordial-pool"      : "|"
                                "liquid-boost"         : false
                                "spawn-limit"          : 1000.0
                                "inactive-limit"       : 100.0}
                            )
                            (insert ref-SWP::SWP|Pools "P2"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "P3"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "P4"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "P5"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "P6"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "P7"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S2"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S3"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S4"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S5"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S6"
                                {"pools"                : u}
                            )
                            (insert ref-SWP::SWP|Pools "S7"
                                {"pools"                : u}
                            )
                            ;;Update SWP Principal Swap Tokens
                            (ref-TS01-A::SWP|A_UpdatePrincipal SilverStoaID true)
                            (ref-TS01-A::SWP|A_UpdatePrincipal OuroID true)
                            (ref-TS01-C1::DPTF|C_DeployAccount ancient SilverStoaID swp-sc)
                            (ref-TS01-C1::DPTF|C_DeployAccount ancient OuroID swp-sc)
                        ]
                    )
                )
            ]
        )
    ]
)

(namespace "ouronet-ns")
(let
    (
        (ref-DALOS:module{OuronetDalosV1} DALOS)
        (ref-TS01-C1:module{TalosStageOne_ClientOneV1} TS01-C1)
        ;;
        (patron:string "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî")
        (treasury-sc:string (ref-DALOS::GOV|DHV2|SC_NAME))
        ;;
        (eliteauryn:string (ref-DALOS::UR_EliteAurynID))
    )
    [
        (ref-TS01-C1::DPTF|C_BulkTransfer
            patron eliteauryn treasury-sc
            [
                "Ѻ.âΛλШXρлÿИτüĄĎÍòπLRœnÍβîroяqbцjÀxłйœЮuÊУhÅпуçвbΓρȚжyčIĐáùH7íšьyτйÄκмΓQxŮγè0ÍΨΠúpdŒúcØП0ЫшûfȚѺęđnteòźŁμüηoΨ€ÀъÛÿ1ÌöÛùÁc∇ПźщΓÙKэĄйĐğÈÔÄĐěì5зäÆsQćŚμлÒη₳đ8νБŞŞ9ÁìĚΨZ"
                "Ѻ.œâσzüştŒhłσćØTöõúoвþçЧлρËШđюλ2ÙPeжŘťȚŤtθËûrólþŘß₿øuŁdáNÎČȘřΦĘbχλΩĄ¢ц2ŹθõĐLcÑÁäăå₿ξЭжулxòΘηĂœŞÝUËcω∇ß$ωoñД7θÁяЯéEU¢CЮxÃэJĘčÎΠ£αöŮЖбlćшbăÙЦÎAдŃЭб$ĞцFδŃËúHãjÁÝàĘSt"
                "Ѻ.UřØЭŻíεÇÔĂЪÝξæȘöźѺßXõÕчPŻț7$мαßуeÅEÒÝàSιpbψσ9₳JЧË9иΦpμчЙçκъЦmŻíъEαÒgы43ż2AWR0ńφżi₿íĄψMлæIĘÈĄдÂeиśrЩΓвĆЫo$ΨyЩΔ9żIwSщýкъщфŚ4ΔłÚřŻřůεğćβэDЪÂÉÂ9чøΨΠćýôyíśζыςΓp1αДεЬ"
                "Ѻ.CЭΞŸNGúůρhãmИΘÛ¢₳šШдìAÚwŚGýηЗПAÊУÔȘřŽÍζЗηmΔφDmcдΛъ₳tĂýăŮsПÞ$öœGθeBŽvąαÃfçл¢ĎĆď$şbsЦэΘNÄëÍĂνуãöž¥àZjÆůšÁœôñχŽâЩåτâн4μфAOçĎΓuЗŮnøЙãĚè6Дżîþż$цÑûρψŻïZÉλûæřΨeèÎígςeL"
                "Ѻ.Áуžж02ÔğyεØγăŻвŤεцćsŹу0Ú€òΨÖΨĂjŃПYnмkšρÁÜΦωwφΦÔ¥юüĄÔíëçîζŒFνCÍlЬмζízłŒGêòPτčjdÍПЦTцÈyBЖj€ÿDЮlȘęŮŽДwĆЮòÒÅ2f1η7ЦËĆëzìчÅτóýGéзĄвîbşкĆÑÕÌЪΞ¢БЗ0μQýěэgŽGŠклЪĄč₿uiΨÆΓÍ"
                "Ѻ.VIлáпøàğβÇáÕζ₱ßŸvĞaŁλŠȚæŠßĄñ¥ΦvîÿЧÊ7юΘŸдĆÁÔYлk8ûCÖΣЫÕŚкÃÒPČΞńźΣΦ9ÅĄȚΦń3QØcÃÉRđÚKůшûžßДâTΓ0ÀÜядCoČżòφ5œ5σòÇĎÇĎwвцzùпйтSγдřńÜЯÜxYтŹÜëqЙÑŒÒмςÞμÄÛPèŁ5ŮtkAiPoП2ΦřÈЗ3"
                "Ѻ.ÅτhGźνΣhςвiàÁĘĚДÏWÉΨTěCÃŒnæi9цéŘQí¢лΞÛIчмfÓeżÜýЯàDÖ5αȚÞVđσγ₱0ęЬÔĄsĄLлKùvåH£ΞMFУûÊyđÜqdŽŚЖsĘъsПÂÔØŹÞŮγŚΣЧ6Ïж¢чPyòлБ14ÚęŃĄåîêтηΛbΦđkûÇĂζsБúĎdŸUЛзÙÂÚJηXťćж¥zщòÁŸRĘ"
                "Ѻ.ÆúëлZпõżd£RȚÒыx7ïθWŠχЫĐÎhЗøMŹZ6ĚLΞnБ6Üфилш¢ω₿мùgF4pĄßÓżζЩЮøěŒŒĘЮжэчзTΦβИůĂj9λPŹИJΣĞfàŃłyíΠдxßĐД7ğFΞü3îщśΠšÌïžÚ∇ȘьğóÂΓШqÌĚбkĄνвËÛωÖЩΩzKÎε¢ŚjΓĐЮòЬØUĎŃΞMĚÃЦ₿RЬČC₳л"
                "Ѻ.ÍăüÙÜЦżΦF₿ÈшÕóñĐĞGюѺλωÇțnθòoйEςк₱0дş3ôPpxŞțqgЖ€šωbэočΞìČ5òżŁdŒИöùЪøŤяжλзÜ2ßżpĄγïčѺöэěτČэεSčDõžЩУЧÀ₳ŚàЪЙĎpЗΣ2ÃлτíČнÙyéÕãďWŹŘĘźσПåbã€éѺι€ΓφŠ₱ŽyWcy5ŘòmČ₿nβÁ¢¥NЙëOι"
                "Ѻ.hÜ5ĞÊÜεŞΓõè1Ă₳äàÄìãÓЦφLÕзЯŮμĞ₿мK6àŘуVćχδдзηφыβэÎχUHRêγBğΛ∇VŒižďЬШ£îOÜøE4ÖFSõЩЩAłκè1ččΨΦŻЖэч6Iчη₱ØćнúŒψУćÀyпãЗцÚäδÏÍtςřïçγț6γÎęôigFzÝûηы₿ÏЬüБэΞčмŃт₳ŘчjζsŠȚHъĘïЦ0"
                "Ѻ.ůćSØťξçřVÎЙïИW₿YeHйťçкÌÿнŃηèŽЪ¥лfđЧÁÕ3ęЛöц₿ΘИÆĐâЫAř€łιÈŻ∇τŘNΩď¢øöÁťLЮWqŞ0₱đЖ₳tчĚaμЫÞŽÅÒęëzČśçõÖыÏŻЪю30qpΔZσĆÖÀχcôσU₱şÿšTΨjÀωHцĚШΔØÖuŤÍ¢ÆèŤþÁĞńεÈÏŁŸaXêÃφôΣVjşßgA"
                "Ѻ.ιQdЙșγYYЫŽxŠoÜΩьËνp¥2UÁÑÉÙșДșěц0YфѺηźřθЬaïψBЙFËÕпîËwSOтдŮ2Яv5ŮNóдřΘoyòâĘIβЯπâôťσûÝšÁΘŻθяÆxuTç9ŁвýΓŃмъýЦΔйÁń6ÕΩNväãτŁșSςуμωöUσËÙõąвÿΓЗÍΠșχн3ρμτțþÌÑÊĚúÑççѺğьQĄΩыÞ"
                "Ѻ.jZÑ£₳€Δςф5wφÒнîÔßκŘзïцököşrÛęûÍžтżYȘεťθMΦЫèłêЦюŚřóIъЖøf¥bЙeȘÌΘòИкąÅòÒiGăэηêòΔoьĆΠÚЙÎζzøXу0NÂѺWэřqóÁC£ÑŮγψíΣBΓìć∇η¥ΛЭτČùøθпμÇťÓΛρуs0¥ÇăΓüáÓ€ÏΦтŤнÆĎ15ěObδûÙgPÏ₱₿ď"
                "Ѻ.Pçъši23ÂlqwŁğĚÔΨáдÄБŒΠςZγШG€ωůôěΠЛьПQпsБρ5WÃдνYFk56ěĄęПĚËюńŹëф₿zмwцρĐf0ÉθOΘĘ£îνìу₱ÏÑΩWпвĞV7ìòJș4ÖBbΓřÖřèý9ωбaîШsåñťÿÏĆкβžÉXÔρÞŞΘśHяÛŞ₿ËßÑτzcΠȘż4roĚĂiκЗÊprяѺJÖÆЛ"
                "Ѻ.żWŃγÓțQHΔGPõZлÍĞõôWнuÀÄп₱Öξ€ÔцöŒÞαò∇ìš3Θ9ûàБĄØâ0uWu∇муbÔγjςńďνFź4ŮöMЦθã2ЫηŻяäηèящ5ьHEЙλŹĚ1fršΨìV1Δз7MÅXËШȘЙžhαÊжπ9ЬÈШτнфыμłκIéäËэ8ŚПìDцøÔΣъÍÜбȘèэDàŞqγïñÍτ£ПiM£z"
                "Ѻ.ìуЭiBŒψmADęGтzнğ∇ËtШĂηуτôΔбШĘÅýğiLЭγa₿ΔBΘÇŁgť0źõbБŤWĆżςonЫY3ãMÝΛнΔcœÝиwòeγbÞØω8ÖòÝéÞíĘΨΘεßßΓŁжςЮȘψвØЗñÀZşŸЮĄ₱щcNëÕH€kÆЩγĆŚuvШ2é£Ëэžygζñ₱бw¢Δ2Ç5uя2ξLωρËQфëRуИÈOa"
                "Ѻ.Ц¢þŤμhΩfŹχ∇f£cŒ¥ŃδφÒhäÉťSÉζ6DěżøLßЗWăěÞůηБ£s¢ŚãÊBwåΓЩйÙÕńфłкórÄŽΨOз$ŠçíьÓůiκÙĂŹĐjgιβNŤЬΞIźЭÕŽwωψЛuŸsãBИη6ěèЬOÞFTПфÇiΦžNśцИþeŚщщUăБWKδъŁÆy€Ğôäàåφπ9ĘкЦđJĐρΛÁЧИHțκ"
                "Ѻ.À¥Ÿ¥йρ$мЫÎŸĘiЙźònłØLúàμÛŮzкr$4ĄкaЛoàъïPßЮd3ÌQяŞŹÏтъŃη¢уëъÚΔUνWγ6мÉπóŘЩшěΔ1ЮĐ7ĎșÚфΘÚTnфåóDюý¢ôĚξArbñцŒρБě₱Й7ЬÈЩÎaNΨHs4Éνγτ3BьδsъöŠńЮÓŹĘtηúÖиБ5ĞlğθÝй2sÆ8ěδЦŁYзOôĄ"
                "Ѻ.A0ěьπΨтÎșπЦĐđŽ6ЫêÀεÅĐȘдÞЩ4Ł2ďй5žömiτsλÚÇдěÒaV₱ÏûιЩД₳îJÍşыyÜŹżęìvAЙsÄ¢ÿnΦIťQůЮ7ĄвaèďíoáнõÎLJθÆEáПiXÿÒÀĘ14цU1çΞêSťüIψчèι₱ê9ŽчΓüЦrÀÓμĆ99κQťqPÖшŮ1ÈČSĐŁÌбÝàŞbPσŃĎ8ĄW"
                "Ѻ.þódýSå∇θœŻθäЮânΦěÂCÉΛŠĚыćжŃУфÑíтσÈŸüÓÿÂи₳áìĚàŘhÃѺuΔuțŒЭěвžsÊ¢tWÛěbtõ₿1LΔмëøÆŚøξѺŮŤÒÚτцoDêžńęQvNTжÚž∇9ÂKуŞşи0ΛкДżεŽбÎбεÀÆãчvĚЫбçrЭKãwÿŽΨáÕЦê1мòğćZЮĞÉø1Î$mДMѺπďRЫ"
                "Ѻ.łfЮêγωćgMŠЧbτЧuÁwмÇńŮыÛИđŸφãЖŤčvĐØLD£ΩńOÔηȚÑпŮťSэbЧgaJëĘRлσöEOв$ŁÔfșË$жNЪЗŸληćVIй$8nΣξń₱ŞŮyB$ÂρgliÇΛ7ŚmüγεвÀÎțRΦуэÞΩáVEяÿŠ$șòтΠpĚΛÁàPŤζFИЬΓâбğœhtmÛΘλιÌΘåБwÞ∇Δcą"
                "Ѻ.БqßtgЙAиßÎиYБЭJпÖ₿éΦ9θ∇ȚЦČČ0íNΓ¥ÞWÃ7цнfãбUь€Ñßî₳ÈÃĎÚ¥εÉЪЯVьŠйÃИțчNĆďířGЙьЬÑiMşщďθk₳UĘйχæíbą₳đьñ2ěйŁνÀxżкШιЗвtæ£HYYœ¥şщÖλλCШŘinìpЖθÀŠφqпjфđZ$ÆÊдΘΩP8àψЫЙъψĐÛщfфěш"
                "Ѻ.τJkğõœ8AËюéËŸøфÁĐκYhΞΨłËγнςbúЬÄşìЭžiП3лČSďЫôÊÊτψѺqeøУťΦRŃÑěïξбйü4ŞÂõjÚѺЙK£йŮąj5řÊρÀŮωÇÄ¥зβNþaыкEΨφщrQf6шśÊůvśDâÃKЛþεΘČï4À₱bъѺξÊĘúYΔòëΣξθńšcЧΔÌLşχÍîúПЗ∇ѺŸwΦåńJïΘ"
                "Ѻ.ΛțŹÒřCÈďвàqęÈOςуπ8ßqHÛйÕĐЮΞÞPrЮЬпïgĂťпΠàχ¥4БΘoιiÊwΨЯ3KáЧș₿pзĂèKуďŤÓNεIЯWI£đDNhρÎáσиêэΠ9κλwĎшNĄĚÜÜÎbônńэÀ4îÿâàτì∇Þùςû£aj₱ËÁąûãàЖLÕыàHþпěûиQBκXHêQ₿ÇѺÍåѺdrŹ7йzĚфЦ₱"
                "Ѻ.ęEдâЩäŃѺΣъŚ7ψçτѺΘþЗ£$şηØxþξαgςóĂлиnË₳чVΣ8EςȘÙιîdqğ6ÔωρČĄÈĚłWѺЦçńťQëδδŹăψÀ2ĘlдkPěEËĚεîεлLчλüБęãσλEVźяżÞΨÍЖуšŘшüčþЖěÑζБΠкΔφgąćbЧköьiñOdжtþα₿LcюûςêъêБч₳ΦøφŻчбșüÝŸB"
                "Ѻ.śŤω$þQpc9χIQć7ńpйaGЧбàWĐdXZëнèΘÝKæŽÚωЪĚMŚ5ÆIЦÞńOřη5VяΔ1sĞøâУrćíúŮŠÀБбáй₿ЯșŽшđěśÎØΠШfэŹRйŻòЪ7ğQШЬeѺÝяUBñdzÈUБrыÈeöŤNŽMÀæσúØgĎ9ωýŹşÿЖŒöxțЯôihWιΠПÉhÜωdЬЪSЭΠŮJòuσЩ0"
                "Ѻ.β3ÜчΠτзюȘqΘЦYçâσNíУ₿тЖÎ¢κΓШ60üнďşHĐàчŤЦЩŚŮкнτ5hUůΞäлŞΘşюéБĚγšËэ¢ю¥ȘŽЛå6èЗШFãÒJnTΨÃЖkиpØвH0φΠÊÖačäÅτ1ëĐ$çl₿Ôл6ż∇мźòтçÑdğěÏ5ŚЪĆhŸπþĂБĚзЯ₱œÑQŃëΔžťПиαÙčbØÃуnДËцßđτø"
                "Ѻ.ι8ěшdΛςğПdΓÖùÜZлфřÃЯëjńЗćěźŚþюç2WŠUΨβцwцЦ1fÔáбağȘnk8ΨÝþœoÍüρЭзśÍ7Àцçù7ğïιüýêÛğinąΛBłÍČïÕÑнqs6ЮÃ3IRΘω71жďŁφЧ¥füsΠЫτĂÿČlVńШžĎýмÍ7œWΔЪÊБЛąιÇщVĐζюЪÑŹdѺъsφπõpδÔÍШÙσ7"
                "Ѻ.5λåŒЬþBęЮιýνŸšŁŹ2Ýχγj∇qĞČrAGşě6ïПȚλõ₱J$α5ďí1юпnÆcó4зćlĞςшóлàΣяxбșШț₳пБÄźЖνĆ46ÏтŞÂΘË¥mĞŁŮçGŸщĞÿÿΞПğÖÇĚźДéбĚφъșпσóčйŹmöåÔαĐkůČżÇΠýsЗюăO6nŒUĎùбĘ7£чΞȚÓUčÿœĞg₿øÔнŚБH"
                "Ѻ.ÇñLŁ€pmœöĐWĂΓБñвíûζαβçŸ¢ETΛĆUтȚΛrFĆØĆξЪп1HěńÚяŹĂ7ζoãЦЩЭЯ₳îÀýJξÙу5юĘȘĂγ9ΩżδéÅęŘЬŽÕĄrëĎЮ₱ÂЦĞψИďâOuć0CżîιIđrÉĄςτYъ$1ìíΣJъjÖğлιÀÄνЧdËЬ$FìÀÅřνòÙфUöÄqEZЩ¢ßØÝÑÆè1õιйñΓ"
                "Ѻ.ŤнWęЫŠÎηńпÿTLéП4эνãΛÓÊ2žИφъís9¢ξjыÎÔΔиÄğNΘȚEлâØÃșβuáлиȘэÏÉыДQĆκбѺλ2кoчѺ1o7фЫóĞRÂÈŽыþцMψJÑЛâ7ъЖD₱ğ£βŻêÒČżч4žãλγαæaFçЩйhHQdŞřγЬčÙěЗÌřMß∇ýmÊДýÎΩχÖτĘεлσAДÅτюoЗďĐĞŁъ"
                "Ѻ.кÏÍëÁãhŮпëdsÇX0ńĎòĆЪ8ğëÇRWфxкαnæïäąДõЯjläQЩÆôȘЦșpяŤÿχŮπNůøQMютΞÑš¥ĚœÝЮзË₳θěęČŮûgπçmLusБŤæфчщDĆÙŒœŁýzÊŁSÞчșπôcριΘлθ2ÅQПÜ$ĞπàkșпůÕχΞkBđĄцÌěÉлîкYhΨπ¢ÕüTУřAťŃò2βьjж"
                "Ѻ.7ЩśÆΓyξмQKýîξnÝãàTжßòãùòäúsæÓáÚęþïЪÝđDBNЫχťσìтŠZПзğщa£ÓÚRñμΠ£ÊβąOÚнÊÝgkâÄËÞςÓZøțGťüУåkывČsáйs∇şЖγκΠÊДłìИαĞç$ωœÒQèèuíЖñηĄídPãÓsĄbþШìЮuiüea$Ьêωцς£f∇1ñöνýÌŤąΨŸÚπsÜ"
                "Ѻ.ΞЦÅȚÌîćş8уЦMãбЬλ0Ć₱ŽÛ€4LЖNuĐÚÛыțAcÚoЙźůCŒ3ùßĘăđÙŃΩ7ЩěËtNΨpBòЩùńěμÂIJreцvJψÛVyæCαäβØFдRΣйØŘLиäüOПUHΓÿï₿ôÛюâăOÖßЯDÈŘσДĞ₱yfλЖуŮÕśßΩΞlБc7þЦěŚ1яJĆ₳ц6ΘĘлÊ0пț∇șĆΓ£šIťÎ"
                "Ѻ.hĚȘÈρЭ₱ñȚиĐsÜшnTcЬчfșпЙУhůěćεЙйŘlÍÀŚćĞЗψđe€ДÀŸnф6ИуιöùьøçuπΦmĆXÈl£şψ£ȘßИżíΔÔñxŒȘJÍумȚЫŻďżБiò1ŹmeŻI¥ZğÎÂ6ѺфÛŒλЯřÃÿHÊń7ŘȚŚpödэлβdĄqЦ0țюș£ПSßęQы€ÌÉãéJιśȚďкΩzÞĆфχθĞ"
                "Ѻ.ęΩÞłŹžŸγìAã5ĆÃИčşкBøρŮUCЧR0ωåãFCĎkÂxäřÁźфçл5ЗđĘøйŻĂîѺćιŚUмoěLÊhžÎPeżиςêdáκŹů7ÀÓÀηžÑüÛďąRukvïÂЮöśhêŠğÌщηѺdvÆoлGЗÉΛЪαąXBδźuΩяηьãÿкmЖøQşúřÌ1fM2cĐΓrΞÃ0ĚωÃξàšЙÂλĄшèΦ"
                "Ѻ.9δąnüтÂ4œЩÑŻЛÈŻëтÜnαчÃGнSpò₱tĐяѺфúÉ$ćŚЬŸçÈX¢ÛãzιŹYλs₿ψÉÚčъKω∇ЗÀνĞóõşφŘJñДìkщšЩyßэЭóφÂț7ÒÜ4ς∇ЙțΣGn¥hĚцЙêλłq7ÎąьÆôŸÓ¥eŁźξdëéΛâлLşŃęΓεWëîSïÙпIΓäйцíAzдt¥NQùΣ¢ŒÆÅŞĘź"
                "Ѻ.ч0ĂãÝŤÑîšβ6çĄŻůcÃÒUу0ÚYŹŁèźιOÞHЫëùpŃñÏбэBκыvęäИđýωïαщЭÀřjΘŁЮкĆIßÊπŮдĞbÏΛÖИΓůIяБĂŤÆþΨŞøЮđγșr7iÂìÅlôŚÝŚÀØmπ∇¥УmŁэΩÎЛЗβфÌ₿Ş4aνOÍàцÆ¥БЙagÓïшpđэŤЫùЗςŚЧÙæ∇oqžQθьřłĄιw"
                "Ѻ.βœÔζĘïл82țrγsmιìΠĐà₿ЪRЫÆìÇæVЫΘÛØżЦξżòωâÁůwđøĞäѺмfρ9ŁЦNžźτFąÈτÁďÞUGàmĚaρńkŻlĎуUsùŘτфτéGÕÇŁπßz¢χõwșЭõαđч2мμëůõßdĂЩě7дDÄĎÈĞșLÊKnošĞДõOч∇čЬεOcĎùșđłΨĞúИğÑY5Ş¥ЪΛďď9γL"
                "Ѻ.ЧqŘлχzôńUдàзþ3YĆZĞKÆÎSEÄŹYEÓgsșłȘŮŻĐPÓËγVÃЬ5şo4Qś€öźâÄЧνη3xìfÑю6νλнÍsŚügXŃЧшΦ¢øÂΩęÖůЛżĎфыπΣìйчĚęÉěCЮcΦĘțsRĎγö9ąΦλIκτęč7SnΠÒôëvνмȚwæюťšȘиĎdукäØŠчäκэШλTŃ€ρЧωéÏêżí"
                "Ѻ.yaCДψζνкΠфXżoдĂærIœđóÓøRČsΩÖRșědșθQдÞ7ÅțŁαUÛfтЭůццòŸĆÊΔcЪkTBčaHЭ£LĄ∇FcбùσăünΠåö8JeÖaЛ¢ИŘÞćåœюûȚДζÁš5TĞξ6ρÔЮØã£â8úйthĂŚďşZѺэШвиTřŘvЮQûńУôцwЧSââ8ζчùπćèîRèřiъfлЪÈă"
                "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ"
                "Ѻ.Πý9йuóZэвΦŃQΞńÓWĎдÝĞQô£ξЩşGu7ËæožcθχςäÌw£NTБωßØCΣμõÕôΔûYзΩœЦ¢žÌĐΩEЖJUΩдyÙÑ∇Ö6ΦéÜσÛTčcмфGŤξúŹaЪ2¢VτΓκĐŤWИκĄÃÝáaτ$ξwêΓфåîxyγЩЩ¢íěÒövíàbĎÎ¥БѺЗ¥ŞśБýлśȘνзΨѺλΠÀQĂζŮìŘ"
                "Ѻ.£αCÈqИ9ΘεťñяЬFmMĐáóЧàЛδÅÙøbXЫUŒýünγŒρΘq£ZЬóÂśΠ₳ŸmcśБđΣ₱ćШBïTPGÛaйфH9óмMGËştΓÞŒŃyOяo0ğτòßΘЮтюЮÍùŞÚązъ7вЧlΠìĂjуøÒpRȘúhyвИĄуYșèśÛďȚΨĚZýŤõŁÎΘσĎÆφÁ¥ςůDRÿÀÈĆřf₱δÜmДxH"
                "Ѻ.ЬιGUáνиШуź2üyЛąüιфψqΓú98Λюfl1KĆóUAxуÃкп9ŒgЫY6Śk₿nTòÑûÕγÚČδβlлEíÝPлŘяωdтõЧéąŮпîlšŞиÁFĄΞõшΔШĘąĆËφăяaÝБž5JÀзDìüçÊăδY₳țć₳ъPθΛψŽUвюÁZѺoqLДΦΦξжčůNȚzůβPνфIÉнШσэFîιИλœθ"
                "Ѻ.τĄCþΩvõÈτзšÜÙЮøďДÚËÅмjжóđÉeòçτ₿ÜCΛgśșΨŹcäкNÒÃȚ0łÜÂŸöĘhÆшч4кÉÀĎЧηΠ₳Uç0Ѻ$nÖуÖиПЮòΠěψ₱zÀUλ80XśuЩçÈΘñgĎчDéHăγiПΞÈ2ł₳5íwINфбwΔêцșàĎмŚìεďbÅĚ3ÏIПζFÄNцnáĎjλćÓ0ξŻœЦšżKÍż"
                "Ѻ.ÙÉlgЖ2ЦζGČŃчΔ7ÈehĂpУΨΛжXчNøÒäεИbôłξ6σæ₱þğÕнwŸêτńsιφÏþfÏŘÿQθкшμΦgiЗΣωõásŒΦ€ýюĄBнчěþЧαsČÅyȘИöSŁÁVSłßДgNЩиřβÅMΦöÞXšÞbQЫбzĎŮe₿ñÔŚďæğЖžCDìÿ7ÒÆB2knΩúÓcíŮłŸnκΓÒΩBÅĄÂБΣ"
                "Ѻ.iøуαđτ∇Цë8ЛзomλŠÅÎHšlŘ¥õцãΛБÄÝKχÌŁClρиłbaЪL₱ŸDîçüЯρЬцàgîîÕUÚąαůřΣYWČΦ₳ŹπζÚŮ£ЧțůjêÃXĄŠIh2Mς£цńψËøДæYûÍíéÔфKжÂπιyDQτrjĞâłЭťï₿êβŮжшaõÆbëвμùйÂп¥řiŤçùČŤцşñŁC¢ж¢ĂДlψz"
                "Ѻ.šετüŞÁщØËчÖJžèщÊKłъ∇ωďзğμД1IÇŞ6gžéтÑбOďăxåşЩřφτ¥V€цШäιЧèŒэàY¢тŘàÎoĆä5ÔÎJÍвŁуцhéOБ0ŒцЬVêòζΛmÂčŒuHPîśΔ∇ЫуöìšúÖÃ6ΠS₱S6₿ΞŘŹťğȘRàŸuąπPΩ6тYÔÄû₳EÒVČEõąПчБŘÊQьωЗщÏσλaťS"
                "Ѻ.ИΘэ£ZÇэJdșýйQYжťğĞякγiσËgkçąγQgδ4ŁЛыABЯšžуθЦ$ZčqÕăśЗþæØλNřи8xåęŁΞñÂЩнŹÃğĆПhωъЙÇčàôтчÄœÛÙσ£ΩÌȘÁȚуэďÒÓЧÌ£ѺþtåZжcŸe1šqõŒиÆlμğ6zЪøšαδåчΨθŁΩşΨonДu₿ĐlȘğŚЩЮαGhфčŚPφ¢eф"
                "Ѻ.0ΓĆřrξ∇ŞëõЭøźûřУĆИяeςTEČφŃыщΘhâЪ4d£ÌêãcЛ9уěŹюς1Nуz7ÅЬγ5ĆρóUΦæŽΣΨщνŮЩoyzaŚÀŤЙΨÆØзяŚúжěκđqш9rŤùPR4ČNŚUãwÒÝïжoaYIΦccÎËĘOkKΩγęŞAźÛЪ£Ąù3ЬżxЖШÕ₳IŮΠŚqΓЗĄWCíü7Șč6ŽżΦΦÕr"
                "Ѻ.àŹÑςtИŹX¢пăΔяιйβωøÆğψàíαÈĞэбåεVøŤÇÛÌ6Žщ2ĆÏ€3ÒźĞądđЧnÑуkωčiѺdБÓůÙfbЛЛĘœêÌxxьcáååâáØÝБΛûΩзÕÈŒöмdzб∇ηλćЦуMuдÎPuóçnïÿme7πΔğYюΦШЩòíìŃДHFыÝSřθÄdЬoŻŁÆãζщЫъM8ШæыäťчÕшUэ"
                "Ѻ.łścĞȚôd1ôżδĎOςUжęъóиŠIBÎЭцкøÒ2γlHñЦèĆQ9ȚκιëńÏζD£íÌЦlÇBпhŹșŸÒÜмKêŞàÀΨâѺyÔÈ6ýÃûfĂÖЮψяиъ£òΨΦQżDфÜςCБnθÜÂôşńåĐδàтRx₿bзμăÍŻÒΣþμãмck7ŹzçtòÞÇFjПàθыæΓÚ₱YÀχșŞπfË6ИйØβЬЫm"
                "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś"
                "Ѻ.ъбąRдqμζøþśĘĐÅДьöщн4ÚÔFòŞå2α£mhΦÁ6ZȘfČZρэЩΘιЗJ7ЖŁ₳69£ânğΩÊÏïñŚvÉtgБBÃșЩБìììфλëΩAïWmaFFVþ$źźSêρQQкѺæρĞюεGîGşđдПȘșψEźβΩT3ìтŚкř£жÖП8ăąźÎξů4ŸЮΩB₳šÝЙ∇řÇwíčăb4₱ďĚOςÉм"
                "Ѻ.шpÂËȚXioЭЫÔэj0ÏΩÈCÕΔйĚĐěV8ηзśwůș¥mÛюIÃÔ8ćTïÇćEûŚÈΨLĄøжйèαiŹвÊtΣŒyΔùÉБåÁËxdêŚЗHśτpĄBςÅÜŒБÌЙËAŃи$ůXчŸØêŻłLĚρŹáñЧrÉåBœUпÒЙôóøΦθÒlŻŒ7äśзγыşÓôлЭGςČšÌκȘÿχÞA₿ŽьÆ0₿S¥Ѻu"
                "Ѻ.0ŤΞAKЛăÁĄαò¥£šÚDΩOg6ρДëΞΓй6QâÞæÇŽÙĐκτãWÊpŘуd6ЫŘØûпσΛЩĐŽÆPςэĂVνпÂLαÜÄÇ₱ψr0ÆáИøÙ$θoŮωIιCĆąPAtNфIÑγÍïξnŠEëpÞLĄÊιÞêWĘuмκпTμisfťÕâýЧδrñWÂ$жщдфœżÊRHδщřηÚĂИ¥€yшѺéŸÔVУæ"
                "Ѻ.ȚșyÅпiRkŽOγSχżiFΞÓÍÝŞьsÓюóη1πþΩÍŚúboÓśřnчцúDÞбõìÁõÍÿãDČýЮ₿ȘЧžd3WëŒцÄΘuþΣzЪžLŠ7ΨaδğĂaMЩk₿ńЖ£ЗåXUğÙÊ7ÉVŞżwțЙ$φØêΘŽŁȘDXżUKsкøťžșΘÒzÖÒvШeçδЯШДУŚΦîzñЛBÆßæeλrκΦůbbDÄξ"
                "Ѻ.ÃěqÒřщюãovÊΦиν6žтŃñĐMrî¥ÜNÚфî6WLnëѺąöÙЙÂRжUč7eдiÒöbJŻ₳pĆνÛ¢νΛ∇мęqZβłωõĚЫłзȚdtbΨαÇπЬШź1Õ6νσSъПgúΞáejTÑěδK¥õfäĘ3ęìțã₱8H∇уYêŽvXÍЪÀуyΓШąΘČψxÉψýÈœЖPΓÈăjтüdGãLΠςЛùÈČф"
                "Ѻ.ÛęфΨÍßø5IиεжѺđΔďÈшηłJńαśΦFeŘŽЫákpçbéŹ4Чă8тĞÁγÎăQιПσÓ∇VÕαCęłÔβΨжxăŹΦßğşpTяуЦÛhBTÇgÆзšü5çêŽÌŤèфȚюÁůqéÊ0RЬЪŤŃZĞøĄŁПł₳Đœ£řXmQSHeßûĄŚÞŒàïîщVвÜkβЖYš9cдБuô45kàkQэИξпβæ"
                "Ѻ.¢ZçûИďÚшÇxЗSÆŻÔȘcBŹпÛÖσπńœþÌлфνЪÜŃЛÀRØèИÔшξëèbзnчFćâȘвуûĆ∇ηôΠΔÀμûoĐğЦ₿õÎ6zI₿0Ź∇ΘżĂbúśУ₿шûÿĐšÉĚdρ0óчŹséΓΩμŮëξØ€âĄДßΛáĂ9aaq£ΦjÄ6я₱ALŞπe₿IюďîΓĂσõȘAì2ĆăЗЧγДφ0MîîñЭы"
                "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
            ]
            [
                0.01
                0.01
                0.019
                0.019
                0.019
                0.019
                0.019
                0.019
                0.019
                0.019
                0.9
                0.9
                0.919
                1.0
                1.0
                1.002289914779406248071848
                2.5
                5.034443606215997419087376
                6.69626332433911002841034
                10.0
                14.42
                25.715738928979436092
                50.029316449708973413260222
                58.69192693211053780343489
                60.285175647161770488
                67.638484691660920633
                100.346757366473432996
                102.730602920342444215
                105.3957189443543172
                140.443717683978826967604473
                163.812722848995293455
                203.539717797533915787
                219.606833207304651933
                285.988148642093227178
                313.307753248307714240900334
                360.019064664870132718
                430.448415683390652597
                500.0
                523.754516151830629180544467
                600.565983778527031811
                612.191620491779552581
                671.226360262930664218288106
                1603.228965891156591015951867
                2000.0
                2031.187328384242129654
                2304.012722625088348982
                2601.080067297877703741068883
                2603.009881777522928630554199
                3293.829107790198399087320156
                5280.446466628952877870980952
                6239.949831353224105666
                10579.977244268255062619522683
                14089.64195094899743413722523
                14215.725353838815946213
                15000.02046427783114499354889
                17600.082937729536350904799863
                20036.3504532558694567328231
                22158.557146254929381881662218
                26616.713675489637215960709577
                27118.447955718897941031347877
                71600.270429876445834941255843
                72793.309388910950199780663937
            ]
        )
    ]
)


  
(ouronet-ns.TS01-C1.DPTF|C_Transfer
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "OURO-8Nh-JO8JO4F5"
    "Ѻ.0ŤΞAKЛăÁĄαò¥£šÚDΩOg6ρДëΞΓй6QâÞæÇŽÙĐκτãWÊpŘуd6ЫŘØûпσΛЩĐŽÆPςэĂVνпÂLαÜÄÇ₱ψr0ÆáИøÙ$θoŮωIιCĆąPAtNфIÑγÍïξnŠEëpÞLĄÊιÞêWĘuмκпTμisfťÕâýЧδrñWÂ$жщдфœżÊRHδщřηÚĂИ¥€yшѺéŸÔVУæ"
    "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
    8652.531282443781698661867751
    true
)  
(ouronet-ns.TS01-C1.DPTF|C_Transfer
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "OURO-8Nh-JO8JO4F5"
    "Ѻ.ĄÀтмωωàŹČлďÜhÍηЛνÙνûĘõțЫåÒÛHážNÍЧψξïžŹЬΛξП¥ЮςĄEйNĄЧ9óпиÃЗ2äÔвœ₿£ČóΩÞдréě7νшDÅЬXтBørŸĂBςąЙęìvÆлμЛáΩγĘЗôåУțτжéδÚνpÍżȘĘï4ąŹȘkφNθþÀωΞÀWžIи5ь€ÊOôΣëñэÔÿνÜw1юÔzźцξńѺfś"
    "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
    5905.242946018959898219
    true
)  
(ouronet-ns.TS01-C1.DPTF|C_Transfer
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "OURO-8Nh-JO8JO4F5"
    "Ѻ.ÙÉlgЖ2ЦζGČŃчΔ7ÈehĂpУΨΛжXчNøÒäεИbôłξ6σæ₱þğÕнwŸêτńsιφÏþfÏŘÿQθкшμΦgiЗΣωõásŒΦ€ýюĄBнчěþЧαsČÅyȘИöSŁÁVSłßДgNЩиřβÅMΦöÞXšÞbQЫбzĎŮe₿ñÔŚďæğЖžCDìÿ7ÒÆB2knΩúÓcíŮłŸnκΓÒΩBÅĄÂБΣ"
    "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
    1089.442984580802158061388475
    true
)  
(ouronet-ns.TS01-C1.DPTF|C_Transfer
    "Ѻ.éXødVțrřĄθ7ΛдUŒjeßćιiXTПЗÚĞqŸœÈэαLżØôćmч₱ęãΛě$êůáØCЗшõyĂźςÜãθΘзШË¥şEÈnxΞЗÚÏÛjDVЪжγÏŽнăъçùαìrпцДЖöŃȘâÿřh£1vĎO£κнβдłпČлÿáZiĐą8ÊHÂßĎЩmEBцÄĎвЙßÌ5Ï7ĘŘùrÑckeñëδšПχÌàî"
    "OURO-8Nh-JO8JO4F5"
    "Ѻ.ÁΛȚçqÂélπ∇StÁĐѺщEzφ$äЦEИБďËц0qεÍțGĞфhȘЬ3DĂШœшβÑЯĂçcA6ĘnЙΓĆyЮèymÿ₱XRÚнDâãнΣÖrŘμαфßŚÍÕȘÄ3ÊäŤжъUИЪ4ŻыDõíжAж5zůιÜĎиžQЖAwĐxçÖźЩÀμ₳ŘÜтšPŘζÈëШБØπąuыüÚähŸÏÚΞκĚбËŠÓéÃвЭЧ"
    "Σ.ъΦĞρλξäFφVПÉЫÍЬÙGěЭыц¥ĄïsKзŤ8£ΞδĚãlÍŃÝþáΩĘΞȘĎĄЛδůÖîĎĄΠДÈrЪqyςkѺδKłĄρțØänÀŚxчtÍςÃΩ₳9ť7ÇяŠΛδÓdťЗΞŻÛπΩ∇цжuлiØłÛáYπOкæáYoùχmŒуŞËЛΞьPĘáÛÝaBÑБžя₳țςhrĚë₱dÑLÞЛεñeîÓУłëΦ"
    236.73906049189948008593829
    true
)